package lzy.module.bazi

/**
 *
 * User: longzhiyou 
 * Date: 2018/6/25 
 * Time: 15:09 
 */
class BaZiAlgorithm {

    //阴阳
    static  infoYinYang = ["阴", "阳"]

    //天干
    static  infoTianGan = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"]

    //地支
    static  infoDiZhi = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]

    //五行
    static  infoWuXing = ["木", "火", "土", "金", "水"]


    //十二时
    static  infoHour= ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]

    //十二月
    static infoMonth = ["寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥","子", "丑"]


    static def nayinwuxing=[


            "甲子":"海中金","乙丑":"海中金","丙寅":"炉中火","丁卯":"炉中火","戊辰":"大林木","己巳":"大林木","庚午":"路旁土","辛未":"路旁土","壬申":"剑锋金","癸酉":"剑锋金",

            "甲戌":"山头火","乙亥":"山头火","丙子":"涧下水","丁丑":"涧下水","戊寅":"城头土","己卯":"城头土","庚辰":"白蜡金","辛巳":"白蜡金","壬午":"杨柳木","癸未":"杨柳木",

            "甲申":"泉中水","乙酉":"泉中水","丙戌":"屋上土","丁亥":"屋上土","戊子":"霹雳火","己丑":"霹雳火","庚寅":"松柏木","辛卯":"松柏木","壬辰":"长流水","癸巳":"长流水",

            "甲午":"沙中金","乙未":"沙中金","丙申":"山下火","丁酉":"山下火","戊戌":"平地木","己亥":"平地木","庚子":"壁上土","辛丑":"壁上土","壬寅":"金箔金","癸卯":"金箔金",

            "甲辰":"复灯火","乙巳":"复灯火","丙午":"天河水","丁未":"天河水","戊申":"大驿土","己酉":"大驿土","庚戌":"钗钏金","辛亥":"钗钏金","壬子":"桑拓木","癸丑":"桑拓木",

            "甲寅":"大溪水","乙卯":"大溪水","丙辰":"沙中土","丁巳":"沙中土","戊午":"天上火","己未":"天上火","庚申":"石榴木","辛酉":"石榴木","壬戌":"大海水","癸亥":"大海水"
    ]

    static  getNaYinWuXing(jiazi){

        def nayin = nayinwuxing.get(jiazi)


        return nayin[2]

    }

    
    //五虎遁
    def dunlugan=["甲":["丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥","丙子", "丁丑"],
                  "己":["丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥","丙子", "丁丑"],

                  "乙":["戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥","戊子", "己丑"],
                  "庚":["戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥","戊子", "己丑"],

                  "丙":["庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥","庚子", "辛丑"],
                  "辛":["庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥","庚子", "辛丑"],

                  "丁":["壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥","壬子", "癸丑"],
                  "壬":["壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥","壬子", "癸丑"],

                  "戊":["甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥","甲子", "乙丑"],
                  "癸":["甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥","甲子", "乙丑"]]

    //天干禄地支
    static ganLu =[
            "甲":"寅",
            "乙":"卯",
            "丙":"巳",
            "丁":"午",
            "戊":"巳",
            "己":"午",
            "庚":"申",
            "辛":"酉",
            "壬":"亥",
            "癸":"子"]

    //天乙贵人
    def tianyi=["甲":"丑未" ,"戊":"丑未" ,"庚":"丑未",
                   "乙":"子申" ,"己":"子申" ,
                   "丙":"亥酉" ,"丁":"亥酉" ,
                   "壬":"巳卯" ,"癸":"巳卯" ,
                   "辛":"午寅"]

    //【纳音五行正印】
    def wuxingzhengyin = ["金":"乙丑",
                          "木":"癸未" ,
                          "水":"壬辰",
                          "火":"甲戌",
                          "土":"丙辰"]

    //进交退伏
    def jinjiaotuifu = [ "甲子":"进","己卯":"进","甲午":"进","己酉":"进",
                         "丙子":"交","辛卯":"交","丙午":"交","辛酉":"交",
                         "丁丑":"退","壬辰":"退","丁未":"退","壬戌":"退",
                         "戊寅":"伏","癸巳":"伏","戊申":"伏","癸亥":"伏"]
    //截路空亡
    def jielukongwang = ["甲":"申酉","己":"申酉" ,
                          "乙":"午未","庚":"午未",
                          "丙":"辰巳","辛":"辰巳",
                          "丁":"寅卯","壬":"寅卯",
                          "戊":"子丑戌亥","癸":"子丑戌亥"]

    def jieluzhu = ["甲申","己酉","乙未","庚午","丙辰","辛巳","丁卯","壬寅","戊子","戊戌","癸丑","癸亥"]

    //驿马
    static def yima =[
            "申":"寅",
            "子":"寅",
            "辰":"寅",

            "亥":"巳",
            "卯":"巳",
            "未":"巳",

            "寅":"申",
            "午":"申",
            "戌":"申",

            "巳":"亥",
            "酉":"亥",
            "丑":"亥"
    ]

    //劫杀-五行绝地
    static def jiesha=[
            "申":"巳",
            "子":"巳",
            "辰":"巳",

            "亥":"申",
            "卯":"申",
            "未":"申",

            "寅":"亥",
            "午":"亥",
            "戌":"亥",

            "巳":"寅",
            "酉":"寅",
            "丑":"寅"
    ]

    //亡神-五行禄地
    static def wangshen=[
            "申":"亥",
            "子":"亥",
            "辰":"亥",

            "亥":"寅",
            "卯":"寅",
            "未":"寅",

            "寅":"巳",
            "午":"巳",
            "戌":"巳",

            "巳":"申",
            "酉":"申",
            "丑":"申"
    ]

    //纳音自坐
    //天干旺
    static wangZhu = ["甲寅","乙卯","丙午","丁巳","戊午","丁巳","庚申","辛酉","壬子","癸亥"]


    //长生诀
    static  infoChangShengJue = ["长生","沐浴","冠带","临官","帝旺","衰","病","死","墓","绝","胎","养"]
    //长生诀不同的名称
    static mapChangShengJueName =
            [
                    "生":"长生",
                    "败":"沐浴",
                    "禄":"临官",
                    "旺":"帝旺",
                    "刃":"帝旺",
                    "阳刃":"帝旺",
                    "羊刃":"帝旺",
                    "库":"墓"
            ]
}
