/**
 * @author lzy
 * created on 2017-04-17
 */
(function () {
    'use strict';

    angular.module('BlurAdmin.pages.customers')
        .controller('customersDetailCtrl', DetailCtrl);

    /** @ngInject */
    function DetailCtrl($stateParams, $state, Restangular, promptService, setting) {
        var vm = this;
        vm.id=$stateParams.id;

        vm.jiaziCombox = [
            {title: "甲子",value: '甲子'},
            {title: "乙丑",value: '乙丑'},
            {title: "丙寅",value: '丙寅'},
            {title: "丁卯",value: '丁卯'},
            {title: "戊辰",value: '戊辰'},
            {title: "己巳",value: '己巳'},
            {title: "庚午",value: '庚午'},
            {title: "辛未",value: '辛未'},
            {title: "壬申",value: '壬申'},
            {title: "癸酉",value: '癸酉'},
            {title: "甲戌",value: '甲戌'},
            {title: "乙亥",value: '乙亥'},
            {title: "丙子",value: '丙子'},
            {title: "丁丑",value: '丁丑'},
            {title: "戊寅",value: '戊寅'},
            {title: "己卯",value: '己卯'},
            {title: "庚辰",value: '庚辰'},
            {title: "辛巳",value: '辛巳'},
            {title: "壬午",value: '壬午'},
            {title: "癸未",value: '癸未'},
            {title: "甲申",value: '甲申'},
            {title: "乙酉",value: '乙酉'},
            {title: "丙戌",value: '丙戌'},
            {title: "丁亥",value: '丁亥'},
            {title: "戊子",value: '戊子'},
            {title: "己丑",value: '己丑'},
            {title: "庚寅",value: '庚寅'},
            {title: "辛卯",value: '辛卯'},
            {title: "壬辰",value: '壬辰'},
            {title: "癸巳",value: '癸巳'},
            {title: "甲午",value: '甲午'},
            {title: "乙未",value: '乙未'},
            {title: "丙申",value: '丙申'},
            {title: "丁酉",value: '丁酉'},
            {title: "戊戌",value: '戊戌'},
            {title: "己亥",value: '己亥'},
            {title: "庚子",value: '庚子'},
            {title: "辛丑",value: '辛丑'},
            {title: "壬寅",value: '壬寅'},
            {title: "癸卯",value: '癸卯'},
            {title: "甲辰",value: '甲辰'},
            {title: "乙巳",value: '乙巳'},
            {title: "丙午",value: '丙午'},
            {title: "丁未",value: '丁未'},
            {title: "戊申",value: '戊申'},
            {title: "己酉",value: '己酉'},
            {title: "庚戌",value: '庚戌'},
            {title: "辛亥",value: '辛亥'},
            {title: "壬子",value: '壬子'},
            {title: "癸丑",value: '癸丑'},
            {title: "甲寅",value: '甲寅'},
            {title: "乙卯",value: '乙卯'},
            {title: "丙辰",value: '丙辰'},
            {title: "丁巳",value: '丁巳'},
            {title: "戊午",value: '戊午'},
            {title: "己未",value: '己未'},
            {title: "庚申",value: '庚申'},
            {title: "辛酉",value: '辛酉'},
            {title: "壬戌",value: '壬戌'},
            {title: "癸亥",value: '癸亥'}
        ];



        // vm.customer = $stateParams.customer;
        vm.importantInfo={};

        vm.strBaZi = "甲子 丙寅 丁卯 癸亥";

        //出生年
        vm.birth = "1984-01-01";
        vm.countYear = moment().years();

        //年
        vm.niangan = "";
        vm.nianzhi = "";
        vm.nianzhu = "";
        vm.niannayin = "";

        //月
        vm.yuegan = "";
        vm.yuezhi = "";
        vm.yuezhu = "";
        vm.yuenayin = "";

        //日
        vm.rigan = "";
        vm.rizhi = "";
        vm.rizhu = "";
        vm.rinayin = "";

        //时
        vm.shigan = "";
        vm.shizhi = "";
        vm.shizhu = "";
        vm.shinayin = "";

        //胎
        vm.taigan = "";
        vm.taizhi = "";
        vm.taizhu = "";
        vm.tainayin = "";


        vm.dayunSelect = vm.jiaziCombox[0];
        vm.liunianSelect = vm.jiaziCombox[0];


        //大运
        vm.dayungan;
        vm.dayunzhi;
        vm.dayunzhu ;
        vm.dayunnayin;

        //流年
        vm.liunianSelect =vm.jiaziCombox[0];
        vm.liuniangan;
        vm.liunianzhi;
        vm.liunianzhu;
        vm.liuniannayin;

        //行年
        vm.xingnianganSelect =vm.jiaziCombox[0];
        vm.xingniangan;
        vm.xingnianzhi;
        vm.xingnianzhu ;
        vm.xingniannayin ;




        // 性别
        vm.genderList = [{
            title: '男',
            value: '1'
        },
            {
                title: '女',
                value: '2'
            }
        ];




        //阴阳
        var yinyang = ["阴", "阳"];

        //天干
        var tiangan = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];

        //地支
        var dizhi = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];

        //五行
        var wuxing = ["木", "火", "土", "金", "水"];

        var sixtyJiaZi = [
            "甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉",
            "甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未",
            "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳",
            "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅", "癸卯",
            "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑",
            "甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥"
        ];


        //五虎遁
        var wuhudun = {
            "甲": ["丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥", "丙子", "丁丑"],
            "己": ["丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥", "丙子", "丁丑"],

            "乙": ["戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑"],
            "庚": ["戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑"],

            "丙": ["庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑"],
            "辛": ["庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑"],

            "丁": ["壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑"],
            "壬": ["壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑"],

            "戊": ["甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥", "甲子", "乙丑"],
            "癸": ["甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥", "甲子", "乙丑"]
        };

        //60甲子纳音
        var jiazinayin = {
            "甲子": '海中金',
            "乙丑": "海中金",
            "丙寅": "炉中火",
            "丁卯": "炉中火",
            "戊辰": "大林木",
            "己巳": "大林木",
            "庚午": "路旁土",
            "辛未": "路旁土",
            "壬申": "剑锋金",
            "癸酉": "剑锋金",
            "甲戌": "山头火",
            "乙亥": "山头火",
            "丙子": "涧下水",
            "丁丑": "涧下水",
            "戊寅": "城头土",
            "己卯": "城头土",
            "庚辰": "白蜡金",
            "辛巳": "白蜡金",
            "壬午": "杨柳木",
            "癸未": "杨柳木",
            "甲申": "泉中水",
            "乙酉": "泉中水",
            "丙戌": "屋上土",
            "丁亥": "屋上土",
            "戊子": "霹雳火",
            "己丑": "霹雳火",
            "庚寅": "松柏木",
            "辛卯": "松柏木",
            "壬辰": "长流水",
            "癸巳": "长流水",
            "甲午": "沙中金",
            "乙未": "沙中金",
            "丙申": "山下火",
            "丁酉": "山下火",
            "戊戌": "平地木",
            "己亥": "平地木",
            "庚子": "壁上土",
            "辛丑": "壁上土",
            "壬寅": "金箔金",
            "癸卯": "金箔金",
            "甲辰": "复灯火",
            "乙巳": "复灯火",
            "丙午": "天河水",
            "丁未": "天河水",
            "戊申": "大驿土",
            "己酉": "大驿土",
            "庚戌": "钗钏金",
            "辛亥": "钗钏金",
            "壬子": "桑拓木",
            "癸丑": "桑拓木",
            "甲寅": "大溪水",
            "乙卯": "大溪水",
            "丙辰": "沙中土",
            "丁巳": "沙中土",
            "戊午": "天上火",
            "己未": "天上火",
            "庚申": "石榴木",
            "辛酉": "石榴木",
            "壬戌": "大海水",
            "癸亥": "大海水"
        };

        //六甲旬
        var liujiaxun = {
            "甲子": '甲子',
            "乙丑": "甲子",
            "丙寅": "甲子",
            "丁卯": "甲子",
            "戊辰": "甲子",
            "己巳": "甲子",
            "庚午": "甲子",
            "辛未": "甲子",
            "壬申": "甲子",
            "癸酉": "甲子",

            "甲戌": "甲戌",
            "乙亥": "甲戌",
            "丙子": "甲戌",
            "丁丑": "甲戌",
            "戊寅": "甲戌",
            "己卯": "甲戌",
            "庚辰": "甲戌",
            "辛巳": "甲戌",
            "壬午": "甲戌",
            "癸未": "甲戌",

            "甲申": "甲申",
            "乙酉": "甲申",
            "丙戌": "甲申",
            "丁亥": "甲申",
            "戊子": "甲申",
            "己丑": "甲申",
            "庚寅": "甲申",
            "辛卯": "甲申",
            "壬辰": "甲申",
            "癸巳": "甲申",

            "甲午": "甲午",
            "乙未": "甲午",
            "丙申": "甲午",
            "丁酉": "甲午",
            "戊戌": "甲午",
            "己亥": "甲午",
            "庚子": "甲午",
            "辛丑": "甲午",
            "壬寅": "甲午",
            "癸卯": "甲午",

            "甲辰": "甲辰",
            "乙巳": "甲辰",
            "丙午": "甲辰",
            "丁未": "甲辰",
            "戊申": "甲辰",
            "己酉": "甲辰",
            "庚戌": "甲辰",
            "辛亥": "甲辰",
            "壬子": "甲辰",
            "癸丑": "甲辰",

            "甲寅": "甲寅",
            "乙卯": "甲寅",
            "丙辰": "甲寅",
            "丁巳": "甲寅",
            "戊午": "甲寅",
            "己未": "甲寅",
            "庚申": "甲寅",
            "辛酉": "甲寅",
            "壬戌": "甲寅",
            "癸亥": "甲寅"
        };


        function getnayin(jiazi) {
            return jiazinayin[jiazi];
        }

        function getnayinwuxing(jiazi) {
            return jiazinayin[jiazi][2];
        }



        //天干五行
        var ganwuxing = {
            "甲": "木",
            "乙": "木",
            "丙": "火",
            "丁": "火",
            "戊": "土",
            "己": "土",
            "庚": "金",
            "辛": "金",
            "壬": "水",
            "癸": "水"
        };

        function getganwuxing(gan) {

            return ganwuxing[gan];

        }

        //天干禄地支
        var ganlu = {
            "甲": "寅",
            "乙": "卯",
            "丙": "巳",
            "丁": "午",
            "戊": "巳",
            "己": "午",
            "庚": "申",
            "辛": "酉",
            "壬": "亥",
            "癸": "子"
        };

        function getlu(gan) {
            return ganlu[gan];
        }

        var zhilu = {
            "寅": "甲",
            "卯": "乙",
            "巳": "丙戊",
            "午": "丁己",
            "申": "庚",
            "酉": "辛",
            "亥": "壬",
            "子": "癸"
        };

        function getzhilu(zhi) {
            return zhilu[zhi];
        }



        // 丧门 命前两位为丧门
        var sangmen = {
            "子": "寅",
            "丑": "卯",
            "寅": "辰",
            "卯": "巳",
            "辰": "午",
            "巳": "未",
            "午": "申",
            "未": "酉",
            "申": "戌",
            "酉": "亥",
            "戌": "子",
            "亥": "丑"
        };
        //吊客 命后两位为吊客
        var diaoke = {
            "子": "戌",
            "丑": "亥",
            "寅": "子",
            "卯": "丑",
            "辰": "寅",
            "巳": "卯",
            "午": "辰",
            "未": "巳",
            "申": "午",
            "酉": "未",
            "戌": "申",
            "亥": "酉",
        };


        var gou = {
            "子": "卯",
            "丑": "辰",
            "寅": "巳",
            "卯": "午",
            "辰": "未",
            "巳": "申",
            "午": "酉",
            "未": "戌",
            "申": "亥",
            "酉": "子",
            "戌": "丑",
            "亥": "寅"
        };
        //吊客 命后3位为吊客
        var jiao = {
            "子": "亥",
            "丑": "子",
            "寅": "丑",
            "卯": "寅",
            "辰": "卯",
            "巳": "辰",
            "午": "巳",
            "未": "午",
            "申": "未",
            "酉": "申",
            "戌": "酉",
            "亥": "戌",
        };



        //天乙贵人
        var tianyi = {
            "甲": "丑未",
            "戊": "丑未",
            "庚": "丑未",
            "乙": "子申",
            "己": "子申",
            "丙": "亥酉",
            "丁": "亥酉",
            "壬": "巳卯",
            "癸": "巳卯",
            "辛": "午寅"
        };

        function gettianyi(gan) {
            return tianyi[gan];
        }

        var zhitianyi = {
            "丑": "甲戊庚",
            "未": "甲戊庚",

            "子": "乙己",
            "申": "乙己",

            "亥": "丙丁",
            "酉": "丙丁",

            "巳": "壬癸",
            "卯": "壬癸",
            "午": "辛",
            "寅": "辛"
        };

        function getzhitianyi(zhi) {
            return zhitianyi[zhi];
        }

        //六仪,子加寅顺数至生月

        var liuyi = {
            "寅": "子",
            "卯": "丑",
            "辰": "寅",
            "巳": "卯",
            "午": "辰",
            "未": "巳",
            "申": "午",
            "酉": "未",
            "戌": "申",
            "亥": "酉",
            "子": "戌",
            "丑": "亥"
        };

        //旬六仪
        var xunliuyi = {
            "甲子": "戊",
            "甲戌": "己",
            "甲申": "庚",
            "甲午": "辛",
            "甲辰": "壬",
            "甲寅": "癸"
        };

        //空亡 六甲 四大 地支缺天干禄
        var xunkong = {
            "甲子": "六甲-戌亥,四大-水",
            "甲戌": "六甲-申酉,落空亡-庚辛",
            "甲申": "六甲-午未,四大-金，落空亡-丙丁",
            "甲午": "六甲-辰巳,四大-水",
            "甲辰": "六甲-寅卯,四大,落空亡-甲乙",
            "甲寅": "六甲-子丑,四大-金，落空亡-壬癸"
        };



        function getXunKongWang(jiazi){
            return xunkong[liujiaxun[jiazi]];
        }

        //进交退伏
        var jinjiaotuifu = {
            "甲子":"进","己卯":"进","甲午":"进","己酉":"进",
            "丙子":"交","辛卯":"交","丙午":"交","辛酉":"交",
            "丁丑":"退","壬辰":"退","丁未":"退","壬戌":"退",
            "戊寅":"伏","癸巳":"伏","戊申":"伏","癸亥":"伏"}

        vm.importantInfo["进交退伏"]={
            "进":"甲子,己卯,甲午,己酉"
            ,"交":"丙子,辛卯,丙午,辛酉"
            ,"退":"丁丑,壬辰,丁未,壬戌"
            ,"伏":"戊寅,癸巳,戊申,癸亥"
        };

        //截路空亡
        var jielukongwang = {
            "甲":"申酉",
            "乙":"午未",
            "丙":"辰巳",
            "丁":"寅卯",
            "戊":"子丑戌亥",
            "己":"申酉",
            "庚":"午未",
            "辛":"辰巳",
            "壬":"寅卯",
            "癸":"子丑戌亥",
        };
        vm.importantInfo["截路空亡"]=jielukongwang;

        var jieluzhu = ["甲申","己酉","乙未","庚午","丙辰","辛巳","丁卯","壬寅","戊子","戊戌","癸丑","癸亥"]
        vm.importantInfo["截路空亡柱"]=jieluzhu;

        //食神
        var shishen = {
            "甲": "丙",
            "乙": "丁",
            "丙": "戊",
            "丁": "己",
            "戊": "庚",
            "己": "辛",
            "庚": "壬",
            "辛": "癸",
            "壬": "甲",
            "癸": "乙"
        };

        //正财
        var zhengcai = {
            "甲": "己",
            "乙": "戊",
            "丙": "辛",
            "丁": "庚",
            "戊": "癸",
            "己": "壬",
            "庚": "乙",
            "辛": "甲",
            "壬": "丁",
            "癸": "丙"
        };

        //正财
        var piancai = {
            "甲": "戊",
            "乙": "己",
            "丙": "庚",
            "丁": "辛",
            "戊": "壬",
            "己": "癸",
            "庚": "甲",
            "辛": "乙",
            "壬": "丙",
            "癸": "丁"
        };

        //正官
        var zhengguan = {
            "甲": "辛",
            "乙": "庚",
            "丙": "癸",
            "丁": "壬",
            "戊": "乙",
            "己": "甲",
            "庚": "丁",
            "辛": "丙",
            "壬": "己",
            "癸": "戊"
        };

        //正官禄，五虎遁官禄位
        var zhengguanlu = {
            "甲": ["癸酉"],
            "己": ["丙寅"],
            "乙": ["甲申"],
            "庚": ["壬午"],
            "丙": [ "庚子"],
            "辛": [ "癸巳"],
            "丁": [ "辛亥"],
            "壬": [ "丙午"],
            "戊": [ "乙卯"],
            "癸": ["丁巳"]

        }


        //驿马
        var yima = {
            "申": "寅",
            "子": "寅",
            "辰": "寅",

            "亥": "巳",
            "卯": "巳",
            "未": "巳",

            "寅": "申",
            "午": "申",
            "戌": "申",

            "巳": "亥",
            "酉": "亥",
            "丑": "亥"
        };

        function getma(zhi) {
            return yima[zhi];
        }


        //劫杀-五行绝地
        var jiesha = {
            "申": "巳",
            "子": "巳",
            "辰": "巳",

            "亥": "申",
            "卯": "申",
            "未": "申",

            "寅": "亥",
            "午": "亥",
            "戌": "亥",

            "巳": "寅",
            "酉": "寅",
            "丑": "寅"
        };


        //六害["子未","丑午","寅巳","卯辰","申亥","酉戌"]
        var liuhai = {
            "子": "未",
            "未": "子",
            "午": "丑",
            "丑": "午",

            "寅": "巳",
            "巳": "寅",
            "申": "亥",
            "亥": "申",

            "卯": "辰",
            "辰": "卯",
            "酉": "戌",
            "戌": "酉",
        };
        //亡神-五行禄地
        var wangshen = {
            "申": "亥",
            "子": "亥",
            "辰": "亥",

            "亥": "寅",
            "卯": "寅",
            "未": "寅",

            "寅": "巳",
            "午": "巳",
            "戌": "巳",

            "巳": "申",
            "酉": "申",
            "丑": "申"
        };

        //【纳音五行正印】
        var wuxingzhengyin = {
            "金": "乙丑",
            "木": "癸未",
            "水": "壬辰",
            "火": "甲戌",
            "土": "丙辰"
        };

        //华盖印
        var huagaiyin = {
            "巳": "乙丑",
            "酉": "乙丑",
            "丑": "乙丑",

            "亥": "癸未",
            "卯": "癸未",
            "未": "癸未",


            "申": "壬辰",
            "子": "壬辰",
            "辰": "壬辰",

            "寅": "甲戌",
            "午": "甲戌",
            "戌": "甲戌"

        };

        //夹贵印
        var jiaguiyin = {

            "壬": "丙辰，壬辰",
            "癸": "丙辰，壬辰",
            "戊": "丙辰，壬辰",
            "己": "丙辰，壬辰",

            "丙": "甲戌",
            "丁": "甲戌"

        };

        function getwuxingzhengyin(wuxing) {
            return wuxingzhengyin[wuxing];
        }

        var infoChangShengJue = ["长生", "沐浴", "冠带", "临官", "帝旺", "衰", "病", "死", "墓", "绝", "胎", "养"]
        var nayinchangshengjue = {
            "金": {
                "巳": "长生",
                "午": "沐浴",
                "未": "冠带",
                "申": "临官",
                "酉": "帝旺",
                "戌": "衰",
                "亥": "病",
                "子": "死",
                "丑": "墓",
                "寅": "绝",
                "卯": "胎",
                "辰": "养"
            },
            "木": {
                "亥": "长生",
                "子": "沐浴",
                "丑": "冠带",
                "寅": "临官",
                "卯": "帝旺",
                "辰": "衰",
                "巳": "病",
                "午": "死",
                "未": "墓",
                "申": "绝",
                "酉": "胎",
                "戌": "养"
            },
            "水": {
                "申": "长生",
                "酉": "沐浴",
                "戌": "冠带",
                "亥": "临官",
                "子": "帝旺",
                "丑": "衰",
                "寅": "病",
                "卯": "死",
                "辰": "墓",
                "巳": "绝",
                "午": "胎",
                "未": "养"
            },
            "火": {
                "寅": "长生",
                "卯": "沐浴",
                "辰": "冠带",
                "巳": "临官",
                "午": "帝旺",
                "未": "衰",
                "申": "病",
                "酉": "死",
                "戌": "墓",
                "亥": "绝",
                "子": "胎",
                "丑": "养"
            },
            "土": {
                "申": "长生",
                "酉": "沐浴",
                "戌": "冠带",
                "亥": "临官",
                "子": "帝旺",
                "丑": "衰",
                "寅": "病",
                "卯": "死",
                "辰": "墓",
                "巳": "绝",
                "午": "胎",
                "未": "养"
            }
        };

        function getnayinchangshengjue(wuxing) {
            return nayinchangshengjue[wuxing];

        }

        var wuxingchangshengjue = {
            "金": {
                "巳": "长生",
                "午": "沐浴",
                "未": "冠带",
                "申": "临官",
                "酉": "帝旺",
                "戌": "衰",
                "亥": "病",
                "子": "死",
                "丑": "墓",
                "寅": "绝",
                "卯": "胎",
                "辰": "养"
            },
            "木": {
                "亥": "长生",
                "子": "沐浴",
                "丑": "冠带",
                "寅": "临官",
                "卯": "帝旺",
                "辰": "衰",
                "巳": "病",
                "午": "死",
                "未": "墓",
                "申": "绝",
                "酉": "胎",
                "戌": "养"
            },
            "水": {
                "申": "长生",
                "酉": "沐浴",
                "戌": "冠带",
                "亥": "临官",
                "子": "帝旺",
                "丑": "衰",
                "寅": "病",
                "卯": "死",
                "辰": "墓",
                "巳": "绝",
                "午": "胎",
                "未": "养"
            },
            "火": {
                "寅": "长生",
                "卯": "沐浴",
                "辰": "冠带",
                "巳": "临官",
                "午": "帝旺",
                "未": "衰",
                "申": "病",
                "酉": "死",
                "戌": "墓",
                "亥": "绝",
                "子": "胎",
                "丑": "养"
            },
            "土": {
                "寅": "长生",
                "卯": "沐浴",
                "辰": "冠带",
                "巳": "临官",
                "午": "帝旺",
                "未": "衰",
                "申": "病",
                "酉": "死",
                "戌": "墓",
                "亥": "绝",
                "子": "胎",
                "丑": "养"
            }
        };

        function getwuxingchangshengje(wuxing) {
            return wuxingchangshengjue[wuxing];
        }

        //选择后
        vm.genderSelected = vm.genderList[0];

        function getSelectedGender(value) {
            for (var i = 0; i < vm.genderList.length; i++) {

                if (vm.genderList[i].value === value) {
                    return vm.genderList[i];
                }
            }

        }


        vm.bazi = {
            birth: 1984,
            "gender": "男",
            "niangan": "丙",
            "nianzhi": "子",
            niannayin: "",
            nianzhu: "丙子",

            "yuegan": "丙",
            "yuezhi": "寅",
            yuenayin: "",

            "rigan": "甲",
            "rizhi": "寅",
            rinayin: "",

            "shigan": "乙",
            "shizhi": "卯",
            shinayin: "",

            "taigan": "",
            "taizhi": "",
            tainayin: "",

            "minggan": "甲",
            "mingzhi": "子",
            "shengan": "甲",
            "shenzhi": "子",

            "yungan": "乙",
            "yunzhi": "丑",

            "liuniangan": "丙",
            "liunianzhi": "寅",
            "xingniangan": "丁",
            "xingnianzhi": "亥",

            dayun: "乙丑",
            dayunnayin: "",
            liunian: "乙丑",
            xingnian: "乙丑"

        };
        vm.year = 1984;

        vm.xingnian = [
            [],
            [],
            [],
            [],
            [],
            [],
            [],
            [],
            [],
            []
        ];
        vm.xingnianShiZhu = [
            [],
            [],
            [],
            [],
            [],
            [],
            [],
            [],
            [],
            []
        ];

        //四柱分析结果
        vm.sizhuAnalyze = {};
        //岁运
        vm.suiyunAnalyze = {};

        var yangGan = ["甲", "丙", "戊", "庚", "壬"];

        function isYangGan(gan) {
            var index = yangGan.indexOf(gan);
            return index >=0;
        }

        vm.calculateXingNian = calculateXingNian;
        vm.calculateXingNianShiZhu = calculateXingNianShiZhu;



        //天干
        var tiangan = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];

        //地支
        var dizhi = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];




        //60甲子属性
        //http://blog.sina.com.cn/s/blog_614375770102wn3s.html
        var jiazishuxinglist = {
            "甲子": ['海中金', '从革之金，其气散，得【戊申土】，【癸巳水】相之，则吉。戊申乃金临官之地，土者更旺于子，必能生成，癸巳系金，生于巳，水旺于子，纳音各有所归，又为朝元禄，忌丁卯丁酉戊午之火', '进神', "阎东叟云：甲子金为进神，禀沉潜灵中之德，四时皆吉，入贵格，承旺气，则术业精微，主魁夺之荣。", "玉霄宝鉴云：甲子乙丑未成器金，见火则成，多见则吉。", "为宝物,喜金木旺地"],
            "乙丑": ["海中金", "自库之金，火不能克，盖退藏之金，苟无刑害冲破，未有不显荣者，独忌【己丑】【戊午】【己未】之火。", "正印", "阎东叟云：具大福德，秋冬富贵寿考，春夏吉中有凶，入格则建功享福，带煞类为凶会，", "玉霄宝鉴云：甲子乙丑未成器金，见火则成，多见则吉。", "为顽矿,喜火及南方月时"],
            "丙寅": ["炉中火", "丙寅赫牺之火，无水制之，则为燔灼炎烈之患，水不可遇，独爱甲寅之水，就位济之，又名朝元禄。", "五行要论云：丙寅火食灵明冲粹之气，四时生生之德，入贵格，则文彩发应，主科甲之贵。", "珞琭子云：丙寅丁卯秋天宜以保持。莹和尚注云：丙寅丁卯举火之类，秋天保持者，言水生于秋也。鬼谷遗文云：丙寅丁卯秋冬宜以保持。注云：木不南奔火无西旺，火至秋冬，势恐不久。", "", ""],
            "丁卯": ["炉中火", "丁卯伏明之火，气弱宜木生之，遇水则凶，乙卯乙酉水最毒。", "五行要论云：丁卯沐浴之火，含雷动风作之气，水济之则达，土载之则基厚，以木资之为文彩，以金橐之，更逢夏令则凶暴。", "珞琭子云：丙寅丁卯秋天宜以保持。莹和尚注云：丙寅丁卯举火之类，秋天保持者，言水生于秋也。鬼谷遗文云：丙寅丁卯秋冬宜以保持。注云：木不南奔火无西旺，火至秋冬，势恐不久。", ""],
            "戊辰": ["大林木", "戊辰两土下木，众金不能克，盖生金，有母子之道，得土生之为佳。", "五行要论云：戊辰庚寅癸丑三辰，挺木德清健之数，生于春夏，能转立独奋，随变成功，更成旺气，则有凌霄耸壑之志，惟忌秋生，虽怀志节，屈而不伸。", "珞琭子云：己巳戊辰度乾宫而脱厄。莹和尚注云：己巳戊辰举木之数，西方金鬼旺乡，纳音之木，至此绝矣，斯谓厄会。若度乾亥之宫，木得水以生长，故脱厄。", ""],
            "己巳": ["大林木", "己巳为近火之木，金自此生，于我无伤，忌见生旺之火。", "阎东叟云：己巳在巽为风动之木，根危易拔，和之以金土，运归东南方成材用虽外阳内阴，别无辅助，则其气灵散，更为生鬼所克，乃不材之本也。", "珞琭子云：己巳戊辰度乾宫而脱厄。莹和尚注云：己巳戊辰举木之数，西方金鬼旺乡，纳音之木，至此绝矣，斯谓厄会。若度乾亥之宫，木得水以生长，故脱厄。"],
            "庚午": ["路旁土", "始生之土，木不能克，惟忌水多，反伤其气，木多却有归，盖归未也。", "阎东叟云：庚午辛未戊申丁巳，皆厚德之土，含容镇静，和气融怡，福禄优裕。入格则多历方岳之任，有普惠博爱之功。", "", ""],
            "辛未": ["路旁土", "始生之土，木不能克，惟忌水多，反伤其气，木多却有归，盖归未也。", "阎东叟云：庚午辛未戊申丁巳，皆厚德之土，含容镇静，和气融怡，福禄优裕。入格则多历方岳之任，有普惠博爱之功。"],
            "壬申": ["剑锋金", "临官之金，利见水土，若丙申丙寅戊午之火，则为灾害。 ", "阎东叟云：壬申金，持天将之威，资临官之气，秋冬掌生杀之权，春夏吉少凶多，入格以功名自奋，带杀之刻剥为能。", "玉霄宝鉴云：壬申癸酉，金旺之位，不可复旺，旺则伤物；不可见火，见火则自伤。", "", ""],
            "癸酉": ["剑锋金", "坚成之金，火死于酉，见火何伤，惟忌丁酉火，【就位克之】。 ", "阎东叟云：癸酉自旺之金，禀纯粹之气，春夏为性英明，秋冬尤贵。入格则功业节概，挺转出伦；带杀则少年刚劲，四十之后，渐成纯德。", "玉霄宝鉴云：壬申癸酉，金旺之位，不可复旺，旺则伤物；不可见火，见火则自伤。", "", ""],


            "甲戌": ["山头火", "自库之火，不嫌众水，惟忌壬戌，所谓墓中受克，其患难逃。", "", "", ""],
            "乙亥": ["山头火", "", "", ""],
            "丙子": ["涧下水", "", "", ""],
            "丁丑": ["涧下水", "", "", ""],
            "戊寅": ["城头土", "", "", ""],
            "己卯": ["城头土", "", "", ""],
            "庚辰": ["白蜡金", "", "", ""],
            "辛巳": ["白蜡金", "", "", ""],
            "壬午": ["杨柳木", "", "", ""],
            "癸未": ["杨柳木", "", "", ""],
            "甲申": ["泉中水"],
            "乙酉": ["泉中水"],
            "丙戌": ["屋上土"],
            "丁亥": ["屋上土"],
            "戊子": ["霹雳火"],
            "己丑": ["霹雳火"],
            "庚寅": ["松柏木"],
            "辛卯": ["松柏木"],
            "壬辰": ["长流水"],
            "癸巳": ["长流水"],
            "甲午": ["沙中金"],
            "乙未": ["沙中金"],
            "丙申": ["山下火"],
            "丁酉": ["山下火"],
            "戊戌": ["平地木"],
            "己亥": ["平地木"],
            "庚子": ["壁上土"],
            "辛丑": ["壁上土"],
            "壬寅": ["金箔金"],
            "癸卯": ["金箔金"],
            "甲辰": ["复灯火"],
            "乙巳": ["复灯火"],
            "丙午": ["天河水"],
            "丁未": ["天河水"],
            "戊申": ["大驿土"],
            "己酉": ["大驿土"],
            "庚戌": ["钗钏金"],
            "辛亥": ["钗钏金"],
            "壬子": ["桑拓木"],
            "癸丑": ["桑拓木"],
            "甲寅": ["大溪水"],
            "乙卯": ["大溪水"],
            "丙辰": ["沙中土"],
            "丁巳": ["沙中土"],
            "戊午": ["天上火"],
            "己未": ["天上火"],
            "庚申": ["石榴木"],
            "辛酉": ["石榴木"],
            "壬戌": ["大海水"],
            "癸亥": ["大海水"]
        };

        //调侯用神大运表
        var tiaohoudayun = {

            "甲寅": ["【丙癸】调侯入【辛】运。在事业方面，在成就之中而有阻碍。在家庭方面，为【眷属】人口之口舌不吉"
                ,"【庚丁】调候入【癸】运。主体弱身体有疾病。天干无【戊】出干，此运某事难成"],
            "甲卯": ["入【癸】运。因财务之事不顺，因而牵连影响家庭和谐。未婚者因财务牵连男女感情分裂。【女命】，则以【体弱，生病】为主要征兆"],
            "甲辰": ["入【丁】运。四柱若有【甲。乙】则作为【事业】上失意"],
            "甲巳": ["入【戊】运。诸事徒劳、迟滞，但不作大凶之论。","入【丙】运。因过度保守，而坐失良机，不作大凶"],
            "甲午": ["入【戊】运。此运一事无成，徒然辛劳，不作凶论"],
            "甲未": ["入【癸】运。适合守成","入【己】运。财【争合】日主，男女主有感情上困扰"],
            "甲申": ["入【酉、亥】运。在事业方面有渐渐退守现象","入【丙】运。白忙一场"],
            "甲酉": ["入【癸】运。即使四柱【有丙丁】，也难有成就。无丙丁有【官非】"],
            "甲戌": ["入【甲、乙】运。皆是为亲友人情破财，不论任何格局，都是无谓散财"],
            "甲亥": ["入【甲】运。主家庭、夫妻、男女等【感情不和】","入【壬】运。四柱如果没有【庚】十年衰退"],
            "甲子": ["入【壬】运。合去丁则为【大意失荆州】","入【癸】运。败于【操之过急】"],
            "甲丑": ["入【壬】运。财势【一落千丈】守成也需5年","入【癸】运。非独【财势失地】且主【体弱多病】以及【官非灾害】"],
            "乙寅": ["入【癸】运。四柱无【丙】非但不能帮身，反而失败","入【戊】运。主【身体有病】"],
            "乙卯": ["入【辛】运。虽非杀格，主守成岁月","入【戊】运。恐有【失职、误事】之灾"],
            "乙辰": ["入【己】运。即使八字没有【驿马】也主远方奔波劳碌","入【庚】运。四柱有【庚】者【大凶】无庚小退"],
            "乙巳": ["入【戊】运。身体有疾病"],
            "乙午": ["入【戊】运。身体有疾病"],
            "乙未": ["入【甲】运。四柱【无癸、丙】等同桃花"],
            "乙申": ["入【壬】运。因文字失策，引起官非灾害"],
            "乙酉": ["入【丁】运。主生病以及损失财务","入【辛】运。日主无根，有【大凶疾灾】"],
            "乙戌": ["入【丙】运。【辛】七杀格，一事无成之运","入【戊】运。守成则无灾难，妄动招引灾难"],
            "乙亥": ["入【壬】运。四处奔波没有成就。若四柱【戊】无根，则是贫困之运，虚有外表光华"],
            "乙子": ["入【癸】运。主多疑多虑，心神不宁。若四柱有【壬】出天干，有大疾病或意外之灾"],
            "乙丑": ["入【癸】运。主身体衰弱，经常有疾病。四柱若只有一个【丙】，乃是【大凶】运"],
            "丙寅": ["入【丁】运。大意自傲，举止失常，判断措施，大意失荆州。若地支有【寅、申】冲，【大凶】"],
            "丙卯": ["入【丁】运。【正财格】因酒色误事。【食神格】多病，难拖办事业"],
            "丙辰": ["入【戊】运。四柱【有甲】无大碍，守成。【无甲】文人，难论发越"],
            "丙巳": ["入【戊】运。人生消极，感情失意。有宗教修为倾向。主钱财失策","入【丁】运。只事宜守成，动则有悔"],
            "丙午": ["入【戊】运。主不利亲属人口","入【己】运。不利眷属，夫妻争吵","入【丁】运。事业不利，损耗财务。无事乱忙，神不守舍。有损及感情之事"],
            "丙未": ["入【癸】运。尤其地支是【金、水】运，主破财不顺","入【己】运。平常，无所烦神的清闲人士。修学【宗教、文学等】大吉"],
            "丙申": ["入【戊】运。亲属之间有纠纷","入【己】运。女命主家庭有风波"],
            "丙戌": ["入【戊】运。文人切忌【酸辣】心态若有嫉妒，恐引火上身","入【己】运。纸上谈兵，空有理论，无实际益处","入【丁】运。外表光华，内里空虚，朱门食客，闲人"],
            "丙亥": ["入【癸】运。享受型的【虚浮花钱】，最忌少年行此运，【败家子】"],
            "丙子": ["入【己】运。有成就基础上，逐步衰退，名利皆失，守成难","入【甲】运。守成尚可，进取反败"],
            "丙丑": ["入【己】运。无凶险之事，靠自己努力，无贵人帮助下，奠定基础","入【甲】运。有虚名，无实质利益","入【乙】运。外表尚可，浮财往来，略有声誉"],
            "丁寅": ["入【乙】运。主家务上的烦恼，协助亲友的负担","入【丁】运。无凶兆，男命是守成岁月，女命则忌，【婚姻感情有变化】"],
            "丁卯": ["入【乙】运。尤其以【乙酉、乙丑】金水地支运，财务有重大损耗","入【己】运。守成，无大灾难"],
            "丁辰": ["入【己】运。四柱【甲】偏印成格者，主大疾，无甲则无事","入【丁】运。钱财不顺，女命婚姻有碍"],
            "丁巳": ["入【癸】运。是非诉讼，或者身染疾病","入【丙】运。经济困难，调度失策"],
            "丁午": ["入【丙】运。收少出多，心情焦虑，财务紧迫","入【己】运。不能自己一人创业，权且依附贵人"],
            "丁未": ["入【己】运。【甲】正印格者，时长生病。【壬】正官格，有小人，官非之灾"],
            "丁申": ["入【丁】运。连续损财，为事业所困，进退不得，欲罢不能，身不由己。"],
            "丁酉": ["入【丁】运。失去主动形式，心神不宁，不知所为。","入【庚】运。业务驳杂，小人近身，忙中无头绪，左右皆为难，守成也难"],
            "丁戌": ["入【壬】运。事业将改组，自己退居清闲之职，商人将失去大客户。"],
            "丁亥": ["入【己】运。财务尚可，但引入是非之中","入【丙】运。因他人之事受牵连，【谨慎】合作事业"],
            "丁子": ["入【己】运。财务尚可，但引入是非之中","入【丙】运。因他人之事受牵连，【谨慎】合作事业"],
            "丁丑": ["入【己】运。财务尚可，但引入是非之中","入【丙】运。因他人之事受牵连，【谨慎】合作事业"],
            "戊寅": ["入【】运。"],
            "戊卯": ["入【】运。"],
            "戊辰": ["入【】运。"],
            "戊巳": ["入【】运。"],
            "戊午": ["入【】运。"],
            "戊未": ["入【】运。"],
            "戊申": ["入【】运。"],
            "戊酉": ["入【】运。"],
            "戊戌": ["入【】运。"],
            "戊亥": ["入【】运。"],
            "戊子": ["入【】运。"],
            "戊丑": ["入【】运。"],
            "己寅": ["入【】运。"],
            "己卯": ["入【】运。"],
            "己辰": ["入【】运。"],
            "己巳": ["入【】运。"],
            "己午": ["入【】运。"],
            "己未": ["入【】运。"],
            "己申": ["入【】运。"],
            "己酉": ["入【】运。"],
            "己戌": ["入【】运。"],
            "己亥": ["入【】运。"],
            "己子": ["入【】运。"],
            "己丑": ["入【】运。"],
            "庚寅": ["入【】运。"],
            "庚卯": ["入【】运。"],
            "庚辰": ["入【】运。"],
            "庚巳": ["入【】运。"],
            "庚午": ["入【】运。"],
            "庚未": ["入【】运。"],
            "庚申": ["入【】运。"],
            "庚酉": ["入【】运。"],
            "庚戌": ["入【】运。"],
            "庚亥": ["入【】运。"],
            "庚子": ["入【】运。"],
            "庚丑": ["入【】运。"],
            "辛寅": ["入【】运。"],
            "辛卯": ["入【】运。"],
            "辛辰": ["入【】运。"],
            "辛巳": ["入【】运。"],
            "辛午": ["入【】运。"],
            "辛未": ["入【】运。"],
            "辛申": ["入【】运。"],
            "辛酉": ["入【】运。"],
            "辛戌": ["入【】运。"],
            "辛亥": ["入【】运。"],
            "辛子": ["入【】运。"],
            "辛丑": ["入【】运。"],
            "壬寅": ["入【】运。"],
            "壬卯": ["入【】运。"],
            "壬辰": ["入【】运。"],
            "壬巳": ["入【】运。"],
            "壬午": ["入【】运。"],
            "壬未": ["入【】运。"],
            "壬申": ["入【】运。"],
            "壬酉": ["入【】运。"],
            "壬戌": ["入【】运。"],
            "壬亥": ["入【】运。"],
            "壬子": ["入【】运。"],
            "壬丑": ["入【】运。"],
            "癸寅": ["入【】运。"],
            "癸卯": ["入【】运。"],
            "癸辰": ["入【】运。"],
            "癸巳": ["入【】运。"],
            "癸午": ["入【】运。"],
            "癸未": ["入【】运。"],
            "癸申": ["入【】运。"],
            "癸酉": ["入【】运。"],
            "癸戌": ["入【】运。"],
            "癸亥": ["入【】运。"],
            "癸子": ["入【】运。"],
            "癸丑": ["入【】运。"]
        };

        //调侯用神表，忌神在余氏用神辞渊 139 大运在细批终身 429

        //调侯用神表
        var tiaohou={
            "甲寅":{"用神":"丙癸,庚丁","描述":"调和气候为要。丙火为主。癸水为佐助.雨水后庚为主"},
            "甲卯":{"用神":"庚，丙，丁，戊，己","描述":"羊刃架杀，专用庚金，以戊己为辅佐。无庚用丙丁泄秀，不取制杀。"},
            "甲辰":{"用神":"庚，丁，壬","描述":"用庚金必须丁火制之，伤官制杀。无庚用壬"},
            "甲巳":{"用神":"癸，庚，丁","描述":"调和气候癸水为主。原局气润，庚丁为用"},
            "甲午":{"用神":"癸，庚，丁","描述":"木性虚焦，癸水为主。无癸用丁，要行北运。木盛先庚，庚盛先丁"},
            "甲未":{"用神":"癸，庚，丁","描述":"上半月同午月用癸。下半月用庚丁。"},
            "甲申":{"用神":"庚，丁，壬","描述":"伤官制杀，无丁用壬"},
            "甲酉":{"用神":"庚，丁，丙","描述":"用丁制杀，用丙调侯。丁丙并用为辅佐"},
            "甲戌":{"用神":"庚，甲，丁，壬，癸","描述":"土旺者用甲木，木旺者用庚金，丁壬癸为辅佐"},
            "甲亥":{"用神":"庚，丁，丙，戊","描述":"用庚金必须丁火制之，用丙调侯。水旺用戊"},
            "甲子":{"用神":"丁，庚，丙","描述":"木性生寒，丁先庚后。用丙调侯。必须支见巳，寅，方为贵格"},
            "甲丑":{"用神":"丁，庚，丙","描述":"丁火必不可少.丙通根巳、寅。甲木为助。用庚劈甲引丁。"},
            "乙寅":{"用神":"丙，癸","描述":"取丙火解寒。略取癸水滋润。不宜困丙。火多用癸"},
            "乙卯":{"用神":"丙，癸","描述":"以癸滋木。以丙泄秀，不宜见金"},
            "乙辰":{"用神":"癸，丙，戊","描述":"若支成水局，取戊为佐"},
            "乙巳":{"用神":"癸","描述":"月令丙火得禄，专用癸水，调候为急。"},
            "乙午":{"用神":"癸，丙","描述":"上半月专用癸水，下半月丙癸并用"},
            "乙未":{"用神":"癸，丙","描述":"润土滋木，喜用癸水，柱多金水，先用丙火。夏月壬癸，切忌戊，己杂乱。 "},
            "乙申":{"用神":"丙，癸，己","描述":"月垣庚金司令，取丙火制之，或癸水化之。不论用丙用癸，皆己土为佐。 "},
            "乙酉":{"用神":"癸，丙，丁","描述":"上半月癸先丙后，下半月丙先癸后，无癸用壬。支成金局，又宜用丁。 "},
            "乙戌":{"用神":"癸，辛","描述":"以金发水之源。见甲，名藤萝系甲。"},
            "乙亥":{"用神":"丙，戊","描述":"乙木向阳，专取丙火。水多以戊佐"},
            "乙子":{"用神":"丙","描述":"寒木向阳，专取丙火，忌见癸水"},
            "乙丑":{"用神":"丙","描述":"寒谷回春，专用丙火"},
            "丙寅":{"用神":"壬，庚","描述":"壬水为用，庚金发水之源为佐"},
            "丙卯":{"用神":"壬，己","描述":"专用壬水，水多用戊制之，身弱用印化之"},
            "丙辰":{"用神":"壬，甲","描述":"专用壬水，土重以甲为佐"},
            "丙巳":{"用神":"壬，癸，庚","描述":"以庚为佐，忌戊制壬。无壬用癸"},
            "丙午":{"用神":"壬，庚","描述":"壬庚以通根申宫为妙。未月：壬，庚。以庚为佐"},
            "丙未":{"用神":"壬，庚","描述":"以庚为佐"},
            "丙申":{"用神":"壬，戊","描述":"壬水通根申宫，壬多必取戊制"},
            "丙酉":{"用神":"壬，癸","描述":"四柱多丙，一壬高透为奇。无壬用癸"},
            "丙戌":{"用神":"甲，壬","描述":"忌土晦光，先取甲疏土，次用壬水"},
            "丙亥":{"用神":"甲，戊，庚，壬","描述":"月垣壬水秉令，水旺用甲木化之，身煞两旺，用戊制之。火旺用壬，木旺宜庚。 "},
            "丙子":{"用神":"壬，戊，己","描述":"气进二阳，丙火弱中复强，用壬水，用戊制之。无戊用己"},
            "丙丑":{"用神":"壬，甲","描述":"喜壬为用，土多不可少甲"},
            "丁寅":{"用神":"甲，庚","描述":"用庚金劈甲引丁"},
            "丁卯":{"用神":"庚，甲","描述":"以庚去乙，以甲引丁"},
            "丁辰":{"用神":"甲，庚","描述":"用甲木引丁制土，次看庚金"},
            "丁巳":{"用神":"甲，庚","描述":"取甲引丁，甲多又取庚为先"},
            "丁午":{"用神":"壬，庚，癸","描述":"火多以庚壬两透为贵。无壬用癸，为独煞当权"},
            "丁未":{"用神":"甲，壬，庚","描述":"以甲木化壬引丁为用，用甲不能无庚，取庚为佐"},
            "丁申":{"用神":"甲，庚，丙，戊","描述":"取庚劈甲，无甲用乙。用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。水旺用戊"},
            "丁酉":{"用神":"甲，庚，丙，戊","描述":"取庚劈甲，无甲用乙。用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。水旺用戊"},
            "丁戌":{"用神":"甲，庚，戊","描述":"一派戊土无甲，为伤官伤尽"},
            "丁亥":{"用神":"甲，庚","描述":"庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用"},
            "丁子":{"用神":"甲，庚","描述":"庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用"},
            "丁丑":{"用神":"甲，庚","描述":"庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用"},
            "戊寅":{"用神":"丙，甲，癸。","描述":"无丙照暖，戊土不生，无甲疏劈，戊土不灵。无癸滋润，万物不长，先丙，次甲，次癸。 "},
            "戊卯":{"用神":"丙，甲，癸","描述":"无丙照暖，戊土不生，无甲疏劈，戊土不灵。无癸滋润，万物不长，先丙，次甲，次癸。"},
            "戊辰":{"用神":"甲，丙，癸","描述":"戊土司令，先用甲疏，次丙，次癸"},
            "戊巳":{"用神":"甲，丙，癸","描述":"戊土建禄，先用甲疏劈，次取丙癸"},
            "戊午":{"用神":"壬，甲，丙","描述":"调候为急，先用壬水，次取甲木，丙火配用"},
            "戊未":{"用神":"癸，丙，甲","描述":"调候为急，癸不可缺，丙火配用。土重不能无甲。"},
            "戊申":{"用神":"丙，癸，甲","描述":"寒气渐增，先用丙火。水多，用甲泄之"},
            "戊酉":{"用神":"丙，癸","描述":"赖丙照暖，喜水滋润"},
            "戊戌":{"用神":"甲，丙，癸","描述":"戊土当权，先用甲木，次取丙火。见金，先用癸水，后取丙火。 "},
            "戊亥":{"用神":"甲，丙","描述":"非甲不灵，非丙不暖"},
            "戊子":{"用神":"丙，甲","描述":"丙火为尚，甲木为佐"},
            "戊丑":{"用神":"丙，甲","描述":"丙火为尚，甲木为佐"},
            "己寅":{"用神":"丙，庚，甲","描述":"取丙解寒，忌见壬水，如水多，须以戊土为佐。土多用甲，甲多用庚。 "},
            "己卯":{"用神":"甲，癸，丙","描述":"用甲忌与己土合化，次用癸水润之"},
            "己辰":{"用神":"丙，癸，甲","描述":"先丙后癸，土暖而润，随用甲疏"},
            "己巳":{"用神":"癸，丙","描述":"调候不能无癸，土润不能无丙"},
            "己午":{"用神":"癸，丙","描述":"调候不能无癸，土润不能无丙"},
            "己未":{"用神":"癸，丙","描述":"调候不能无癸，土润不能无丙"},
            "己申":{"用神":"丙，癸","描述":"丙火温土，癸水润土，七月庚金司权，丙能制金，癸以泄金"},
            "己酉":{"用神":"丙，癸","描述":"取辛辅癸"},
            "己戌":{"用神":"甲，丙，癸","描述":"九月土盛，宜甲木疏之，次用丙癸"},
            "己亥":{"用神":"丙，甲，戊","描述":"三冬己土，非丙暖不生。初冬壬旺，取戊土制之，土多，取甲木疏之。"},
            "己子":{"用神":"丙，甲，戊","描述":"三冬己土非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。 "},
            "己丑":{"用神":"丙，甲，戊","描述":"三冬己土非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。  "},
            "庚寅":{"用神":"戊，甲，壬，丙，丁","描述":"用丙暖庚性，虑土厚埋金，须甲疏泄。火多用土，支成火局用壬。 "},
            "庚卯":{"用神":"丁，甲，庚，丙","描述":"庚金暗强，专用丁火，借甲引丁，用庚劈甲。无丁用丙"},
            "庚辰":{"用神":"甲，丁，壬，癸","描述":"顽金宜丁，旺土用甲，不用庚劈。：支火宜癸，干火宜壬。 "},
            "庚巳":{"用神":"壬，戊，丙，丁","描述":"丙不熔金，惟喜壬制，次取戊土，丙火为佐。支成金局，变弱为强，须用丁火 "},
            "庚午":{"用神":"壬，癸","描述":"专用壬水，癸次之，须支见庚辛为助。无壬，癸，用戊，己泄火之气。 "},
            "庚未":{"用神":"丁，甲","描述":"若支会土局，甲先丁后"},
            "庚申":{"用神":"丁，甲","描述":"专用丁火，甲木引丁"},
            "庚酉":{"用神":"丁，甲，丙","描述":"用丁甲　金，兼用丙火调候。"},
            "庚戌":{"用神":"甲，壬","描述":"土厚先用甲疏，次用壬洗"},
            "庚亥":{"用神":"丁，丙","描述":"水冷金寒爱丙丁，甲木辅丁"},
            "庚子":{"用神":"丁，甲，丙","描述":"仍取丁甲，次取丙火照暖，一派金水，不入和暖之乡，孤贫。丙丁须临寅巳午未戌支，方为有力"},
            "庚丑":{"用神":"丙，丁，甲","描述":"仍取丁甲，次取丙火照暖，一派金水，不入和暖之乡，孤贫。丙丁须临寅巳午未戌支，方为有力"},

            "辛寅":{"用神":"己，壬，庚","描述":"辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人庚为助"},
            "辛卯":{"用神":"壬，甲","描述":"辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人庚为助。"},
            "辛辰":{"用神":"壬，甲","描述":"若见丙火合辛，须有癸制丙，支见亥子申，为贵"},
            "辛巳":{"用神":"壬，甲，癸","描述":"壬水洗淘，兼有调候之用，更有甲木制戊，一清澈底"},
            "辛午":{"用神":"壬，己，癸","描述":"己无壬不湿，辛无巳不生，故壬，巳并用。无壬用癸。"},
            "辛未":{"用神":"壬，庚，甲","描述":"先用壬水，取庚为佐，忌戊出，得甲制之，方吉"},
            "辛申":{"用神":"壬，甲，戊","描述":"壬水为，甲戊酌用。不可用癸水"},
            "辛酉":{"用神":"壬，甲","描述":"壬水淘洗，如见戊己，须甲制土，支成金局无壬须用丁火"},
            "辛戌":{"用神":"壬，甲","描述":"月辛金，火土为病，水木为药"},
            "辛亥":{"用神":"壬","描述":"先壬后丙，名金白水清，馀皆酌用"},
            "辛子":{"用神":"丙，戊，壬，申","描述":"冬月辛金，不能缺丙火温暖，馀皆酌用。"},
            "辛丑":{"用神":"丙，壬，戊，己","描述":"冬月辛金，不能缺丙火温暖，馀皆酌用。壬先，戊己次之，总之，丙火不可少也"},

            "壬寅":{"用神":"庚，丙，戊","描述":"无比劫者，不必用戊，专用庚金，以丙为佐。如比劫多，又宜制之，一戊出，名一将当关，群邪自伏"},
            "壬卯":{"用神":"戊，辛，庚","描述":"三春壬水绝地，取庚，辛发水之源。水多用戊"},
            "壬辰":{"用神":"甲，庚","描述":"甲疏季上，次取庚金发水源，金多预丙制之为妙。"},
            "壬巳":{"用神":"壬，辛，庚，癸","描述":"壬水弱极，取庚，辛为源，壬癸比劫"},
            "壬午":{"用神":"癸，庚，辛","描述":"取庚为源，取癸为佐。无庚用辛"},
            "壬未":{"用神":"辛，甲","描述":"以辛金发水源，甲木疏土"},
            "壬申":{"用神":"戊，丁","描述":"取丁火佐戊制庚，戊土通根辰戌，丁火通根午戌，方可为用"},
            "壬酉":{"用神":"甲，庚","描述":"无甲，用金发水之源，名独水犯庚辛，体全之义"},
            "壬戌":{"用神":"甲，丙","描述":"以甲制戌中戊土，丙火为佐"},
            "壬亥":{"用神":"戊，丙，庚","描述":"如甲出制戊，须以庚金为救。"},
            "壬子":{"用神":"戊，丙","描述":"水旺宜戊，调候宜丙，丙戊必须兼用"},
            "壬丑":{"用神":"丙，丁，甲","描述":"上半月专用丙火，下半月用丙，甲木为佐"},
            "癸寅":{"用神":"辛，丙","描述":"用辛生癸水为源，无辛用庚，丙不可少。 "},
            "癸卯":{"用神":"庚，辛","描述":"乙木司令，专用庚金，辛金次之"},
            "癸辰":{"用神":"丙，辛，甲","描述":"上半月专用丙火，下半月虽用丙火，辛甲为佐"},
            "癸巳":{"用神":"辛","描述":"无辛用庚"},
            "癸午":{"用神":"庚，辛，壬，癸","描述":"庚辛为生身之本，但丁火司权，金难敌火，宜兼用比劫，方得庚辛之用。"},
            "癸未":{"用神":"庚，辛，壬，癸","描述":"上半月金神衰弱，火气炎热，宜比劫帮身，同五月。下半月无比劫亦可。"},
            "癸申":{"用神":"丁","描述":"庚金得禄，必丁火制金为用，丁火以通根午戌未为妙"},
            "癸酉":{"用神":"辛，丙","描述":"辛金为用，丙火佐之，名水暖金温，须隔位同透为妙。"},
            "癸戌":{"用神":"辛","描述":"专用辛金，忌戊土，要比劫兹甲制戊方妙。"},
            "癸亥":{"用神":"庚，辛，戊，丁","描述":"亥中甲木长生，泄散元神，宜用庚辛。水多用戊，金多用丁。"},
            "癸子":{"用神":"丙，辛","描述":"丙火解冻，辛金滋扶"},
            "癸丑":{"用神":"丙，庚，辛","描述":"丙火解冻，通根寅巳午未戌方妙。支成金局，要丙透得地。支成火局，又宜用庚辛。"}


        };

        var tiaohou_bak = {
            "甲寅": {
                "用神": { "丙":"忌辛合","癸":"不忌制合","庚":"不忌","丁":"忌癸制"}
                ,"忌神运": {"辛":"合丙","癸":"制丁"}
                ,"描述": "调和气候为要。丙火为主。癸水为佐助.雨水后庚为主"
            },
            "甲卯": {
                "用神": { "庚":"不忌","戊":"忌缺戊","己":"","丁":"忌癸制","丙":""}
                ,"忌神运": {"癸":"制丁"},"描述": "羊刃架杀，专用庚金，以戊己为辅佐。无庚用丙丁泄秀，不取制杀。"
            },
            "甲辰": {
                "用神": { "庚":"忌丁克","丁":"","壬":"忌丁合"},"忌神运": {"丁":"合壬制庚"},"描述": "用庚金必须丁火制之，伤官制杀。无庚用壬"
            },
            "甲巳": {
                "用神": { "癸":"忌庚缺戊合","庚":"忌丙克","丁":"不忌"},"忌神运": {"戊":"合癸","丙":"制庚"},"描述": "调和气候癸水为主。原局气润，庚丁为用"
            },
            "甲午": {
                "用神": { "癸":"忌不透干","庚":"","丁":""},"忌神运": {"戊":""},"描述": "木性虚焦，癸水为主。无癸用丁，要行北运。木盛先庚，庚盛先丁"
            },
            "甲未": {
                "用神": { "癸":"有癸不忌","庚":"有癸不忌","丁":""},"忌神运": {"癸":"","己":""},"描述": "上半月同午月用癸。下半月用庚丁。"
            },
            "甲申": {
                "用神": { "庚":"","丁":"","壬":""},"忌神运": {"":""},"描述": "伤官制杀，无丁用壬"
            },
            "甲酉": {
                "用神": { "庚":"","丁":"忌癸制","丙":"忌癸制"},"忌神运": {"癸":"克丙丁"},"描述": "用丁制杀，用丙调侯。丁丙并用为辅佐"
            },
            "甲戌": {
                "用神": { "庚":"","甲":"","丁":"忌甲乙生扶","壬":"","癸":""}
                ,"忌神运": {"甲乙":"生扶丁"},"描述": "土旺者用甲木，木旺者用庚金，丁壬癸为辅佐"
            },
            "甲亥": {
                "用神": { "庚":"忌无丁制","丁":"忌壬癸制合","丙":"","戊":"忌制壬甲克"}
                ,"忌神运": {"":""},"描述": "用庚金必须丁火制之，用丙调侯。水旺用戊"
            },
            "甲子": {
                "用神": { "丁":"","庚":"忌无丁制","丙":"忌无戊泄"}
                ,"忌神运": {"":""}
                ,"描述": "木性生寒，丁先庚后。用丙调侯。必须支见巳，寅，方为贵格"
            },
            "甲丑": {
                "用神": { "丁":"忌壬癸制合","庚":"","丙":"忌壬癸制"}
                ,"忌神运": {"":""}
                ,"描述": "丁火必不可少.丙通根巳、寅。甲木为助。用庚劈甲引丁。"
            },

            "乙寅": {
                "用神": { "丙":"","癸":"忌戊合"}
                ,"忌神运": {"":""}
                ,"描述": "取丙火解寒。略取癸水滋润。不宜困丙。火多用癸"
            },
            "乙卯": {
                "用神": { "丙":"忌辛合","癸":"忌戊合丁耗"}
                ,"忌神运": {"":""}
                ,"描述": "以癸滋木。以丙泄秀，不宜见金"
            },
            "乙辰": {
                "用神": { "癸":"忌己克","丙":"忌克庚","戊":""},"忌神运": {"":""},"描述": "若支成水局，取戊为佐"
            },
            "乙巳": {
                "用神": { "癸":""},"忌神运": {"":""},"描述": "月令丙火得禄，专用癸水，调候为急。"
            },
            "乙午": {
                "用神": { "癸，丙":"","":""},"忌神运": {"":""},"描述": "上半月专用癸水，下半月丙癸并用"
            },
            "乙未": {
                "用神": { "癸，丙":"","":""},"忌神运": {"":""},"描述": "润土滋木，喜用癸水，柱多金水，先用丙火。夏月壬癸，切忌戊，己杂乱。 "
            },
            "乙申": {
                "用神": { "丙，癸，己":"","":"","":""},"忌神运": {"":""},"描述": "月垣庚金司令，取丙火制之，或癸水化之。不论用丙用癸，皆己土为佐。 "
            },
            "乙酉": {
                "用神": { "癸，丙，丁":"","":"","":""},"忌神运": {"":""},"描述": "上半月癸先丙后，下半月丙先癸后，无癸用壬。支成金局，又宜用丁。 "
            },
            "乙戌": {
                "用神": { "癸，辛":"","":"","":""},"忌神运": {"":""},"描述": "以金发水之源。见甲，名藤萝系甲。"
            },
            "乙亥": {
                "用神": { "丙，戊":"","":""},"忌神运": {"":""},"描述": "乙木向阳，专取丙火。水多以戊佐"
            },
            "乙子": {
                "用神": { "丙":"","":""},"忌神运": {"":""},"描述": "寒木向阳，专取丙火，忌见癸水"
            },
            "乙丑": {
                "用神": { "丙":""},"忌神运": {"":""},"描述": "寒谷回春，专用丙火"
            },


            "丙寅": {
                "用神": { "壬，庚":"","":""},"忌神运": {"":""},"描述": "壬水为用，庚金发水之源为佐"
            },
            "丙卯": {
                "用神": { "壬，己":"","":""},"忌神运": {"":""},"描述": "专用壬水，水多用戊制之，身弱用印化之"
            },
            "丙辰": {
                "用神": { "壬，甲":"","":""},"忌神运": {"":""},"描述": "专用壬水，土重以甲为佐"
            },
            "丙巳": {
                "用神": { "壬，癸，庚":"","":"","":""},"忌神运": {"":""},"描述": "以庚为佐，忌戊制壬。无壬用癸"
            },
            "丙午": {
                "用神": { "壬，庚":"","":"","":""},"忌神运": {"":""},"描述": "壬庚以通根申宫为妙。未月：壬，庚。以庚为佐"
            },
            "丙未": {
                "用神": { "壬，庚":"","":"","":""},"忌神运": {"":""},"描述": "以庚为佐"
            },
            "丙申": {
                "用神": { "壬，戊":""},"":"","忌神运": {"":""},"描述": "壬水通根申宫，壬多必取戊制"
            },
            "丙酉": {
                "用神": { "壬，癸":"","":""},"忌神运": {"":""},"描述": "四柱多丙，一壬高透为奇。无壬用癸"
            },
            "丙戌": {
                "用神": { "甲，壬":"","":""},"忌神运": {"":""},"描述": "忌土晦光，先取甲疏土，次用壬水"
            },
            "丙亥": {
                "用神": { "甲，戊，庚，壬":"","":"","":"","":""},"忌神运": {"":""},"描述": "月垣壬水秉令，水旺用甲木化之，身煞两旺，用戊制之。火旺用壬，木旺宜庚。 "
            },
            "丙子": {
                "用神": { "壬，戊，己":"","":"","":""},"忌神运": {"":""},"描述": "气进二阳，丙火弱中复强，用壬水，用戊制之。无戊用己"
            },
            "丙丑": {
                "用神": { "壬，甲":"","":""},"忌神运": {"":""},"描述": "喜壬为用，土多不可少甲"
            },


            "丁寅": {
                "用神": {"甲":"不忌","庚":"不忌"},"忌神运": {"":""},"描述": "用庚金劈甲引丁"
            },
            "丁卯": {
                "用神": { "庚，甲":"","":""},"忌神运": {"":""},"描述": "以庚去乙，以甲引丁"
            },
            "丁辰": {
                "用神": { "甲，庚":"","":""},"忌神运": {"":""},"描述": "用甲木引丁制土，次看庚金"
            },
            "丁巳": {
                "用神": { "甲，庚":"","":""},"忌神运": {"":""},"描述": "取甲引丁，甲多又取庚为先"
            },
            "丁午": {
                "用神": { "壬，庚，癸":"","":"","":""},"忌神运": {"":""},"描述": "火多以庚壬两透为贵。无壬用癸，为独煞当权"
            },
            "丁未": {
                "用神": { "甲，壬，庚":"","":"","":""},"忌神运": {"":""},"描述": "以甲木化壬引丁为用，用甲不能无庚，取庚为佐"
            },
            "丁申": {
                "用神": { "甲，庚，丙，戊":""},"忌神运": {"":""},"描述": "取庚劈甲，无甲用乙。用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。水旺用戊"
            },
            "丁酉": {
                "用神": { "甲，庚，丙，戊":""},"忌神运": {"":""},"描述": "取庚劈甲，无甲用乙。用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。水旺用戊"
            },
            "丁戌": {
                "用神": { "甲，庚，戊":""},"忌神运": {"":""},"描述": "一派戊土无甲，为伤官伤尽"
            },
            "丁亥": {
                "用神": { "甲，庚":""},"忌神运": {"":""},"描述": "庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用"
            },
            "丁子": {
                "用神": { "甲，庚":""},"忌神运": {"":""},"描述": "庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用"
            },
            "丁丑": {
                "用神": { "甲，庚":""},"忌神运": {"":""},"描述": "庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用"
            },

            "戊寅": {
                "用神": { "丙，甲，癸。":""},"忌神运": {"":""},"描述": "无丙照暖，戊土不生，无甲疏劈，戊土不灵。无癸滋润，万物不长，先丙，次甲，次癸。 "
            },
            "戊卯": {
                "用神": { "丙，甲，癸":""},"忌神运": {"":""},"描述": "无丙照暖，戊土不生，无甲疏劈，戊土不灵。无癸滋润，万物不长，先丙，次甲，次癸。"
            },
            "戊辰": {
                "用神": { "甲，丙，癸":""},"忌神运": {"":""},"描述": "戊土司令，先用甲疏，次丙，次癸"
            },
            "戊巳": {
                "用神": { "甲，丙，癸":""},"忌神运": {"":""},"描述": "戊土建禄，先用甲疏劈，次取丙癸"
            },
            "戊午": {
                "用神": { "壬，甲，丙":""},"忌神运": {"":""},"描述": "调候为急，先用壬水，次取甲木，丙火配用"
            },
            "戊未": {
                "用神": { "癸，丙，甲":""},"忌神运": {"":""},"描述": "调候为急，癸不可缺，丙火配用。土重不能无甲。"
            },
            "戊申": {
                "用神": { "丙，癸，甲":""},"忌神运": {"":""},"描述": "寒气渐增，先用丙火。水多，用甲泄之"
            },
            "戊酉": {
                "用神": { "丙，癸":""},"忌神运": {"":""},"描述": "赖丙照暖，喜水滋润"
            },
            "戊戌": {
                "用神": { "甲，丙，癸":""},"忌神运": {"":""},"描述": "戊土当权，先用甲木，次取丙火。见金，先用癸水，后取丙火。 "
            },
            "戊亥": {
                "用神": { "甲，丙":""},"忌神运": {"":""},"描述": "非甲不灵，非丙不暖"
            },
            "戊子": {
                "用神": { "丙，甲":""},"忌神运": {"":""},"描述": "丙火为尚，甲木为佐"
            },
            "戊丑": {
                "用神": { "丙，甲":""},"忌神运": {"":""},"描述": "丙火为尚，甲木为佐"
            },
            "己寅": {
                "用神": { "丙，庚，甲":""},"忌神运": {"":""},"描述": "取丙解寒，忌见壬水，如水多，须以戊土为佐。土多用甲，甲多用庚。 "
            },
            "己卯": {
                "用神": { "甲，癸，丙":""},"忌神运": {"":""},"描述": "用甲忌与己土合化，次用癸水润之"
            },
            "己辰": {
                "用神": { "丙，癸，甲":""},"忌神运": {"":""},"描述": "先丙后癸，土暖而润，随用甲疏"
            },
            "己巳": {
                "用神": { "癸，丙":""},"忌神运": {"":""},"描述": "调候不能无癸，土润不能无丙"
            },
            "己午": {
                "用神": { "癸，丙":""},"忌神运": {"":""},"描述": "调候不能无癸，土润不能无丙"
            },
            "己未": {
                "用神": { "癸，丙":""},"忌神运": {"":""},"描述": "调候不能无癸，土润不能无丙"
            },
            "己申": {
                "用神": { "丙，癸":""},"忌神运": {"":""},"描述": "丙火温土，癸水润土，七月庚金司权，丙能制金，癸以泄金"
            },
            "己酉": {
                "用神": { "丙，癸":""},"忌神运": {"":""},"描述": "取辛辅癸"
            },
            "己戌": {
                "用神": { "甲，丙，癸":""},"忌神运": {"":""},"描述": "九月土盛，宜甲木疏之，次用丙癸"
            },
            "己亥": {
                "用神": { "丙，甲，戊":""},"忌神运": {"":""},"描述": "三冬己土，非丙暖不生。初冬壬旺，取戊土制之，土多，取甲木疏之。"
            },
            "己子": {
                "用神": { "丙，甲，戊":""},"忌神运": {"":""},"描述": "三冬己土非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。 "
            },
            "己丑": {
                "用神": { "丙，甲，戊":""},"忌神运": {"":""},"描述": "三冬己土非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。  "
            },

            "庚寅": {
                "用神": { "戊，甲，壬，丙，丁":""},"忌神运": {"":""},"描述": "用丙暖庚性，虑土厚埋金，须甲疏泄。火多用土，支成火局用壬。 "
            },
            "庚卯": {
                "用神": { "丁，甲，庚，丙":""},"忌神运": {"":""},"描述": "庚金暗强，专用丁火，借甲引丁，用庚劈甲。无丁用丙"
            },
            "庚辰": {
                "用神": { "甲，丁，壬，癸":""},"忌神运": {"":""},"描述": "顽金宜丁，旺土用甲，不用庚劈。：支火宜癸，干火宜壬。 "
            },
            "庚巳": {
                "用神": { "壬，戊，丙，丁":""},"忌神运": {"":""},"描述": "丙不熔金，惟喜壬制，次取戊土，丙火为佐。支成金局，变弱为强，须用丁火 "
            },
            "庚午": {
                "用神": { "壬，癸":""},"忌神运": {"":""},"描述": "专用壬水，癸次之，须支见庚辛为助。无壬，癸，用戊，己泄火之气。 "
            },
            "庚未": {
                "用神": { "丁，甲":""},"忌神运": {"":""},"描述": "若支会土局，甲先丁后"
            },
            "庚申": {
                "用神": { "丁，甲":""},"忌神运": {"":""},"描述": "专用丁火，甲木引丁"
            },
            "庚酉": {
                "用神": { "丁，甲，丙":""},"忌神运": {"":""},"描述": "用丁甲　金，兼用丙火调候。"
            },
            "庚戌": {
                "用神": { "甲，壬":""},"忌神运": {"":""},"描述": "土厚先用甲疏，次用壬洗"
            },
            "庚亥": {
                "用神": { "丁，丙":""},"忌神运": {"":""},"描述": "水冷金寒爱丙丁，甲木辅丁"
            },
            "庚子": {
                "用神": { "丁，甲，丙":""},"忌神运": {"":""},"描述": "仍取丁甲，次取丙火照暖，一派金水，不入和暖之乡，孤贫。丙丁须临寅巳午未戌支，方为有力"
            },
            "庚丑": {
                "用神": { "丙，丁，甲":""},"忌神运": {"":""},"描述": "仍取丁甲，次取丙火照暖，一派金水，不入和暖之乡，孤贫。丙丁须临寅巳午未戌支，方为有力"
            },

            "辛寅": {
                "用神": { "己，壬，庚":""},"忌神运": {"":""},"描述": "辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人庚为助"
            },
            "辛卯": {
                "用神": { "壬，甲":""},"忌神运": {"":""},"描述": "辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人庚为助。"
            },
            "辛辰": {
                "用神": { "壬，甲":""},"忌神运": {"":""},"描述": "若见丙火合辛，须有癸制丙，支见亥子申，为贵"
            },
            "辛巳": {
                "用神": { "壬，甲，癸":""},"忌神运": {"":""},"描述": "壬水洗淘，兼有调候之用，更有甲木制戊，一清澈底"
            },
            "辛午": {
                "用神": { "壬，己，癸":""},"忌神运": {"":""},"描述": "己无壬不湿，辛无巳不生，故壬，巳并用。无壬用癸。"
            },
            "辛未": {
                "用神": { "壬，庚，甲":""},"忌神运": {"":""},"描述": "先用壬水，取庚为佐，忌戊出，得甲制之，方吉"
            },
            "辛申": {
                "用神": { "壬，甲，戊":""},"忌神运": {"":""},"描述": "壬水为，甲戊酌用。不可用癸水"
            },
            "辛酉": {
                "用神": { "壬，甲":""},"忌神运": {"":""},"描述": "壬水淘洗，如见戊己，须甲制土，支成金局无壬须用丁火"
            },
            "辛戌": {
                "用神": { "壬，甲":""},"忌神运": {"":""},"描述": "月辛金，火土为病，水木为药"
            },
            "辛亥": {
                "用神": { "壬":""},"忌神运": {"":""},"描述": "先壬后丙，名金白水清，馀皆酌用"
            },
            "辛子": {
                "用神": { "丙，戊，壬，申":""},"忌神运": {"":""},"描述": "冬月辛金，不能缺丙火温暖，馀皆酌用。"
            },
            "辛丑": {
                "用神": { "丙，壬，戊，己":""},"忌神运": {"":""},"描述": "冬月辛金，不能缺丙火温暖，馀皆酌用。壬先，戊己次之，总之，丙火不可少也"
            },

            "壬寅": {
                "用神": { "庚，丙，戊":""},"忌神运": {"":""},"描述": "无比劫者，不必用戊，专用庚金，以丙为佐。如比劫多，又宜制之，一戊出，名一将当关，群邪自伏"
            },
            "壬卯": {
                "用神": { "戊，辛，庚":""},"忌神运": {"":""},"描述": "三春壬水绝地，取庚，辛发水之源。水多用戊"
            },
            "壬辰": {
                "用神": { "甲，庚":""},"忌神运": {"":""},"描述": "甲疏季上，次取庚金发水源，金多预丙制之为妙。"
            },
            "壬巳": {
                "用神": { "壬，辛，庚，癸":""},"忌神运": {"":""},"描述": "壬水弱极，取庚，辛为源，壬癸比劫"
            },
            "壬午": {
                "用神": { "癸，庚，辛":""},"忌神运": {"":""},"描述": "取庚为源，取癸为佐。无庚用辛"
            },
            "壬未": {
                "用神": { "辛，甲":""},"忌神运": {"":""},"描述": "以辛金发水源，甲木疏土"
            },
            "壬申": {
                "用神": { "戊，丁":""},"忌神运": {"":""},"描述": "取丁火佐戊制庚，戊土通根辰戌，丁火通根午戌，方可为用"
            },
            "壬酉": {
                "用神": { "甲，庚":""},"忌神运": {"":""},"描述": "无甲，用金发水之源，名独水犯庚辛，体全之义"
            },
            "壬戌": {
                "用神": { "甲，丙":""},"忌神运": {"":""},"描述": "以甲制戌中戊土，丙火为佐"
            },
            "壬亥": {
                "用神": { "戊，丙，庚":""},"忌神运": {"":""},"描述": "如甲出制戊，须以庚金为救。"
            },
            "壬子": {
                "用神": { "戊，丙":""},"忌神运": {"":""},"描述": "水旺宜戊，调候宜丙，丙戊必须兼用"
            },
            "壬丑": {
                "用神": { "丙，丁，甲":""},"忌神运": {"":""},"描述": "上半月专用丙火，下半月用丙，甲木为佐"
            },

            "癸寅": {
                "用神": { "辛，丙":""},"忌神运": {"":""},"描述": "用辛生癸水为源，无辛用庚，丙不可少。 "
            },
            "癸卯": {
                "用神": { "庚，辛":""},"忌神运": {"":""},"描述": "乙木司令，专用庚金，辛金次之"
            },
            "癸辰": {
                "用神": { "丙，辛，甲":""},"忌神运": {"":""},"描述": "上半月专用丙火，下半月虽用丙火，辛甲为佐"
            },
            "癸巳": {
                "用神": { "辛":""},"忌神运": {"":""},"描述": "无辛用庚"
            },
            "癸午": {
                "用神": { "庚，辛，壬，癸":""},"忌神运": {"":""},"描述": "庚辛为生身之本，但丁火司权，金难敌火，宜兼用比劫，方得庚辛之用。"
            },
            "癸未": {
                "用神": { "庚，辛，壬，癸":""},"忌神运": {"":""},"描述": "上半月金神衰弱，火气炎热，宜比劫帮身，同五月。下半月无比劫亦可。"
            },
            "癸申": {
                "用神": { "丁":""},"忌神运": {"":""},"描述": "庚金得禄，必丁火制金为用，丁火以通根午戌未为妙"
            },
            "癸酉": {
                "用神": { "辛，丙":""},"忌神运": {"":""},"描述": "辛金为用，丙火佐之，名水暖金温，须隔位同透为妙。"
            },
            "癸戌": {
                "用神": { "辛":""},"忌神运": {"":""},"描述": "专用辛金，忌戊土，要比劫兹甲制戊方妙。"
            },
            "癸亥": {
                "用神": { "庚，辛，戊，丁":""},"忌神运": {"":""},"描述": "亥中甲木长生，泄散元神，宜用庚辛。水多用戊，金多用丁。"
            },
            "癸子": {
                "用神": { "丙，辛":""},"忌神运": {"":""},"描述": "丙火解冻，辛金滋扶"
            },
            "癸丑": {
                "用神": { "丙，庚，辛":""},"忌神运": {"":""},"描述": "丙火解冻，通根寅巳午未戌方妙。支成金局，要丙透得地。支成火局，又宜用庚辛。"
            }


        };

        /**
         *    用法：
         *    流年为原点 与日柱组合
         *    时柱为原点与 年柱组合
         *  六法冲克-细批终身详解 P616 论“大凶”
         *  “六法冲克”断生死关口 http://blog.sina.com.cn/s/blog_49d801fd0102dsp3.html
         *   纳音相克：纳音相克之中，是以地支隔一位者为重。 后退一位

         墓鬼相克：辰戌丑未地支相同，纳音相克。

         空亡相克：如甲子见庚申。

         夹拱生克：如辛未逢丙午，而见申、卯、午支。

         井栏互克：如甲戌见甲子。

         死生同途：如甲子见己亥、癸未。
         庄案：

         六法冲克是梁师根据《三命通会》卷十《看命口诀》归纳整理成六法冲克表，便利后学检索。
         唯此表错误极多，引用需谨慎。有一定基础者可据《看命口诀》予以修订。
         凡命怕同类相破，如己未见甲辰、甲辰见己丑、己丑见甲戌、甲戌见己未。凡在四冲之地，纳音同类，逐两位逆数之，寅申巳亥、子午卯酉亦以此取，主平生不足，多不成器道。《经》云：“井栏互破，无药可医，遇空亡庶几，岁运亦忌之。”
         原文甲戌见己未，梁师表中误为甲戌见甲子。余可类推。
         * [2017-08-03 add by longzhiyou]
         */

            //60甲子模板
        var jiazimoban = {
                "甲子": [""],
                "乙丑": [""],
                "丙寅": [""],
                "丁卯": [""],
                "戊辰": [""],
                "己巳": [""],
                "庚午": [""],
                "辛未": [""],
                "壬申": [""],
                "癸酉": [""],
                "甲戌": [""],
                "乙亥": [""],
                "丙子": [""],
                "丁丑": [""],
                "戊寅": [""],
                "己卯": [""],
                "庚辰": [""],
                "辛巳": [""],
                "壬午": [""],
                "癸未": [""],
                "甲申": [""],
                "乙酉": [""],
                "丙戌": [""],
                "丁亥": [""],
                "戊子": [""],
                "己丑": [""],
                "庚寅": [""],
                "辛卯": [""],
                "壬辰": [""],
                "癸巳": [""],
                "甲午": [""],
                "乙未": [""],
                "丙申": [""],
                "丁酉": [""],
                "戊戌": [""],
                "己亥": [""],
                "庚子": [""],
                "辛丑": [""],
                "壬寅": [""],
                "癸卯": [""],
                "甲辰": [""],
                "乙巳": [""],
                "丙午": [""],
                "丁未": [""],
                "戊申": [""],
                "己酉": [""],
                "庚戌": [""],
                "辛亥": [""],
                "壬子": [""],
                "癸丑": [""],
                "甲寅": [""],
                "乙卯": [""],
                "丙辰": [""],
                "丁巳": [""],
                "戊午": [""],
                "己未": [""],
                "庚申": [""],
                "辛酉": [""],
                "壬戌": [""],
                "癸亥": [""]
            };



        //纳音同类破，



        /**
         * 三命通会
         *  凡命，最怕鬼克，而
         *  窠鬼最毒。如丙子水见庚子土，丁丑水见辛丑土之类。窠中就位相克，所以最毒。
         *  有墓中鬼，如壬辰水见丙辰土，丙辰土见戊辰木之类
         *  有隔壁鬼，如庚子土见癸丑木之类
         *  有空亡鬼，如甲戌见甲申乙酉之类，皆主为害
         *  墓鬼轻于窠鬼，壁鬼轻于墓鬼，空鬼轻于壁鬼，
         *
         *  若鬼中有鬼，谓之鬼啸如土命人生木月、金日时之类，以木克土，金克木，根基劣弱则凶，主本强健不忌
         *
         *  若木命人得火月、金日时之类，有火克金，金不得伤木，是御鬼也，鬼不为害。
         *  如水命人，四柱有火土，土克水，火又生土，是助鬼也，其鬼尤凶。
         *  干支通用纳音最紧，御鬼则立身于艰难，助鬼则骨肉多生乎破斗。
         *
         *  五行精纪
         *  【鬼论】
         窠中鬼者，如丙子见庚子、丁丑见辛丑之类是也。
         隔壁鬼者，如庚子见癸丑之类是也。
         墓中鬼者，如水人见丙辰，土人见戊辰之类是也。
         空亡鬼者，如甲戌见甲申乙酉之类是也。（天元变化书）
         * [2018-07-19 add by longzhiyou]
         */

        /**
         *   用法：
         *   1. 日柱是key 流年是value
         * [2018-07-19 add by longzhiyou]
         */
            //窠中鬼
        var jiazinayinmuban = {
                "甲子": '海中金',
                "乙丑": "海中金",
                "丙寅": "炉中火",
                "丁卯": "炉中火",
                "戊辰": "大林木",
                "己巳": "大林木",
                "庚午": "路旁土",
                "辛未": "路旁土",
                "壬申": "剑锋金",
                "癸酉": "剑锋金",
                "甲戌": "山头火",
                "乙亥": "山头火",
                "丙子": "涧下水",
                "丁丑": "涧下水",
                "戊寅": "城头土",
                "己卯": "城头土",
                "庚辰": "白蜡金",
                "辛巳": "白蜡金",
                "壬午": "杨柳木",
                "癸未": "杨柳木",
                "甲申": "泉中水",
                "乙酉": "泉中水",
                "丙戌": "屋上土",
                "丁亥": "屋上土",
                "戊子": "霹雳火",
                "己丑": "霹雳火",
                "庚寅": "松柏木",
                "辛卯": "松柏木",
                "壬辰": "长流水",
                "癸巳": "长流水",
                "甲午": "沙中金",
                "乙未": "沙中金",
                "丙申": "山下火",
                "丁酉": "山下火",
                "戊戌": "平地木",
                "己亥": "平地木",
                "庚子": "壁上土",
                "辛丑": "壁上土",
                "壬寅": "金箔金",
                "癸卯": "金箔金",
                "甲辰": "复灯火",
                "乙巳": "复灯火",
                "丙午": "天河水",
                "丁未": "天河水",
                "戊申": "大驿土",
                "己酉": "大驿土",
                "庚戌": "钗钏金",
                "辛亥": "钗钏金",
                "壬子": "桑拓木",
                "癸丑": "桑拓木",
                "甲寅": "大溪水",
                "乙卯": "大溪水",
                "丙辰": "沙中土",
                "丁巳": "沙中土",
                "戊午": "天上火",
                "己未": "天上火",
                "庚申": "石榴木",
                "辛酉": "石榴木",
                "壬戌": "大海水",
                "癸亥": "大海水"
            };

        var chaozhonggui = {
            "甲子": ["戊子"],
            "乙丑": ["己丑"],
            "丙寅": ["甲寅"],
            "丁卯": ["乙卯"],
            "戊辰": ["庚辰"],
            "己巳": ["辛巳"],
            "庚午": ["壬午"],
            "辛未": ["癸未"],
            "壬申": ["丙申"],
            "癸酉": ["丁酉"],
            "甲戌": [""],
            "乙亥": [""],
            "丙子": ["庚子"],
            "丁丑": ["辛丑"],
            "戊寅": ["庚寅"],
            "己卯": ["辛卯"],
            "庚辰": ["甲辰"],
            "辛巳": ["乙巳"],
            "壬午": ["甲午"],
            "癸未": ["乙未"],
            "甲申": ["戊申"],
            "乙酉": ["己酉"],
            "丙戌": [""],
            "丁亥": [""],
            "戊子": ["丙子"],
            "己丑": ["丁丑"],
            "庚寅": ["壬寅"],
            "辛卯": ["癸卯"],
            "壬辰": ["丙辰"],
            "癸巳": ["丁巳"],
            "甲午": ["戊午"],
            "乙未": ["己未"],
            "丙申": ["甲申"],
            "丁酉": ["乙酉"],
            "戊戌": [""],
            "己亥": [""],
            "庚子": ["壬子"],
            "辛丑": ["癸丑"],
            "壬寅": ["丙寅"],
            "癸卯": ["丁卯"],
            "甲辰": ["壬辰"],
            "乙巳": ["癸巳"],
            "丙午": ["庚午"],
            "丁未": ["辛未"],
            "戊申": ["庚申"],
            "己酉": ["辛酉"],
            "庚戌": [""],
            "辛亥": [""],
            "壬子": ["甲子"],
            "癸丑": ["乙丑"],
            "甲寅": ["戊寅"],
            "乙卯": ["己卯"],
            "丙辰": ["戊辰"],
            "丁巳": ["己巳"],
            "戊午": ["丙午"],
            "己未": ["丁未"],
            "庚申": ["壬申"],
            "辛酉": ["癸酉"],
            "壬戌": [""],
            "癸亥": [""]
        };


        var jinbuhuan = {
            "甲子": ["甲日子提为印绶，顺行不似逆行高。官多杀盛东为美，午未相逢总徒劳。"],
            "甲丑": ["阳木天元值丑提，分明大运喜东西。发财发福多荣达，午未之中亦不宜。"],
            "甲寅": ["甲木生东值孟春，财多杀重定超群。顺行火地多难显，逆走终为富贵人。"],
            "甲卯": ["阳木春生值卯提，柱中有杀最为奇。不拘逆顺东南地，申酉相逢反不宜。"],
            "甲辰": ["甲木辰提喜有官，逆行东地弗为欢。顺行南地多颠倒，除是根深富贵看。"],
            "甲巳": ["阳木根深在巳月，柱中财杀喜相逢。逆行早岁声名显，顺行须防夭寿终。"],
            "甲午": ["甲木日干居午月，伤官木火喜生财。顺行怕入西方运，东北行来更妙哉。"],
            "甲未": ["阳木有根生六月，财官有气福非常。逆行最喜东方运，惟恐初生寿不长。"],
            "甲申": ["甲木无根值孟秋，财多杀旺恨身柔。运行顺地迟方好，逆运须防夭更休。"],
            "甲酉": ["甲木酉提用正官，顺行坎地必成欢。逆转南离官被制，须知禄尽见阎王。"],
            "甲戌": ["甲木戌提用财官，顺运东南福更宽。若得柱中逢亥未，逆行名姓达金鸾。"],
            "甲亥": ["甲木生元值亥提，柱中有杀更为奇。中年最喜东方运，午未之中数不齐。"],

            "乙子": ["乙木生居子月中，更无官煞喜匆匆。逆行大运非常美，无杀无官逆运通。"],
            "乙丑": ["乙木提纲值丑官，南方第一次西东。纵然名不登金榜，豪富终须比石崇。"],
            "乙寅": ["乙生寅月木伤官，财杀相逢更有欢。顺运连行多福禄，无财无杀亦贫寒。"],
            "乙卯": ["乙木提纲值仲春，财官有气亦超群。火金大运皆为美，白手兴家迈等伦。"],
            "乙辰": ["乙木辰提为杂气，西方大运亦为高。若行戌运多颠倒，刑并入财寿不牢。"],
            "乙巳": ["乙木相逢孟夏时，运行东北始为奇。柱中更值无根裔，顺运终防寿不齐。"],
            "乙午": ["乙木如逢午月天，食神有气怕身轻。柱中若是根基薄，大运提防喜逆行。"],
            "乙未": ["未月生逢乙日干，柱中官杀亦为欢。顺行西北伤元寿，逆走东南福更宽。"],
            "乙申": ["乙木生来值孟秋，财官印绶忌身柔。中年不许行西北，顺运无如逆运通。"],
            "乙酉": ["乙木酉月杀多强，大运功名佐庙廊。若是有根尤更妙，南行火运贵非常。"],
            "乙戌": ["乙生戌月多财杀，惟恐初年疾病生。若到中年多发达，不拘顺逆总宜行。"],
            "乙亥": ["乙木居亥印生身，逆走西南富贵真。有杀有官犹喜顺，到头大限怕逢辰。"],

            "丙子": ["丙火冬生值子纲，有印生身大吉昌。运入东南多发达，逆行难保寿年长。"],
            "丙丑": ["丙火如逢丑月看，土多格局作伤官。印多运入西方美，根浅东南福不全。"],
            "丙寅": ["丙多官杀值寅提，运入南方分外奇。若是官轻尤喜北，总然大运要行西。"],
            "丙卯": ["丙火日干卯提纲，干弱如逢喜火乡。若是无官尤不利，却行身旺亦平常。"],
            "丙辰": ["丙火辰提戊己多，伤官火土更如何。逢财逢印多通达，南北相逢总不过。"],
            "丙巳": ["丙火建禄日干强，官杀相逢大吉昌。顺逆运行多发达，若行戌运有灾殃。"],
            "丙午": ["丙火午月作伤官，有杀当为贵命看。金水运行多吉利，如行水地不为欢。"],
            "丙未": ["丙逢未月伤官显，官杀相逢未足奇。如得独官为贵气，运行西北利名驰。"],
            "丙申": ["丙火申提日主柔，得从得化始为优。若从水位伤元寿，逆去东南福禄周。"],
            "丙酉": ["丙逢酉月火衰微，比劫扶身寿不奇。逆去东南为背禄，顺行水地始为奇。"],
            "丙戌": ["丙逢戌月土重重，有杀无官回不同。大运顺行多富贵，若逢官杀亦中中。"],
            "丙亥": ["丙火亥提为杀印，分明大运喜东南。中年富贵非常美，运若西方寿不齐。"],


            "丁子": ["丁火如逢子月提，柱中有杀更无亏。平生最喜东方运，若到西方福不齐。"],
            "丁丑": ["丁火丑月事如何，四柱分明怕土多。运入东方俱发达，南方火地不相宜。"],
            "丁寅": ["丁火逢寅印绶明，柱中有水喜南行。运行北地尤通达，西方财乡祸患生。"],
            "丁卯": ["丁逢卯月有印星，南北应多遂利名。独杀若无官混杂，金章紫绶至公卿。"],
            "丁辰": ["丁逢辰月本伤官，顺入南方福更宽。逆运初年多蹇剥，更逢戌亥寿相干。"],
            "丁巳": ["丁逢巳月本刚强，大运何愁入水乡。运入顺行初不利，中年最喜入西方。"],
            "丁午": ["丁逢建禄本身强，无水须防寿不全。若得运中逢七杀，姓名远达九重天。"],
            "丁未": ["未月逢丁要见财，无财到底命多乖。若逢财杀方为美，西方大运更奇哉。"],
            "丁申": ["丁逢申月日干强，大运南方喜逆行。若是根深尤喜顺，中年发达更峥嵘。"],
            "丁酉": ["丁逢酉月用偏财，官杀相逢更妙哉。大运逆行多顺遂，功名两字称心怀。"],
            "丁戌": ["丁逢戌月伤官旺，官杀虽多却不防。南与东方多顺遂，荣华富贵福无疆。"],
            "丁亥": ["丁生亥月用官星，顺逆东南福不轻。若是煞星多混杂，寿年尤恐半凋零。"],

            "戊子": ["戊土日干生子月，坐支辰戌最为奇。支虚更值财神位，运怕东兮又怕西。"],
            "戊丑": ["戊土丑月日干坚，更有财官福寿全。逆顺运行俱得地，若无财杀亦徒然。"],
            "戊寅": ["戊土寅月日干轻，杀印相生格局明。运入火乡尤发达，逆行水地总平平。"],
            "戊卯": ["戊土卯月用官星，有印相生格局清。南运发财强北运，如逢酉地寿元倾。"],
            "戊辰": ["戊土辰月日干强，更有财星福禄昌。顺运西南应发达，财官轻处亦非良。"],
            "戊巳": ["戊土巳提为建禄，柱中财杀更为奇。逆行大运宜东北，顺走西南事不齐。"],
            "戊午": ["戊土五月印当权，大运分明喜杀官。官杀重时宜顺运，官轻逆运妙无端。"],
            "戊未": ["戊土生来季夏天，若无财煞未周全。逆行更喜东方运，顺逆财多亦不然。"],
            "戊申": ["戊土生申用食神，有财有煞贵堪伦。逆行火地必通达，火地行来反受屯。"],
            "戊酉": ["戊土生来值酉提，怕行坎水喜火离。除非四柱元辰旺，卯运相逢最不宜。"],
            "戊戌": ["戊土戌月日干强，财杀重逢更吉祥。运气不拘行顺逆，若无财杀亦平常。"],
            "戊亥": ["戊土亥提财杀真，身强有火更超群。逆行早岁须防酉，顺运中年忌卯辰。"],

            "己子": ["己土子月用财星,有杀无官格局清,大怕柱中身太弱,顺行寅卯早凋零."],
            "己丑": ["己土丑月日干坚,四柱分明忌比肩,若有财官并有杀,逆行大运福无边."],
            "己寅": ["己土寅月值身柔,若是身柔命不周,身旺更行南运美,逆行运气寿休囚."],
            "己卯": ["己土卯月杀当权,逆运须知寿不坚,顺逆火乡无极妙,官星相会不周全."],
            "己辰": ["己土辰提杂气真,财官有气定超群,顺行运气尤当妙,逆运行时不十分."],
            "己巳": ["己土巳月身尤旺,印绶伤官格局清,身旺最宜财运遇,无财逆运亦相应."],
            "己午": ["己土午月本身强,建禄分明理更长,官杀轻时宜顺运,官轻逆行亦荣昌."],
            "己未": ["己土未月欣逢杀,刃煞相伤更妙哉,运气中年多发达,不拘顺逆称心怀."],
            "己申": ["己土申月用伤官,若是身轻必不安,所喜须宜行逆运,怕逢寅卯杀相干."],
            "己酉": ["己土八月辛金旺,若是身轻命不牢,旺喜顺行衰喜逆,无财无杀不为高."],
            "己戌": ["己土如逢九月天,财官两旺福无边,运行顺逆俱平稳,发达之时在壮年."],
            "己亥": ["亥提己土用财官,身旺财官总是欢,若是身柔喜顺运,东方难决一平安."],

            "庚子": ["子月如逢庚日干,有财有杀始平安,西方不似东方运,午运如逢寿数完."],
            "庚丑": ["庚金丑月有财官,格局分明杂气看,木火柱无终不美,东南运气遇为欢."],
            "庚寅": ["庚金寅月日干微,土透天干命愈奇,逆运初年嫌子丑,顺行大运怕逢离."],
            "庚卯": ["庚金生值仲春时,官煞如逢命始奇,但嫌四柱元神弱,顺运三旬恐殒危."],
            "庚辰": ["庚金三月土重重,更有财官福禄丰,逆运固知强顺运,中逢子地有灾凶."],
            "庚巳": ["庚金四月杀星强,有制方知杀伏降,若是无根又无制,其人多有少年亡."],
            "庚午": ["五月庚金喜有根,有根有水贵堪言,逆行大运宜东地,子字相逢总不然."],
            "庚未": ["庚金未月土旺地,戊己土重命无过,若是土轻行逆运,康宁福寿沐恩波."],
            "庚申": ["七月庚金金大刚,坐支若是亦平常,财官两处宜行顺,财杀轻时逆运强."],
            "庚酉": ["八月庚金用两星,柱中有杀最相应,有财无煞纯金局,从革尤当显姓名."],
            "庚戌": ["庚金九月喜逢财,杀透天干亦妙哉,顺命初年兼子地,逆行离巽有凶灾."],
            "庚亥": ["庚金十月日干衰,有土相逢亦妙哉,顺运必然强逆运,中年唯恐有灾危."],

            "辛子": ["子月辛金喜丙丁,若然无火亦平平,运行木火多通达,财杀多时喜逆行."],
            "辛丑": ["辛金丑月宜丁火,戊己重重亦不妨,无火土多防夭寿,纵然不夭也平常."],
            "辛寅": ["辛金寅月财官旺,大运不须喜逆行,若是无财行顺运,中年唯恐丧残生."],
            "辛卯": ["卯月辛金如有杀,坐支有土更为奇,顺行逆转名多显,若到西方反不齐."],
            "辛辰": ["辛金生於辰月中,有财有杀更和同,顺行逆运多通达,富贵荣华福寿崇."],
            "辛巳": ["辛金巳月官星旺,伤食全无亦不过,逆运但防官字否,顺行一路总蹉跎."],
            "辛午": ["辛金午月杀当权,四柱根深逆顺坚,若是无根堪弃命,如行西运大无恙."],
            "辛未": ["未月辛金杀印全,印多尤似有亏偏,逆行水运多通达,顺运初年略不然."],
            "辛申": ["申月辛金金水清,伤官有杀最相应,坐支无酉方为妙,运入东南显姓名."],
            "辛酉": ["辛金酉月日干强,财杀相逢更异常,逆运到头多发达,顺行水地未为良."],
            "辛戌": ["戌月辛金煞印全,柱中有制福无边,逆行顺去俱无阻,巳地相逢总不然."],
            "辛亥": ["辛金亥月若无官,水冷应知金大寒,若有官星尤有杀,定应名姓到金銮."],

            "壬子": ["壬水生逢子月天,无财无杀未周全,终身困苦多流落,纵到财乡亦枉然."],
            "壬丑": ["壬水丑月喜逢财,财旺身强更妙哉,运气顺行经水火,堪为万事称君怀."],
            "壬寅": ["壬水如逢寅月生,食神相左亦相应,南方运气增财帛,有杀终当播姓名."],
            "壬卯": ["壬逢卯月伤官格,逆运无如顺运高,杀透更加身旺处,功名富贵寿称高."],
            "壬辰": ["壬水辰月杀星强,甲乙相逢杀伏降,更得财星并印绶,不拘顺逆亦相当."],
            "壬巳": ["壬水生逢夏月天,财星官杀旺堂前,无根只怕初年失,若到中年福愈坚."],
            "壬午": ["壬生午月财星旺,亥水相逢更异常,若是无根多弃命,平生白手置田庄."],
            "壬未": ["壬水生逢季夏时,分明杂气异为奇,顺行逆转多通达,卯地相逢总不宜."],
            "壬申": ["壬水生申为杀印,有财有用亦相当,运行南地强如壮,卯地相逢命不长."],
            "壬酉": ["壬水相逢八月天,分明印绶格当权,无官怕入财乡运,有杀须应福愈坚."],
            "壬戌": ["壬水生来值季秋,财多杀旺身忌柔,财居火地俱通达,并木之乡返不周."],
            "壬亥": ["壬水亥提为建禄,柱中有土运之东,南方运气俱为美,若是无财亦不通."],

            "癸子": ["癸水冬生值子提,财官重见最为奇,顺行喜到东南运,逆走南方亦不宜."],
            "癸丑": ["癸水丑提为杂气,无财无印不堪推,顺行木火俱为妙,逆运西南寿不齐."],
            "癸寅": ["癸水寅月木伤官,官杀重逢祸百端,北运不如南运好,若到申宫寿有干."],
            "癸卯": ["癸水生来卯月中,无官无杀喜和同,顺行南地多清贵,恐入西方寿早终."],
            "癸辰": ["癸水辰月喜逢财,杂气分明格美哉,若是无根身太弱,顺行南运必多灾."],
            "癸巳": ["癸水巳提财更旺,官多不与杀相同,有根逆运多财足,顺入西方早见凶."],
            "癸午": ["癸水生逢午月中,分明财杀格相同,无根运不行申地,弃水从财反有功."],
            "癸未": ["癸水未月杀星强,有刃无官禄位昌,运入东方经制伏,定看名姓列朝堂."],
            "癸申": ["癸水生来值孟秋,有财终不忌身柔,顺行北运尤为妙,若是无财反不周."],
            "癸酉": ["癸水酉月印生身,有杀方为格局真,逆运须知强顺运,功名富贵又超群."],
            "癸戌": ["戌月如逢癸日干,分明杂气用财官,运行木火多财禄,逆运初年寿有干."],
            "癸亥": ["癸日生来亥月中,伤官水木总相同,逆行最妙南方运,顺走须知忌卯凶."],
        };

        //天禄贵神
        var tianluguishen={
            "甲":["辛酉","辛亥"],
            "己": ["辛丑", "辛未"],

            "乙": ["壬子", "壬申"],
            "庚": ["乙丑", "乙未", "己丑", "己未"],

            "丙": ["癸巳", "癸卯"],
            "辛": ["丁酉", "丁亥"],

            "丁": ["辛酉", "辛亥"],
            "壬": ["丙寅", "丙午"],

            "戊": ["癸酉", "癸亥"],
            "癸": ["乙丑", "乙未", "己丑", "己未"]
        };


        vm.jiaziinfo = "甲子";
        vm.getJiaziShuxing = function () {
            vm.resultJiazi = jiazishuxinglist[vm.jiaziinfo];
        };

        function getJiaZiIndex(jiazi) {
            for (var i = 0; i < 60; i++) {
                if (sixtyJiaZi[i] === jiazi) {
                    return i;
                }
            }
            return 0;
        }

        function xingnianPase(zhu) {
            vm.xingnianzhu = zhu;
            vm.xingniangan = zhu[0];
            vm.xingnianzhi = zhu[1];
            vm.xingniannayin = jiazinayin[zhu];

        }

        function dayunPase(zhu) {

            vm.dayunzhu = zhu;
            vm.dayungan = zhu[0];
            vm.dayunzhi = zhu[1];
            vm.dayunnayin = jiazinayin[zhu];

        }

        function liunianPase(zhu) {

            vm.liunianzhu = zhu;
            vm.liuniangan = zhu[0];
            vm.liunianzhi = zhu[1];
            vm.liuniannayin = jiazinayin[zhu];

        }


        //计算行年
        function calculateXingNian() {
            //传统算法 男-丙寅顺行 女-壬申逆行
            //丙寅索引 2 壬申索引 8
            var birthYear = parseInt(vm.birth.substr(0,4));

            var begin = vm.countYear - birthYear;
            if (vm.genderSelected.title === "男") {


                xingnianPase(sixtyJiaZi[(begin + 2) % 60]);
            }else {
                var index = (8 - begin) % 60;
                if (index < 0) {
                    index = 60 + index;
                }

                xingnianPase(sixtyJiaZi[index]);

            }

        }

        function calculateXingNianShiZhu() {
            //获取时柱
            var startIndex = sixtyJiaZi.indexOf(vm.shizhu);
            var birthYear = parseInt(vm.birth.substr(0,4));

            var begin = vm.countYear - birthYear;

            var gender = vm.genderSelected.title;
            //时柱 阳男阴女-顺行 阴男阳女-逆行

            if ((gender === "男" && isYangGan(vm.niangan)) || (gender === "女" && !isYangGan(vm.niangan))) {
                xingnianPase(sixtyJiaZi[(begin + startIndex + 1) % 60]);

            } else {
                var index = (startIndex - begin - 1) % 60;
                if (index < 0) {
                    index = 60 + index;
                }

                xingnianPase(sixtyJiaZi[index]);

            }


        }

        vm.setXingnian = function () {
            xingnianPase(vm.countYear);
        };




        vm.match = function () {

            var filter  = {
                gender:vm.genderSelected.value,
                bazi:vm.strBaZi
            };
            Restangular.one("bazis","analyze").get(filter).then(function(result) {
                vm.matchResult = result;

            }, function(error) {
                promptService.failure(setting.getDataError);

            });

        };

        vm.back = back;

        function back() {
            $state.go('customers.index');
        }

        vm.dayunSet = dayunSet;
        function dayunSet(item) {
            dayunPase(item.title);

        }
        vm.liunianSet = liunianSet;
        function liunianSet(item) {
            liunianPase(item.title);

        }

        function pasebazi(strBaZi) {
            var sizhu = [];
            for (var i = 0; i < strBaZi.length; i++) {
                var s = strBaZi[i];
                var b = false;
                if (tiangan.indexOf(s) >= 0) {
                    b = true;
                } else if (dizhi.indexOf(s) >= 0) {
                    b = true;
                }

                if (b) {
                    sizhu.push(s);
                }

            }
            if (sizhu.length > 7) {
                vm.niangan = sizhu[0];
                vm.nianzhi = sizhu[1];
                vm.nianzhu = vm.niangan + vm.nianzhi;
                vm.niannayin = jiazinayin[vm.nianzhu];

                vm.yuegan = sizhu[2];
                vm.yuezhi = sizhu[3];
                vm.yuezhu = vm.yuegan + vm.yuezhi;
                vm.yuenayin = jiazinayin[vm.yuezhu];

                vm.rigan = sizhu[4];
                vm.rizhi = sizhu[5];
                vm.rizhu = vm.rigan + vm.rizhi;
                vm.rinayin = jiazinayin[vm.rizhu];

                vm.shigan = sizhu[6];
                vm.shizhi = sizhu[7];
                vm.shizhu = vm.shigan + vm.shizhi;
                vm.shinayin = jiazinayin[vm.shizhu];
            }
        }
        vm.analyze = analyze;

        // mapResult["【戟锋煞-月支日干时干】"]=["命主后天意外伤害而伤残，大运流年忌讳【忌干】旺支。刑合之期"
        var jianfengsha=["寅甲",
            "卯乙",
            "辰戊",
            "巳丙",
            "午丁",
            "未己",
            "申庚",
            "酉辛",
            "戌戊",
            "亥壬",
            "子癸",
            "丑己"];

        //【破煞-年时地支】 mapResult["【破煞-年时地支】"]="少年多灾难，多指连累家属破财，如连年有病，增加家长无限忧虑。"
        var posha=["卯午","丑辰","子酉","未戌"]

        // mapResult["【天刑煞-年支时干组合】"]="体弱多病，一生多有疾病。常与医生交往，医药费比较高，但也年年过"
        var tianxingsha=["子乙","丑乙","寅庚","卯辛"
            ,"辰辛","巳壬","午癸","未癸"
            ,"申丙","酉丁","戌丁","亥戊"];


        //雷霆煞-月支对时支"忽然遇难,祸起萧墙。如游泳淹死，登山失足坠山，驾驶昏睡出车祸。"
        var leitingsha = {
            "寅":"子",
            "申":"子",
            "卯":"寅",
            "酉":"寅",

            "辰":"辰",
            "戌":"辰",

            "巳":"午",
            "亥":"子",

            "午":"申",
            "子":"申",
            "未":"戍",
            "丑":"戍"
        };


        var bingfu={
            "子":"亥","丑":"子","寅":"丑","卯":"寅",
            "辰":"卯","巳":"辰","午":"巳","未":"午",
            "申":"未","酉":"申","戌":"酉","亥":"戌"
        };

        var jialuxiang={
            "甲":"卯、丑",
            "乙":"寅、辰",
            "丙":"辰、午",
            "丁":"巳、未",
            "戊":"辰、午",
            "己":"巳、未",
            "庚":"未、酉",
            "辛":"申、戌",
            "壬":"戌、子",
            "癸":"亥、丑",
        };

        var jialuchao={
            "丁庚而得未",
            "己庚而得未",
            "丙乙而得辰",
            "戊乙而得辰",
            "辛壬而得戍",
            "癸甲而得丑",

        };



        function analyze() {
            pasebazi(vm.strBaZi);

            dayunSet(vm.dayunSelect);
            liunianSet(vm.liunianSelect);
            vm.calculateXingNian();

            vm.match();

            var result = {};
            var suiyun = {};

            result["年柱"] = {

                "天乙贵人": {
                    "贵人":gettianyi(vm.niangan)
                    ,"夹贵印":jiaguiyin
                    ,"正天乙-要全":[getzhitianyi(vm.nianzhi)
                        ,"若丑未人甲戊庚中，惟得两字。子申人得乙己全。酉亥人得丙丁全之类"
                        ,"更与太岁干禄为正官正印者，其福加倍也。如 甲寅 见辛 "
                        ,"若在太岁本干四贵华盖之上，遇两天乙者，台辅之命也 如 甲寅 见辛亥 亥是甲长生"
                        ,"若在四平之位，遇两天乙者，亦为侍从清华 之命。"
                        ,"若在四忌上，遇两天乙者，常调之官也。"
                    ]


                    ,"[天乙贵神相还格-交互见贵]":["此格有三,干合为上，支合次之，无合者又次之。"
                        ,"《寸珠尺璧》云：凡月日时互换见贵，太岁不带者不贵。"
                        ,"《紫虚局》云：贵人交互人多贵，旺气相乘馆殿资。切莫五行伤着主，令人闲地冷清虚。"
                        ,"若无死绝冲破空亡，更有福神佐之，当极一品之贵达，有死绝为鄙吝杀故也。如有死绝冲破空亡之类，只做正郎员郎，然多难无福耳。"

                    ]
                    ,"【干夹贵神格】":"如甲戊庚年生人，得丑日或未，时上却带甲戊庚中一字主显异。"
                    ,"[贵合] ":["有贵合则官位穹崇，所作契合.有贵合则官多称意"
                        ,"如甲戊庚贵在丑未，甲得己丑己未，戊得癸丑癸未，庚得乙丑乙未；"
                        ,"乙己贵在申子，乙得庚子庚申，己得甲子甲申"
                        ,"丙丁贵在亥酉，丙得辛酉辛亥，丁得壬寅壬辰"

                    ]
                    ,"[贵食] 食神坐自己的贵人":["有贵食，则财禄丰足，所成遇望"
                        ,"阴阳不匹配则选择贵人地支六合"
                        ,"甲得丙寅 丙辰"
                        ,"乙得丁酉 丁亥"
                        ,"庚得壬申 壬戌"
                        ,"辛得癸卯 癸巳"
                    ]
                    ,"象":[
                        "天乙贵人者，三命中最吉之神也，若人遇之，主荣名早达，官禄易近，若更三命皆乘旺气，终登将相公卿之位，大小运行年至此，亦主迁官进财，一切加临至此，皆为吉兆。（三命指掌）"
                        ,"宜以纳音互换推寻，须比和则其贵为福，若丙寅火得酉，则火至此死，焉足为贵哉。（广录）。"
                        ,"若与禄马同窠，不犯交退伏神,支干相合者，定须官高职清，若无德，更值空亡交退伏神，五行无气，至老不贵。紧要在月日时支干相合，则为吉，不然乃庸常流也。（同金书命诀）"
                        ,"与【劫杀】倂，则貌厚有威，多谋足计，与【官符】倂则文翰飘逸，高谈雄辩，与建录倂则文翰纯实，济惠广施也。（烛神经）"
                        ,{"贵人福力厚薄":["甲尤喜未，庚尤喜丑，各归其库也。"
                            ,"戊子戊寅戊午喜丑，丑者火人胎养之乡；"
                            ,"戊辰戊申戊戌喜未，未者木人入库，土人生旺之位也。"
                            ,"然乙尤喜申者，木之绝乡也；己尤喜申，申者坤之正位也。"
                            ,"丙丁属火，火墓在戌"
                            ,"然乙尤喜申者，木之绝乡也；己尤喜申，申者坤之正位也。"

                        ]}
                        ,"李虚中云：本家贵人全者，如甲人有戊、有庚、有丑、有未是也，大贵。"
                        ,"紫虚格有贵人入庙格歌云：甲戊须寻癸未时，戊庚乙丑细穷推，丙丁丁酉乙亥是，壬癸乙卯癸巳奇，乙得戊申并庚子，己居丙子甲申时，辛遇丙寅兼戊午，遇者重金挂紫绯。 "
                        ,"有贵人入庙格，取五虎元遁之贵人本位上，见所遁之干者是也"

                    ]
                    ,"[天乙扶身格］":["假令壬寅人得甲寅日时，壬贵在卯，甲贵在丑是也.丙申人得戊申，准此"]
                },
                "禄": {
                    "干禄":getlu(vm.niangan)
                    ,"本家禄":getzhilu(vm.nianzhi)
                    ,"【天禄贵神】":[
                        tianluguishen[vm.niangan]
                        ,"太岁本干不见禄，取五虎元遁，至禄上看得何干，真干见天乙贵神，而贵人所坐之干，复得贵于禄上者是也。"
                        ,"假令六【丁】人禄在午，至午上得丙字，丙贵在酉亥，而得【辛酉】或【辛亥】，则辛贵复见于午也，此为入格。"
                        ,"又如六【壬】人至禄上得辛，而见【丙寅】者是也"
                        ,"如更入格，贵极一品，常格得之，不下三品。（玉霄宝鉴）"
                    ]
                    ,"禄气专位":["甲寅、乙卯、丙辰、丁巳、丙午、己未、庚申、辛酉、戊戌、癸亥、壬子癸丑，十干在十二辰上，如五位中得之多或得之全"]
                    ,"【禄气相亲】":["本是甲寅，得乙卯为帝坐；本是庚申，得辛酉为帝坐，谓之顺禄入凤池。"
                        ,"本是辛酉，得庚申为帝坐；本是乙卯，得甲寅为帝坐，谓之逆禄入凤池。"
                        ,"甲寅、乙卯、庚申、辛酉之命，与日上或时上干支同者，谓之本禄入凤池，更遇天乙、天官、食神、驿马居其上，有气而不犯空亡者，文贵命也。"
                        ,"丙寅得辛巳，戊寅得癸巳，丁人得壬午，己人得甲午，壬人得丁亥，癸人得戊子，在于帝坐，谓之合禄入凤池。"


                    ]
                    ,"夹禄乡-次之":[jialuxiang[vm.niangan]]
                    ,"夹禄窠-为上":jialuchao
                    ,"":""
                },
                "马": getma(vm.nianzhi),
                "官神": {
                    "[真官]":["己丑得甲寅，辛丑得丙寅，如此之类，谓之真官，不贵即富。命前一辰是也"],
                    "【暗官】":["谓如庚辛用丙丁为官，不见丙丁而见寅午戌，则为暗官，得火局也。（广录）"],
                    "【生成官】":[
                        "水土同宫",
                        "甲乙人得辛巳庚申辛酉",
                        "丙丁人得壬申癸亥壬子",
                        "戊己人得乙亥甲寅乙卯",
                        "庚辛人得丙寅丁巳丙午",
                        "壬癸人得戊申己亥戊子",
                        "若资驿马学堂贵人助之，无不发越。（李虚中书）"],
                    "【正官禄】五虎遁官禄位":[
                        zhengguanlu[vm.niangan],
                        "犯者胜带正官，正禄见带前后神亦佳。（太一经）"
                    ],
                    "【交互官格】大贵":["甲申见乙酉  丙午见壬子  乙卯见戊申 庚午见壬午  丁巳见辛亥   癸亥见丁巳"],
                    "【六合官星格】":["阴干合官，两柱在一旬","官是六合少人知，贵在旬中始是奇，生日生时如直入，太师太傅佩旌旗。"],
                    "【上下官印】":["正财生官","甲己辛、乙戊庚、丙辛癸、丁庚壬、戊癸乙 己壬甲  庚乙丁  辛甲丙  壬丁己  癸丙戊",
                        "以上又名十样锦，主甲科官近禁地，常人亦不至艰辛。"],
                    "[官下有印］": ["如甲人见辛月，丙日时之类是也。主官职崇高，名位清峻。"],
                    "[官下有食有合]": ["月干是官","如甲人见辛为官，辛食癸，丙与辛合，在月日时上是也。主为官有贴职，常人有兼艺。"],
                    "[官会杀］": ["甲乙人见辛丑  丙丁人见壬辰  戊己人见乙未 庚辛人见丙戌  壬癸人见戊辰",
                        "如辛金克甲乙木，金墓在丑。余仿此。君子主甲科，武人战功，常人艺业出俗。"]

                },
                "财": {
                    "偏财": piancai[vm.niangan],
                    "正财": zhengcai[vm.niangan]
                },
                "食神": shishen[vm.niangan],

                "五行正印": getwuxingzhengyin(getnayinwuxing(vm.nianzhu)),
                "空亡": getXunKongWang(vm.nianzhu),
                "劫杀": jiesha[vm.nianzhi],
                "亡神": wangshen[vm.nianzhi],
                "元辰": [
                    "元辰大耗者，阳男阴女，在冲前一位支辰，阴男阳女，在冲后一辰",
                    "主人形狈古朴，声音沉浊，生旺落魄，大度不别是非。死绝则寒薄狈猥，不识羞辱，一生无成，贪饮好情",
                    "",
                    "",
                    "",
                ],
                "三刑": [
                    "",
                    "",
                    "",
                    "",
                    "",

                ],
                "六害": [
                    liuhai[vm.nianzhi],
                    "子未相害者，谓未以旺土害子旺水，此势【家】相害也。故子人见未则为害，未人见子不为害也。",
                    "",
                    "",
                    "",
                    "神白经云：若干神有鬼，其害甚重。",
                    "李虚中云：寅害巳，阳男阴女尤忌。",

                    "",
                    "",

                ],
                "论华盖": [
                    "寅午戌人在戌。巳酉丑人在丑。申子辰人在辰。亥卯未人在未",
                    "李虚中云：寅害巳，阳男阴女尤忌。",
                    "",
                    "",
                    "",

                ],
                "金杀": [
                    "金神大杀者，至凶之神，与人为灾，而不为福。又主丧服哭泣之事。",
                    "古人云：寅、申、巳、亥，鸡头粉粹，四支生人，金神在酉。",
                    "子、午、卯、酉，蛇头开口。四支生人，金神在巳。",
                    "辰、戍、丑、未，牛头大忌。四支生人，金神在丑。",
                    "丑人金杀在本命，若生月生日时又在丑上，带鬼尅身，则有不测之祸。",
                    "以巳酉丑金之位，故金神居于上，所值金神，下更带金火，则为灾，又大而迟。（三命提要）",
                    "一杀而有三名，一曰吟呻杀，二曰破碎杀，三曰白衣杀。",
                    "在巳曰吟呻，巳中临官之火，火者，金之官也。金气临尅，主官府杖楚、刑狱呻吟之灾。故曰吟呻。",
                    "在酉曰破碎，酉者金旺之地，杀物当时，又有辛金相助，万物当之，无不破碎，主支离破碎，流血之灾。故曰破碎。",
                    "在丑曰白衣，乃金库墓也，居四季而临鬼门，主妨害，丧服，哭泣之事。故曰白衣。",
                    "其神常主横事。与官符併，则横来官灾；与劫杀併，则横来死丧；与白虎羊刄併，则流血伤残，与贵人建禄併，则稍慢，五行旺相不须用也。",
                    "金杀者伤害之辰，男子犯之，多有刑伤，兵刃之灾。妇人有产厄，行年至此亦然。",
                    "子午卯酉人见巳金生处，主大风瘫缓之疾，",
                    "寅申巳亥人见酉金旺处，主水痼毒药之病",
                    "辰戌丑未人见丑金墓处，主克妻害子，恶死之忧。",
                    "若带三刑德贵，主有高官握兵权。（金书命诀）",

                ],

                "纳音长生诀": getnayinchangshengjue(getnayinwuxing(vm.nianzhu)),
                "天干五行长生诀": getwuxingchangshengje(getganwuxing(vm.niangan)),
                "五虎遁": wuhudun[vm.niangan],

                "【贫贱所成】":{
                    "刑聚败极":["【死处遇克，绝处遇刑】","甲申得丁巳、己卯、己巳之类。"],
                    "四柱不收":["甲子得丙寅、丁巳、辛亥、壬申之类"],
                    "五行未备":[""],
                    "数无取用":[""],
                    "一方前后":["如木命人得巳丑之类。"],
                    "柱多隔角":["如辛丑得辛卯，甲子得甲戊"],
                    "真者失时":[""],
                    "假音殃克":"五行克纳音，本轻却多逢克制。",
                    "主本倒乱":"火年水日，更先逢生旺，继逢死绝。",
                    "父子乖违":"日克年，时克年。",
                    "黎庶之命":" 忽若干支错乱，阴阳偏枯，八字无格以扶持，九命有刑而驳杂，忽作间巷之辈，忽为市井之徒。岂独不利不名，又且多穷多窘。",

                },

                "凶杀":{
                    "[诸杀伤]":[
                        "五鬼怕夜生，空亡怕六害，三刑怕金，自刑怕火，羊刃怕金。咸池怕水，劫杀怕金，华盖怕金木，返吟怕鬼。（《三命纂局》",
                        "褚刑殺，須看納音與當生年,相尅者為災重，見生者輕，刑殺受旺氣者，為災重，刑殺返遭刑尅衝害破者輕，刑殺上帶祿馬貴人者，必主有大權勢也。（李中虛書）",
                        "","","","","",
                    ],
                    "戟锋煞-月支取": [jianfengsha[vm.yuezhi],"命主后天意外伤害而伤残，大运流年忌讳【忌干】旺支。刑合之期"],
                    "天刑煞-年支时干组合": [tianxingsha[vm.yuezhi],"体弱多病，一生多有疾病。常与医生交往，医药费比较高，但也年年过"],
                    "截路空亡": [jielukongwang[vm.niangan],
                        "甲己申酉以为仇，乙庚午未不须游，丙辛辰巳门外立，丁壬寅卯一场空，戊癸子丑高堂坐，时值空亡不可求。",
                        "若月值，初限不安，日值，中限不泰，时值，末限不快，若受胎月、日值者，一生不快。",
                        "八字金书云：凡值此一重不妨，二三重主早亡，不然主遭刑，如甲己生人，申酉日时，定不好，纵干纳吉，只作寻常命，运到此亦凶。",
                    ],
                    "【沐浴杀】": ["沐浴名休败，卖田还宿债，业尽损妻儿，作事何【曾】快，如金人逢午是，余傚此。",
                        "酒色，不然耽赌博。寸珠尺璧云：凡男女命，忌沐浴，主淫乱。",
                        "壶中子云：沐浴临年，伯夷有首阳之饿。注云：见生值沐浴曰祼刑，行年值沐浴曰穷杀，故曰伯夷有首阳之饿。",
                    ],
                    "【阴阳杀】": ["女命得戊午，男命得丙子，是也。",
                        "若日上逢之，男娶美丽妇人，女适端正之夫。男得丙子平生多得美妇人也。女得戊午，平生多逢美男也。",
                        "大忌元辰、咸池同宫，不以男女皆淫荡。",
                        "如男得戊午多妇人相爱，女得丙子，多男子挑诱。更看有无贵贱格局，消息用之。（并烛神经）",
                    ],
                    "【死气杀】": ["取命前四辰，如子人在辰是也，主夭折或刑狱之厄。（三命指掌）"],
                    "【官符杀】": ["取太岁前五辰是(对冲后一辰)，日时遇之平生多官灾，更并羊刃乃徒行之命。从太岁数起，至第五辰是。古诗云：五官六死十二病，三丧十一客来临。"],
                    "【病符杀】": ["取太岁后一辰是，犯者多疾病，行年遇之亦然。（宰公要诀）"],
                    "【死符杀】": ["取病符对冲是，月日时犯之，无贵神救，凶恶短折。"],
                    "【血光杀】": ["子日戌时丑日卯时辰日午时未日酉时以上是隔角杀，君子主痈疽致命，庶人血光致死，日时上主妻子损克，胎年克父母。（并广信集）"],
                    "【又血光杀】": ["子人戌，戌人子，丑人卯，卯人丑，辰人午，午人辰，巳人未，未人巳，申人戌，戌人申，酉人亥，亥人酉，日时犯者平生多血灾。"],
                    "丧门": [sangmen[vm.nianzhi],"命前两位为丧门"],
                    "吊客": [diaoke[vm.nianzhi],"命后两位为吊客"],
                    "勾绞": [
                        gou[vm.nianzhi],
                        jiao[vm.nianzhi],
                        "阳命人前三辰为勾，后三辰为绞，阴命人前三辰为绞，后三辰为勾",
                        "假令甲子阳命人二月为绞，八月为勾，乙丑阴命人三月为勾，九月为绞，余准此。",
                        "凡人遇之，身若克杀，多掌刑法之任。或为将帅，专行诛戮。杀若克身，主非命而终。",
                        "玉门关集云：勾绞主非命）小人逢之，皆为飞横灾祸。行年至此，亦主口舌刑狱之事。（三命钤）",
                        "勾绞二杀至凶之神，二杀与人为灾，而不为福，值勾绞两位全者，灾重，一位者灾轻。",
                        "又云：以上杀有鬼则灾重，无鬼则灾轻。（三命提要）",

                        "若带三刑德贵，主有高官握兵权。（金书命诀）",

                    ],

                    "雷霆煞-月支对时支": [
                        leitingsha[vm.yuezhi],
                        "忽然遇难,祸起萧墙。如游泳淹死，登山失足坠山，驾驶昏睡出车祸。",
                    ],

                    "孤辰": "",
                    "寡宿": "",

                },

                "鬼论": {
                    "绝中遇鬼多贫贱": ["如木命见壬申，如生年纳音值绝，更逢纳音鬼多，主贫贱。",
                        "或多吉杀扶持，先须贫，后方富也。",
                        "有人是戊午年，壬戌月，癸亥日，戊寅时，其人先贫，盖壬戌癸亥乃是绝中逢鬼。后戊寅土与癸亥、君臣庆会，土能制水，寅午戌三合为炎上局，故主后大富也。（沈芝《源髓》）",
                    ],
                    "窠中鬼者": "如丙子见庚子、丁丑见辛丑之类是也",
                    "隔壁鬼者": "如庚子见癸丑之类是也",
                    "墓中鬼者": "如水人见丙辰，土人见戊辰之类是也",
                    "空亡鬼者": "如甲戌见甲申乙酉之类是也",
                    "真鬼刑疾": [
                        "年干真五行被日时两干六合真五行克",
                        "玉霄寶鑑云：假令甲己人不見丁壬全，而見壬寅或丁亥、丁卯、丁未者，亦是真鬼，若於福繁之地及貴人祿馬上見者，謂之變鬼為官，反為福，主凶中有吉。 ",
                        "大抵凶杀所居,干神不宜带真鬼。虽见真官，尚变为鬼，况见真鬼？则为灾祸明矣。（《玉霄宝鉴》）",
                        "又若己酉己卯人見丁壬，壬子壬午人見乙庚，雖納音見真五行克為官，奈本干同受克，故不作真官，而作真鬼斷之，大小運太歲逢之，災尤重。",
                        "神白经云：未为旺土来害子水，故子人见未，更有真鬼，其害尤重。",
                        "神白经云：申亥均为六害，更纳音相克尤甚。",


                    ],

                },
                "同类破": "如己未见甲辰、甲辰见己丑、己丑见甲戌、甲戌见己未。凡在四冲之地，纳音同类，逐两位逆数之，寅申巳亥、子午卯酉亦以此取，主平生不足，多不成器道。《经》云：“井栏互破，无药可医，遇空亡庶几，岁运亦忌之。",



            };
            result["调侯"] = tiaohou[vm.rigan+vm.yuezhi];



            vm.sizhuAnalyze = result;

            vm.suiyunAnalyze["大运"] = {
                "虚一待用":["发于沉滞之中，有非常之庆，起于贫贱之间，有不次之用，当在岁运相遇也。 "
                    ,"谓金、木、水、火而无土"
                    ,"或乙、辛、丁而无癸"
                    ,"或甲、丙、庚而无壬"
                    ,"或辰、戌、丑而无未"
                    ,"或卯、酉、午而无子"
                    ,"或寅、申、亥而无巳"
                    ,"有天乙而无天官"
                    ,"有官印而无食神"
                    ,"有甲戊而无庚，有丙丁而虚乙"
                    ,"至于六合、四库、三合，交互见贵，见禄之类，待其岁运，补其不足，则气数备。"
                ],
                "金不换":jinbuhuan[vm.rigan + vm.yuezhi],
                "调候大运": tiaohoudayun[vm.rigan+vm.yuezhi],
                "十干败亡": "只要日主四柱地支没有临官、帝旺根,轻则败落，重则死伤",
                "墓库": "五年不吉祥",
                "冲提": [
                    "双冲", "甲日卯月", "丙日午月", "丁日辰月", "戊日寅月", "戊日卯月", "戊日酉月", "己日申月", "庚日戌月", "庚日子月", "癸日寅月", "癸日卯月"
                ],
                "冲": ["岁运并临冲提大运-大凶", "岁运不同冲-停滞一年", "岁运拱地支冲任何一柱-凶", "岁运并临双冲四柱任一柱-大凶"],

                "生旺库罗网": {
                    "四生": ["大胆闯祸", "敢作敢为 没有则相反，大意轻敌而引祸", "巳亥为两极之地，地天斡旋；寅申为三停之方，邮递往来，如人遇之，多不执一"],
                    "四旺": ["是非", "令人往来不定", "私生活不佳"],
                    "四库": ["潜伏 隐蔽。不显山不漏水", "吉也凶", "丑未迟迟，辰戌速速，遇之令人执方，性不通变。辰戌有气，却能建立大事。"]
                },
                "换甲": "",

                "亲属引死绝": ""


            };

            vm.suiyunAnalyze["二运"] = {
                "喜会(年干五行论)":[
                        "（一）谓大运至禄旺，小运至驿马。假令癸丑人，大运至子，小运至亥，是也。"
                        ,"（二）谓大运至驿马，小运至建禄。假令癸丑生人，大运至亥，小运至子，是也。"
                        ,"（三）谓大运至驿马，小运至马合。假令癸丑生人，大运至亥，小运至寅，是也。"
                        ,"（四）谓大运至驿马合，小运至驿马。假令癸丑生人，大运至寅，小运至亥，是也。"
                        ,"（五）谓大运至禄库，小运至禄库合。假令癸丑生人，大运至辰，小运至酉，是也。"
                        ,"（六）谓大运至禄财长生，或命财长生，小运至合。假令癸丑生人，寅为禄财长生，寅与亥合，申为命财长生，巳与申合，是也。"
                        ,"（七）谓大运至禄长生，小运至建禄。假令癸巳生人，大运至申，小运至子，是也。"
                        ,"（八）谓大运至身旺，小运与本命合。假令癸丑生人，大运至卯，小运至子，是也。"
                        ,"（九）谓大运小运至禄命旺相之乡。假令癸丑生人，至亥子是也。"

                    ]
                ,"厄会":[
                    "（一）谓大运至禄命绝，小运至败，假令癸丑生人，大运至巳，小运至酉，是也。",
                    "（二）谓大小二运併在禄命无气之乡，假令癸丑生人，巳为绝，酉为败，丑为衰，寅为病，卯为死，辰为墓，是也。",
                    "（三）谓大运小运相冲，假令癸丑生人，大运至卯，小运至酉，或大运至酉，小运至卯，又卯酉为死败之乡，是也。",
                    "（四）谓大运在本命，小运又冲破，假令癸丑生人，大运至丑，小运至未，是也。",
                    "（五）谓大运至生月，小运至胎月，假令癸丑三月生，大运至辰，小运至未，是也。",
                    "（六）谓大小二运併在三刑、六害、元辰之位。假令癸丑生人，六害、元辰在午，三刑在未，是也。",
                    "（七）谓大小二运至灾劫二杀之位，假令癸丑生人，劫杀在寅，灾杀在卯，是也。",
                    "（八）谓大小二运落空亡，假令癸丑人，是甲辰旬中寅卯为空亡，是也。",
                    "（九）谓大小二运至男女正天罗地网，假令戌生男，遇亥，亥生女，遇戌，为正天罗。辰生男，遇巳，巳生女，遇辰，为正地网是也。",
                ]


            };

            vm.suiyunAnalyze["流年"] = {
                "规则": [
                    "流年为起点与大运四柱匹配", {
                        "进角合": "进角吉",
                        "退角合": "先成后败"
                    }
                ]
            };


        };



        function init() {



            Restangular.one("customers",vm.id).get().then(function(hal) {
                vm.customer = hal;
                vm.genderSelected = getSelectedGender(hal.gender);
                vm.strBaZi = vm.customer.bazi;
                if(vm.customer.birth){
                    vm.birth = vm.customer.birth;
                }

                analyze();


            }, function(error) {
                promptService.failure(setting.getDataError);

            });


        }


        init();

    }

})();