/**
 * @author lzy
 * created on 2017-04-17
 */
(function () {
    // 'use strict';

    angular.module('BlurAdmin.pages.customers')
        .controller('customersDetailCtrl', DetailCtrl);

    /** @ngInject */
    function DetailCtrl($stateParams, $state, Restangular, promptService, setting) {
        var vm = this;
        vm.id = $stateParams.id;

        vm.updateDescription = updateDescription;
        function updateDescription(){
            Restangular.one("customers",vm.id).customPUT(vm.customer).then(function(response) {
                promptService.success(setting.saveSuccess);
            }, function(error) {
                promptService.failure(setting.saveError);

            });
        }

        vm.jiaziCombox = [{
                title: "甲子",
                value: '甲子'
            },
            {
                title: "乙丑",
                value: '乙丑'
            },
            {
                title: "丙寅",
                value: '丙寅'
            },
            {
                title: "丁卯",
                value: '丁卯'
            },
            {
                title: "戊辰",
                value: '戊辰'
            },
            {
                title: "己巳",
                value: '己巳'
            },
            {
                title: "庚午",
                value: '庚午'
            },
            {
                title: "辛未",
                value: '辛未'
            },
            {
                title: "壬申",
                value: '壬申'
            },
            {
                title: "癸酉",
                value: '癸酉'
            },
            {
                title: "甲戌",
                value: '甲戌'
            },
            {
                title: "乙亥",
                value: '乙亥'
            },
            {
                title: "丙子",
                value: '丙子'
            },
            {
                title: "丁丑",
                value: '丁丑'
            },
            {
                title: "戊寅",
                value: '戊寅'
            },
            {
                title: "己卯",
                value: '己卯'
            },
            {
                title: "庚辰",
                value: '庚辰'
            },
            {
                title: "辛巳",
                value: '辛巳'
            },
            {
                title: "壬午",
                value: '壬午'
            },
            {
                title: "癸未",
                value: '癸未'
            },
            {
                title: "甲申",
                value: '甲申'
            },
            {
                title: "乙酉",
                value: '乙酉'
            },
            {
                title: "丙戌",
                value: '丙戌'
            },
            {
                title: "丁亥",
                value: '丁亥'
            },
            {
                title: "戊子",
                value: '戊子'
            },
            {
                title: "己丑",
                value: '己丑'
            },
            {
                title: "庚寅",
                value: '庚寅'
            },
            {
                title: "辛卯",
                value: '辛卯'
            },
            {
                title: "壬辰",
                value: '壬辰'
            },
            {
                title: "癸巳",
                value: '癸巳'
            },
            {
                title: "甲午",
                value: '甲午'
            },
            {
                title: "乙未",
                value: '乙未'
            },
            {
                title: "丙申",
                value: '丙申'
            },
            {
                title: "丁酉",
                value: '丁酉'
            },
            {
                title: "戊戌",
                value: '戊戌'
            },
            {
                title: "己亥",
                value: '己亥'
            },
            {
                title: "庚子",
                value: '庚子'
            },
            {
                title: "辛丑",
                value: '辛丑'
            },
            {
                title: "壬寅",
                value: '壬寅'
            },
            {
                title: "癸卯",
                value: '癸卯'
            },
            {
                title: "甲辰",
                value: '甲辰'
            },
            {
                title: "乙巳",
                value: '乙巳'
            },
            {
                title: "丙午",
                value: '丙午'
            },
            {
                title: "丁未",
                value: '丁未'
            },
            {
                title: "戊申",
                value: '戊申'
            },
            {
                title: "己酉",
                value: '己酉'
            },
            {
                title: "庚戌",
                value: '庚戌'
            },
            {
                title: "辛亥",
                value: '辛亥'
            },
            {
                title: "壬子",
                value: '壬子'
            },
            {
                title: "癸丑",
                value: '癸丑'
            },
            {
                title: "甲寅",
                value: '甲寅'
            },
            {
                title: "乙卯",
                value: '乙卯'
            },
            {
                title: "丙辰",
                value: '丙辰'
            },
            {
                title: "丁巳",
                value: '丁巳'
            },
            {
                title: "戊午",
                value: '戊午'
            },
            {
                title: "己未",
                value: '己未'
            },
            {
                title: "庚申",
                value: '庚申'
            },
            {
                title: "辛酉",
                value: '辛酉'
            },
            {
                title: "壬戌",
                value: '壬戌'
            },
            {
                title: "癸亥",
                value: '癸亥'
            }
        ];



        // vm.customer = $stateParams.customer;
        vm.importantInfo = {
            "前后":[
                "命前一辰为命天庭，截命杀",
                "马前一辰为马天庭",
                "太岁后一辰是病符杀",
                "命前两位为丧门","命后两位为吊客","勾绞:前后三位","破煞:前三位,卯前三位是午，所以卯与午破",
                "官符杀:太岁前五辰是(对冲后一辰)",
                ""
            ],

        };

        vm.strBaZi = "甲子 丙寅 丁卯 癸亥";

        //出生年
        vm.birth = "1984-01-01";
        vm.countYear = moment().years();

        //年
        vm.niangan = "";
        vm.nianzhi = "";
        vm.nianzhu = "";
        vm.niannayin = "";

        //月
        vm.yuegan = "";
        vm.yuezhi = "";
        vm.yuezhu = "";
        vm.yuenayin = "";

        //日
        vm.rigan = "";
        vm.rizhi = "";
        vm.rizhu = "";
        vm.rinayin = "";

        //时
        vm.shigan = "";
        vm.shizhi = "";
        vm.shizhu = "";
        vm.shinayin = "";

        //胎
        vm.taigan = "";
        vm.taizhi = "";
        vm.taizhu = "";
        vm.tainayin = "";


        //大运
        vm.dayunSelect = vm.jiaziCombox[0];
        vm.dayungan;
        vm.dayunzhi;
        vm.dayunzhu;
        vm.dayunnayin;

        //流年
        vm.liunianSelect = vm.jiaziCombox[0];
        vm.liuniangan;
        vm.liunianzhi;
        vm.liunianzhu;
        vm.liuniannayin;

        //行年
        vm.xingnianganSelect = vm.jiaziCombox[0];
        vm.xingniangan;
        vm.xingnianzhi;
        vm.xingnianzhu;
        vm.xingniannayin;




        // 性别
        vm.genderList = [{
                title: '男',
                value: '1'
            },
            {
                title: '女',
                value: '2'
            }
        ];




        //阴阳
        var yinyang = ["阴", "阳"];

        //天干
        var tiangan = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];

        //地支
        var dizhi = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];

        //五行
        var wuxing = ["木", "火", "土", "金", "水"];

        var sixtyJiaZi = [
            "甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉",
            "甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未",
            "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳",
            "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅", "癸卯",
            "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑",
            "甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥"
        ];


        //五虎遁
        var wuhudun = {
            "甲": ["丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥", "丙子", "丁丑"],
            "己": ["丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥", "丙子", "丁丑"],

            "乙": ["戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑"],
            "庚": ["戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑"],

            "丙": ["庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑"],
            "辛": ["庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑"],

            "丁": ["壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑"],
            "壬": ["壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑"],

            "戊": ["甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥", "甲子", "乙丑"],
            "癸": ["甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥", "甲子", "乙丑"]
        };

        //60甲子纳音
        var jiazinayin = {
            "甲子": '海中金',
            "乙丑": "海中金",
            "丙寅": "炉中火",
            "丁卯": "炉中火",
            "戊辰": "大林木",
            "己巳": "大林木",
            "庚午": "路旁土",
            "辛未": "路旁土",
            "壬申": "剑锋金",
            "癸酉": "剑锋金",
            "甲戌": "山头火",
            "乙亥": "山头火",
            "丙子": "涧下水",
            "丁丑": "涧下水",
            "戊寅": "城头土",
            "己卯": "城头土",
            "庚辰": "白蜡金",
            "辛巳": "白蜡金",
            "壬午": "杨柳木",
            "癸未": "杨柳木",
            "甲申": "泉中水",
            "乙酉": "泉中水",
            "丙戌": "屋上土",
            "丁亥": "屋上土",
            "戊子": "霹雳火",
            "己丑": "霹雳火",
            "庚寅": "松柏木",
            "辛卯": "松柏木",
            "壬辰": "长流水",
            "癸巳": "长流水",
            "甲午": "沙中金",
            "乙未": "沙中金",
            "丙申": "山下火",
            "丁酉": "山下火",
            "戊戌": "平地木",
            "己亥": "平地木",
            "庚子": "壁上土",
            "辛丑": "壁上土",
            "壬寅": "金箔金",
            "癸卯": "金箔金",
            "甲辰": "复灯火",
            "乙巳": "复灯火",
            "丙午": "天河水",
            "丁未": "天河水",
            "戊申": "大驿土",
            "己酉": "大驿土",
            "庚戌": "钗钏金",
            "辛亥": "钗钏金",
            "壬子": "桑拓木",
            "癸丑": "桑拓木",
            "甲寅": "大溪水",
            "乙卯": "大溪水",
            "丙辰": "沙中土",
            "丁巳": "沙中土",
            "戊午": "天上火",
            "己未": "天上火",
            "庚申": "石榴木",
            "辛酉": "石榴木",
            "壬戌": "大海水",
            "癸亥": "大海水"
        };

        //六甲旬
        var liujiaxun = {
            "甲子": '甲子',
            "乙丑": "甲子",
            "丙寅": "甲子",
            "丁卯": "甲子",
            "戊辰": "甲子",
            "己巳": "甲子",
            "庚午": "甲子",
            "辛未": "甲子",
            "壬申": "甲子",
            "癸酉": "甲子",

            "甲戌": "甲戌",
            "乙亥": "甲戌",
            "丙子": "甲戌",
            "丁丑": "甲戌",
            "戊寅": "甲戌",
            "己卯": "甲戌",
            "庚辰": "甲戌",
            "辛巳": "甲戌",
            "壬午": "甲戌",
            "癸未": "甲戌",

            "甲申": "甲申",
            "乙酉": "甲申",
            "丙戌": "甲申",
            "丁亥": "甲申",
            "戊子": "甲申",
            "己丑": "甲申",
            "庚寅": "甲申",
            "辛卯": "甲申",
            "壬辰": "甲申",
            "癸巳": "甲申",

            "甲午": "甲午",
            "乙未": "甲午",
            "丙申": "甲午",
            "丁酉": "甲午",
            "戊戌": "甲午",
            "己亥": "甲午",
            "庚子": "甲午",
            "辛丑": "甲午",
            "壬寅": "甲午",
            "癸卯": "甲午",

            "甲辰": "甲辰",
            "乙巳": "甲辰",
            "丙午": "甲辰",
            "丁未": "甲辰",
            "戊申": "甲辰",
            "己酉": "甲辰",
            "庚戌": "甲辰",
            "辛亥": "甲辰",
            "壬子": "甲辰",
            "癸丑": "甲辰",

            "甲寅": "甲寅",
            "乙卯": "甲寅",
            "丙辰": "甲寅",
            "丁巳": "甲寅",
            "戊午": "甲寅",
            "己未": "甲寅",
            "庚申": "甲寅",
            "辛酉": "甲寅",
            "壬戌": "甲寅",
            "癸亥": "甲寅"
        };


        //【空亡例】
        // 每旬管两空亡，分前后五辰，各有所属。假令甲子旬中无戌亥，自甲子至戊辰，以戌为空亡；自己巳至癸酉，以亥为空
        // 亡，余仿此。（林开五命）
        var liujiaxunkongwang = {
            "甲子": '戌',
            "乙丑": "戌",
            "丙寅": "戌",
            "丁卯": "戌",
            "戊辰": "戌",
            "己巳": "亥",
            "庚午": "亥",
            "辛未": "亥",
            "壬申": "亥",
            "癸酉": "亥",

            "甲戌": "申",
            "乙亥": "申",
            "丙子": "申",
            "丁丑": "申",
            "戊寅": "申",
            "己卯": "酉",
            "庚辰": "酉",
            "辛巳": "酉",
            "壬午": "酉",
            "癸未": "酉",

            "甲申": "午",
            "乙酉": "午",
            "丙戌": "午",
            "丁亥": "午",
            "戊子": "午",
            "己丑": "未",
            "庚寅": "未",
            "辛卯": "未",
            "壬辰": "未",
            "癸巳": "未",

            "甲午": "辰",
            "乙未": "辰",
            "丙申": "辰",
            "丁酉": "辰",
            "戊戌": "辰",
            "己亥": "巳",
            "庚子": "巳",
            "辛丑": "巳",
            "壬寅": "巳",
            "癸卯": "巳",

            "甲辰": "寅",
            "乙巳": "寅",
            "丙午": "寅",
            "丁未": "寅",
            "戊申": "寅",
            "己酉": "卯",
            "庚戌": "卯",
            "辛亥": "卯",
            "壬子": "卯",
            "癸丑": "卯",

            "甲寅": "子",
            "乙卯": "子",
            "丙辰": "子",
            "丁巳": "子",
            "戊午": "子",
            "己未": "丑",
            "庚申": "丑",
            "辛酉": "丑",
            "壬戌": "丑",
            "癸亥": "丑"
        };


        function getnayin(jiazi) {
            return jiazinayin[jiazi];
        }

        function getnayinwuxing(jiazi) {
            return jiazinayin[jiazi][2];
        }

        //六十甲子纳金取象-三命通会
        var tonghuinayin ={
            "甲子": ["海中金者，宝藏龙宫，珠孕蛟宝，出现虽假于空冲，成器无借乎火力，故东方朔以蛤蚌\n" +
            "名之，良有理也。妙选有珠藏渊海格，以甲子见癸亥，是不用火；逢空有蚌珠照月格，以甲\n" +
            "子见己未，是欲合化互贵。盖以海金无形，非空冲则不能出现，而乙丑金库，非旺火则不能\n" +
            "陶铸故也。如甲子见戊寅、庚午，是土生金，乙丑见丙寅、丁卯，是火制金。又天干逢三奇，\n" +
            "此等格局，无有不贵。 ",""],
            "乙丑": ["海中金者，宝藏龙宫，珠孕蛟宝，出现虽假于空冲，成器无借乎火力，故东方朔以蛤蚌\n" +
            "名之，良有理也。妙选有珠藏渊海格，以甲子见癸亥，是不用火；逢空有蚌珠照月格，以甲\n" +
            "子见己未，是欲合化互贵。盖以海金无形，非空冲则不能出现，而乙丑金库，非旺火则不能\n" +
            "陶铸故也。如甲子见戊寅、庚午，是土生金，乙丑见丙寅、丁卯，是火制金。又天干逢三奇，\n" +
            "此等格局，无有不贵。 ",""],
            "壬寅": ["金泊金者，润色杯盘，增光宫室，打薄须借乎别金，描彩必假乎水力。此金甚微，非木\n" +
            "则无所依。以平地为上，有此不宜见火，有火主夭。遇太阳为日间之显，二火相反，不宜同\n" +
            "见。山下、山头，有清水助之，亦吉。惟忌炉火，就位相克。此金体薄，不能反源定夭，限\n" +
            "运同论。井泉、涧下、天河水清，日时喜见，须月令有木，方吉；溪流、大海水浊，见溪流\n" +
            "主漂荡，见大海无木为基，主凶残。金遇剑锋、钗钏，可以装饰，有辅成造化之理，故喜见；\n" +
            "砂海、白蜡无益，有火济之，亦吉，无则终凶。城头、壁上二土有靠安身，城头多主寄人，\n" +
            "壁上加木则贵，再遇灯火辉光照耀，主权贵。丙戊土中藏火，干支却不宜太炎，亦为贵格，\n" +
            "考妙选。金命而遇戊寅，昆山片玉格也；癸卯而遇己卯，玉兔东升格也，与前海金同。",""],
            "癸卯": ["金泊金者，润色杯盘，增光宫室，打薄须借乎别金，描彩必假乎水力。此金甚微，非木\n" +
            "则无所依。以平地为上，有此不宜见火，有火主夭。遇太阳为日间之显，二火相反，不宜同\n" +
            "见。山下、山头，有清水助之，亦吉。惟忌炉火，就位相克。此金体薄，不能反源定夭，限\n" +
            "运同论。井泉、涧下、天河水清，日时喜见，须月令有木，方吉；溪流、大海水浊，见溪流\n" +
            "主漂荡，见大海无木为基，主凶残。金遇剑锋、钗钏，可以装饰，有辅成造化之理，故喜见；\n" +
            "砂海、白蜡无益，有火济之，亦吉，无则终凶。城头、壁上二土有靠安身，城头多主寄人，\n" +
            "壁上加木则贵，再遇灯火辉光照耀，主权贵。丙戊土中藏火，干支却不宜太炎，亦为贵格，\n" +
            "考妙选。金命而遇戊寅，昆山片玉格也；癸卯而遇己卯，玉兔东升格也，与前海金同。",""],
            "庚辰": ["白蜡金者，昆山片玉，洛浦遗金，交栖日月之光，凝聚阴阳之气，形明体洁，乃金之正\n" +
            "色也。此金惟喜火炼，须炉中炎火。然庚辰见之，若无水济，主贫夭，辛巳却以贵论，缘巳\n" +
            "是金生之地，见丙寅化水逢贵故也；山下火生早，主荣贵，亦须水助方得。井泉、大溪俱为\n" +
            "贵格。庚官在丁，辛官在丙，故庚见丁丑，官贵俱全；辛见丙子，不如癸巳更清，不贵即富。\n" +
            "论中见木，逢多无益，以此金不能相克。若柱遇无气之火，却要木生，有禄马贵人方吉。见\n" +
            "土只宜磨砌，方成器物，则吉，别土无用。金忌海砂，为汨没，日时逢火则荣。若见清金，\n" +
            "加水相助，火亦不爱，只怕冲刑。妙选有哨风猛虎格，以此金日时遇辛巳或乙巳是也。 ",""],
            "辛巳": ["白蜡金者，昆山片玉，洛浦遗金，交栖日月之光，凝聚阴阳之气，形明体洁，乃金之正\n" +
            "色也。此金惟喜火炼，须炉中炎火。然庚辰见之，若无水济，主贫夭，辛巳却以贵论，缘巳\n" +
            "是金生之地，见丙寅化水逢贵故也；山下火生早，主荣贵，亦须水助方得。井泉、大溪俱为\n" +
            "贵格。庚官在丁，辛官在丙，故庚见丁丑，官贵俱全；辛见丙子，不如癸巳更清，不贵即富。\n" +
            "论中见木，逢多无益，以此金不能相克。若柱遇无气之火，却要木生，有禄马贵人方吉。见\n" +
            "土只宜磨砌，方成器物，则吉，别土无用。金忌海砂，为汨没，日时逢火则荣。若见清金，\n" +
            "加水相助，火亦不爱，只怕冲刑。妙选有哨风猛虎格，以此金日时遇辛巳或乙巳是也。 ",""],
            "甲午": ["砂中金者，刚形布地，宝质藏砂，直教陶洗为珍，必须因人始贵。此金非炉火则不能制，\n" +
            "但甲午见丙寅，寅中火生，寅午合局，柱无长生之土则燥，更值木助。主疾夭；丙午纳音虽\n" +
            "水，而支干纯火，加逢尤凶。山头、山下、覆灯三火既有木生，克制此金，又须清水济之，\n" +
            "决主少年荣贵。戊子、己丑龙火相逢，子午有交媾之妙，甲己有合化之理，主贵，杂以凡火\n" +
            "则不为奇。水惟宜井泉、涧下、天河，清静则吉；长流、大海，动而不静，并见则金泛不安；\n" +
            "海水尤忌，见木有何关系？火衰却喜生扶，更有禄马贵人互换朝拱为上，如柱无火，逢一二\n" +
            "木则危。若甲午见己巳，是谓采精金于黄碛，乃贵格也；金生于砂，得造化则吉，若更逢砂\n" +
            "土，反有埋没之忧；路旁、大驿亦有所忌，有火庶几；城头戊寅，乙未喜见，谓之采精金于\n" +
            "青沙，乃贵格也。唯丙戌之土中藏火库，乃喜见之金，为同类最喜，清气为上。海中，白蜡\n" +
            "有火制亦得。 ",""],
            "乙未": ["砂中金者，刚形布地，宝质藏砂，直教陶洗为珍，必须因人始贵。此金非炉火则不能制，\n" +
            "但甲午见丙寅，寅中火生，寅午合局，柱无长生之土则燥，更值木助。主疾夭；丙午纳音虽\n" +
            "水，而支干纯火，加逢尤凶。山头、山下、覆灯三火既有木生，克制此金，又须清水济之，\n" +
            "决主少年荣贵。戊子、己丑龙火相逢，子午有交媾之妙，甲己有合化之理，主贵，杂以凡火\n" +
            "则不为奇。水惟宜井泉、涧下、天河，清静则吉；长流、大海，动而不静，并见则金泛不安；\n" +
            "海水尤忌，见木有何关系？火衰却喜生扶，更有禄马贵人互换朝拱为上，如柱无火，逢一二\n" +
            "木则危。若甲午见己巳，是谓采精金于黄碛，乃贵格也；金生于砂，得造化则吉，若更逢砂\n" +
            "土，反有埋没之忧；路旁、大驿亦有所忌，有火庶几；城头戊寅，乙未喜见，谓之采精金于\n" +
            "青沙，乃贵格也。唯丙戌之土中藏火库，乃喜见之金，为同类最喜，清气为上。海中，白蜡\n" +
            "有火制亦得。 ",""],
            "壬申": ["剑锋金者，白帝司权，刚由百炼，红光射于斗牛，白刃凝于霜雪。此金造化，非水不能\n" +
            "生，大溪、海水，日时相逢为上格；井泉、涧下，有霹雳助或得乙卯之雷方好，若无雷雳，\n" +
            "亦金白水清格也。秋生更吉，日时遇长流在壬辰，为宝剑化为青龙，癸巳亦得。此剑不能通\n" +
            "变。然癸丑为剑气冲头，最吉。松柏、杨柳亦吉，但多聚散；大林、平地嫌有土制，主劳苦。\n" +
            "火见神龙，阴阳交遇，如壬申逢己丑、癸酉逢戊子，方为上格。遇天上、炉中二火，无水救\n" +
            "则夭。诸土见皆不吉，以其埋没，只壁上、城头有磨锋淬砺之用，此二土则可。金喜同类，\n" +
            "如壬申见壬申，癸酉见癸酉，有木制之，是谓盘根错节，所以别利器也。无木主带疾。大抵\n" +
            "剑锋乃金之最利者，只宜水，不宜火刑，如见寅巳三刑，全者大凶。 ",""],
            "癸酉": ["剑锋金者，白帝司权，刚由百炼，红光射于斗牛，白刃凝于霜雪。此金造化，非水不能\n" +
            "生，大溪、海水，日时相逢为上格；井泉、涧下，有霹雳助或得乙卯之雷方好，若无雷雳，\n" +
            "亦金白水清格也。秋生更吉，日时遇长流在壬辰，为宝剑化为青龙，癸巳亦得。此剑不能通\n" +
            "变。然癸丑为剑气冲头，最吉。松柏、杨柳亦吉，但多聚散；大林、平地嫌有土制，主劳苦。\n" +
            "火见神龙，阴阳交遇，如壬申逢己丑、癸酉逢戊子，方为上格。遇天上、炉中二火，无水救\n" +
            "则夭。诸土见皆不吉，以其埋没，只壁上、城头有磨锋淬砺之用，此二土则可。金喜同类，\n" +
            "如壬申见壬申，癸酉见癸酉，有木制之，是谓盘根错节，所以别利器也。无木主带疾。大抵\n" +
            "剑锋乃金之最利者，只宜水，不宜火刑，如见寅巳三刑，全者大凶。 ",""],
            "庚戌": ["钗钏金者，美容首饰，增光腻肌，偎红倚翠之珍，枕玉眠香之宝，此金藏之闺阁，唯宜\n" +
            "静水，井涧、溪流，见之皆吉，多见则泛，海水贫夭；天河辛亥见之无妨，丙午真火，庚戌\n" +
            "所忌，以午戌凑成火局，有伤此金故也。太阳火日生显耀，覆灯火夜间显耀，故皆宜见，但\n" +
            "甲辰乙巳与庚戌辛亥相冲，阴阳交见为妙，戊子己丑与丙午丁未相持，二火忌叠，见之非贫\n" +
            "即夭。炉中火庚戌最忌，辛亥见之，丙辛化水，稍吉。山下、山头俱不宜见。若有水济，亦\n" +
            "可。柱中有水，此金入于匣中，有福贵方吉。土见砂中，相生相养，更有涧下水助，荣华富贵",""],
            "辛亥": ["钗钏金者，美容首饰，增光腻肌，偎红倚翠之珍，枕玉眠香之宝，此金藏之闺阁，唯宜\n" +
            "静水，井涧、溪流，见之皆吉，多见则泛，海水贫夭；天河辛亥见之无妨，丙午真火，庚戌\n" +
            "所忌，以午戌凑成火局，有伤此金故也。太阳火日生显耀，覆灯火夜间显耀，故皆宜见，但\n" +
            "甲辰乙巳与庚戌辛亥相冲，阴阳交见为妙，戊子己丑与丙午丁未相持，二火忌叠，见之非贫\n" +
            "即夭。炉中火庚戌最忌，辛亥见之，丙辛化水，稍吉。山下、山头俱不宜见。若有水济，亦\n" +
            "可。柱中有水，此金入于匣中，有福贵方吉。土见砂中，相生相养，更有涧下水助，荣华富贵",""],
            "戊子": ["霹雳火者，一缕毫光，九天号令，电掣金蛇之势，云驱铁马之奔。此火须资风水雷方为\n" +
            "变化，若五行得值一件，皆主亨通。如日时见大海，癸亥为引凡入圣，己丑为上，戊子次之；\n" +
            "见大溪，乙卯为雷火变化，己丑为吉，戊子忌之；辰巳为风运中，遇之尤佳；天上水名为既\n" +
            "济，主吉，遇之者禀性含灵，聪明特异，长流无用，涧下虽就位相克，此神火也，不忌，有\n" +
            "风亦显。五行见木，辛卯有雷，大林有风，平地有天门，与此火相资，余木无用。土见路旁，\n" +
            "加巽则吉，砂中，丁巳有风，己卯有雷，得泉助之，亦主贵显。剑金加水，海金遇风，蜡金\n" +
            "逢涧，皆吉，余金无用。见炉中丁卯为吉，戊子逢丙寅，太燥性凶，主夭。己丑见丙申却得，\n" +
            "戊子忌之；灯火，东南巽地，有风最宜；戊午己未天上火，日时遇之，防刑克。再考妙选，\n" +
            "有烈风雷雨格，即霹雳见天河是也，有天地中分格，即戊子见戊午是也，有雷霆得门格，即\n" +
            "戊子己丑日时遇卯是也。 ",""],
            "己丑": ["霹雳火者，一缕毫光，九天号令，电掣金蛇之势，云驱铁马之奔。此火须资风水雷方为\n" +
            "变化，若五行得值一件，皆主亨通。如日时见大海，癸亥为引凡入圣，己丑为上，戊子次之；\n" +
            "见大溪，乙卯为雷火变化，己丑为吉，戊子忌之；辰巳为风运中，遇之尤佳；天上水名为既\n" +
            "济，主吉，遇之者禀性含灵，聪明特异，长流无用，涧下虽就位相克，此神火也，不忌，有\n" +
            "风亦显。五行见木，辛卯有雷，大林有风，平地有天门，与此火相资，余木无用。土见路旁，\n" +
            "加巽则吉，砂中，丁巳有风，己卯有雷，得泉助之，亦主贵显。剑金加水，海金遇风，蜡金\n" +
            "逢涧，皆吉，余金无用。见炉中丁卯为吉，戊子逢丙寅，太燥性凶，主夭。己丑见丙申却得，\n" +
            "戊子忌之；灯火，东南巽地，有风最宜；戊午己未天上火，日时遇之，防刑克。再考妙选，\n" +
            "有烈风雷雨格，即霹雳见天河是也，有天地中分格，即戊子见戊午是也，有雷霆得门格，即\n" +
            "戊子己丑日时遇卯是也。 ",""],
            "丙寅": ["炉中火者，天地为炉，阴阳为炭，腾光辉于宇宙，成陶冶于乾坤。此火炎上，喜得木生，\n" +
            "惟平地之木为上，以丙寅见已亥，谓之天乙贵，见戊戌，谓之归库，故吉，丁卯次之。然丙\n" +
            "寅火自生，无木庶几，丁卯火自败，若无木则凶，且此火以金为用，更得金来，方应化机，\n" +
            "但丁卯无木而更遇金，主劳苦之命。夫寅见木多火，炎而无水制，主夭，卯见三、四木不妨，\n" +
            "如庚寅辛卯就位相生，壬午癸未化为真火，寅见之多主凶暴或疾夭。若天地原有水制，亦主\n" +
            "中寿，丁卯无妨。此火虽喜得金为财，内剑金寅见之稍可，丁卯火既自败，又到申酉而死绝，\n" +
            "如何能克！非贫即夭。海中、砂蜡诸金，须资木生，方喜见之，钗泊无用。见土须先有金与\n" +
            "木，却喜土以宿之，不至太燥。如城头、屋壁皆成器之土，方好见水，命中先爱木，不然火\n" +
            "多喜逢之。天上清水，寅命遇之为吉，卯中无木则嫌；大海，丙寅见壬戌为福库，见癸亥为\n" +
            "官星，带合半凶半吉；井涧、溪流皆凶，有木不在此论。火见同类，若日月上衰败则吉；霹\n" +
            "雳火本自无益，若得木生，更日时有海水则宜，无木遇水，凶；天上火须有屋土遮之，灯火\n" +
            "巽风，又为鼓舞，亡神须兼造化，断如丙寅、丁酉、已酉、丙寅火为无气，不失大贵，如丙\n" +
            "寅、甲午、己已、丙寅则漂泛不安。 ",""],
            "丁卯": ["炉中火者，天地为炉，阴阳为炭，腾光辉于宇宙，成陶冶于乾坤。此火炎上，喜得木生，\n" +
            "惟平地之木为上，以丙寅见已亥，谓之天乙贵，见戊戌，谓之归库，故吉，丁卯次之。然丙\n" +
            "寅火自生，无木庶几，丁卯火自败，若无木则凶，且此火以金为用，更得金来，方应化机，\n" +
            "但丁卯无木而更遇金，主劳苦之命。夫寅见木多火，炎而无水制，主夭，卯见三、四木不妨，\n" +
            "如庚寅辛卯就位相生，壬午癸未化为真火，寅见之多主凶暴或疾夭。若天地原有水制，亦主\n" +
            "中寿，丁卯无妨。此火虽喜得金为财，内剑金寅见之稍可，丁卯火既自败，又到申酉而死绝，\n" +
            "如何能克！非贫即夭。海中、砂蜡诸金，须资木生，方喜见之，钗泊无用。见土须先有金与\n" +
            "木，却喜土以宿之，不至太燥。如城头、屋壁皆成器之土，方好见水，命中先爱木，不然火\n" +
            "多喜逢之。天上清水，寅命遇之为吉，卯中无木则嫌；大海，丙寅见壬戌为福库，见癸亥为\n" +
            "官星，带合半凶半吉；井涧、溪流皆凶，有木不在此论。火见同类，若日月上衰败则吉；霹\n" +
            "雳火本自无益，若得木生，更日时有海水则宜，无木遇水，凶；天上火须有屋土遮之，灯火\n" +
            "巽风，又为鼓舞，亡神须兼造化，断如丙寅、丁酉、已酉、丙寅火为无气，不失大贵，如丙\n" +
            "寅、甲午、己已、丙寅则漂泛不安。 ",""],
            "甲辰": ["覆灯火者，金盏光，玉台吐艳，照日月不照之处，明天地未明之时。此火乃人间夜明之\n" +
            "火，以木为心，以水为油，遇阴则吉，遇阳则不利。凡日时最忌再见辰已，地支有冲，恐风\n" +
            "吹灯灭，主夭。或以戌亥，子丑为阴，或以自未至亥为阴。五行见木为根本，凡木皆好，更\n" +
            "得官星、禄贵相扶，干头化水，尤吉；限运遇相助，主大贵。水以井泉、涧下为真油，长流\n" +
            "假油，妙选有暗灯添油格，即此理也；大海、河水则不可以为油，遇者主寻常。大凡此火，\n" +
            "见水须资木，不喜长生旺气，水太泛，反凶。命值泊金照耀，最为清贵，亦须水木相资，方\n" +
            "能显达；砂中、钗钏二金皆吉；剑锋一金，谓之灯花拂剑，尤吉；蜡金不宜。五行见土，须\n" +
            "防克破。若壁土可以安身，屋土可以覆庇，日时并见，主福贵，砂土有木，亦主衣食，余土\n" +
            "无用。火爱同类，却怕风吹。霹雳为龙神变化之火，必带风来，此火难存；天上、炉中二火\n" +
            "相见，最凶。再考妙选，有魁星格、指南格，以甲辰生人，日时遇午未为是；有火土入堂格，\n" +
            "以此火怕风，日时遇丙戌丁亥屋上土，则灯在屋中，更得添油，尤贵。 ",""],
            "乙已": ["覆灯火者，金盏光，玉台吐艳，照日月不照之处，明天地未明之时。此火乃人间夜明之\n" +
            "火，以木为心，以水为油，遇阴则吉，遇阳则不利。凡日时最忌再见辰已，地支有冲，恐风\n" +
            "吹灯灭，主夭。或以戌亥，子丑为阴，或以自未至亥为阴。五行见木为根本，凡木皆好，更\n" +
            "得官星、禄贵相扶，干头化水，尤吉；限运遇相助，主大贵。水以井泉、涧下为真油，长流\n" +
            "假油，妙选有暗灯添油格，即此理也；大海、河水则不可以为油，遇者主寻常。大凡此火，\n" +
            "见水须资木，不喜长生旺气，水太泛，反凶。命值泊金照耀，最为清贵，亦须水木相资，方\n" +
            "能显达；砂中、钗钏二金皆吉；剑锋一金，谓之灯花拂剑，尤吉；蜡金不宜。五行见土，须\n" +
            "防克破。若壁土可以安身，屋土可以覆庇，日时并见，主福贵，砂土有木，亦主衣食，余土\n" +
            "无用。火爱同类，却怕风吹。霹雳为龙神变化之火，必带风来，此火难存；天上、炉中二火\n" +
            "相见，最凶。再考妙选，有魁星格、指南格，以甲辰生人，日时遇午未为是；有火土入堂格，\n" +
            "以此火怕风，日时遇丙戌丁亥屋上土，则灯在屋中，更得添油，尤贵。 ",""],
            "戊午": ["天上火者，温暖山海，辉光宇宙，阳德丽天之照，阴精离海之明，戊午为太阳则刚，己\n" +
            "未为太阴则柔，或以为夏日则刚，冬日则温，诬也。俱要戌亥为天门，卯酉为出入之门，东\n" +
            "南为行陆之地则吉。此火见木谓之震折，要日时有风与水方得。大林木有辰已，松柏、石榴\n" +
            "有卯酉，故惟此三木主贵。午见木多犹可，未三、四木，劳苦之命也。见金且能照耀，不能\n" +
            "克济。钗金有戌亥，泊金有寅卯，主吉；剑金为耀日月之光，必主少年登第；余金则殃。水\n" +
            "宜涧下，须戊午见丁丑，已未见丙子，阴阳交互，方为福贵，柱中更有木滋生，富贵双金；\n" +
            "大溪有乙卯，井泉有已酉，出入得门，皆吉；天河雨露相济，不以就位克论，戌午见丁未，\n" +
            "亦吉，丙午则不明。火爱灯头，再有别火则燥；霹雳带云雨则日月无光，故主昏蒙；炉中午\n" +
            "忌丙寅，以午为刚火，才见丙寅，便为火生之地，若无清水解救，主犯刑凶死，丁卯稍可；\n" +
            "土见砂中，有巽风相假；路旁、城屋皆吉，柱中更有金木相助，尤吉。考妙选，戊午遇卯，" +
            "已未遇酉，为日月分秀格，而卯以乙卯、辛卯为正，已卯、丁卯次之，酉以乙酉、癸酉为正，\n" +
            "已酉、丁酉次之；有日出扶桑格，即日分秀，再见已午日时；有日轮当表格，以戊午生于午，\n" +
            "日逢已午日，又以戊午见戊子为坎离正位；有月生沧海格，即月分秀，而酉得乙癸是也；有\n" +
            "月照寒潭格，是取壬癸亥子，纳音属水为潭，然必秋生为贵；有月桂芬芳格，是已未生人，\n" +
            "柱有三、四木拱集，与桂林一枝，同桂林以少为贵，芬芳以多为贵，义各有所取也。再考凶\n" +
            "格中，太阳损明，戊午不禁于水溢，是嫌水盛；太阴薄食，已未岂堪于土多？是嫌土重也。\n" +
            "须如是并参，方尽其理。 ",""],
            "己未":  ["天上火者，温暖山海，辉光宇宙，阳德丽天之照，阴精离海之明，戊午为太阳则刚，己\n" +
            "未为太阴则柔，或以为夏日则刚，冬日则温，诬也。俱要戌亥为天门，卯酉为出入之门，东\n" +
            "南为行陆之地则吉。此火见木谓之震折，要日时有风与水方得。大林木有辰已，松柏、石榴\n" +
            "有卯酉，故惟此三木主贵。午见木多犹可，未三、四木，劳苦之命也。见金且能照耀，不能\n" +
            "克济。钗金有戌亥，泊金有寅卯，主吉；剑金为耀日月之光，必主少年登第；余金则殃。水\n" +
            "宜涧下，须戊午见丁丑，已未见丙子，阴阳交互，方为福贵，柱中更有木滋生，富贵双金；\n" +
            "大溪有乙卯，井泉有已酉，出入得门，皆吉；天河雨露相济，不以就位克论，戌午见丁未，\n" +
            "亦吉，丙午则不明。火爱灯头，再有别火则燥；霹雳带云雨则日月无光，故主昏蒙；炉中午\n" +
            "忌丙寅，以午为刚火，才见丙寅，便为火生之地，若无清水解救，主犯刑凶死，丁卯稍可；\n" +
            "土见砂中，有巽风相假；路旁、城屋皆吉，柱中更有金木相助，尤吉。考妙选，戊午遇卯，" +
            "已未遇酉，为日月分秀格，而卯以乙卯、辛卯为正，已卯、丁卯次之，酉以乙酉、癸酉为正，\n" +
            "已酉、丁酉次之；有日出扶桑格，即日分秀，再见已午日时；有日轮当表格，以戊午生于午，\n" +
            "日逢已午日，又以戊午见戊子为坎离正位；有月生沧海格，即月分秀，而酉得乙癸是也；有\n" +
            "月照寒潭格，是取壬癸亥子，纳音属水为潭，然必秋生为贵；有月桂芬芳格，是已未生人，\n" +
            "柱有三、四木拱集，与桂林一枝，同桂林以少为贵，芬芳以多为贵，义各有所取也。再考凶\n" +
            "格中，太阳损明，戊午不禁于水溢，是嫌水盛；太阴薄食，已未岂堪于土多？是嫌土重也。\n" +
            "须如是并参，方尽其理。 ",""],
            "丙申": ["山下火者，草间熠耀，花理荧煌，寒林缀叶之光，隔幔点衣之彩，方朔以荧火名之，故\n" +
            "妙选有荧火照水格，遇秋生则贵，为卿监，是以此火喜水，地支逢亥子，或纳音水更逢申酉\n" +
            "月是也。或以山下之火最喜木与山，更得风来增辉为贵，又不以荧火论矣。大林木有辰已为\n" +
            "风，桑柘木有癸丑为山，松柏平地最吉，更得风助，主贵，若风多吹散，主夭。水爱井泉、\n" +
            "涧下，有木相资，主爵位崇显，大海水不宜，然有山亦应贵格。寅卯为东方木旺火生之地，\n" +
            "只甲寅水吉，乙卯为震，有风，见之不佳。若无火无山，更加霹火，主夭。天上水为骤雨，\n" +
            "此火不宜相见，若先得山水滋助，亦无大害。命里有金，以清秀为吉，无木多逢，以窃气论\n" +
            "之。乙丑为山，主贵；余金若无克破，遇贵人禄马，只以财论。土见砂中，辰已有风，若有\n" +
            "木有山加助，主大贵，无则虚名。火忌太阳，霹雳、灯头，是巽主光显大都。五行有火，须\n" +
            "资木则吉，限数喜忌，俱依此断。 ",""],
            "丁酉": ["山下火者，草间熠耀，花理荧煌，寒林缀叶之光，隔幔点衣之彩，方朔以荧火名之，故\n" +
            "妙选有荧火照水格，遇秋生则贵，为卿监，是以此火喜水，地支逢亥子，或纳音水更逢申酉\n" +
            "月是也。或以山下之火最喜木与山，更得风来增辉为贵，又不以荧火论矣。大林木有辰已为\n" +
            "风，桑柘木有癸丑为山，松柏平地最吉，更得风助，主贵，若风多吹散，主夭。水爱井泉、\n" +
            "涧下，有木相资，主爵位崇显，大海水不宜，然有山亦应贵格。寅卯为东方木旺火生之地，\n" +
            "只甲寅水吉，乙卯为震，有风，见之不佳。若无火无山，更加霹火，主夭。天上水为骤雨，\n" +
            "此火不宜相见，若先得山水滋助，亦无大害。命里有金，以清秀为吉，无木多逢，以窃气论\n" +
            "之。乙丑为山，主贵；余金若无克破，遇贵人禄马，只以财论。土见砂中，辰已有风，若有\n" +
            "木有山加助，主大贵，无则虚名。火忌太阳，霹雳、灯头，是巽主光显大都。五行有火，须\n" +
            "资木则吉，限数喜忌，俱依此断。 ",""],
            "甲戌": ["山头火者，野焚燎原，延烧极目，依稀天际斜晖，仿佛山头落日，此乃九月烧荒，衰草\n" +
            "尽烬之火也。大概宜山木与风木，喜大林、松柏，以辰已有风，寅卯归禄，更得癸丑为山上\n" +
            "木，主贵。无山则木无所依，火无所见，纵有风亦不光显，余木无用，只以禄马看。水宜涧\n" +
            "下，多为交泰，主吉，井泉清水，有木助之，亦吉；大溪，甲戌见甲寅，乙亥见乙卯，却真\n" +
            "禄俱吉；天上须有雨露，而火到午未得地，再得清水济之，不至于燥，主福，不然则夭；大\n" +
            "海就位相克，最凶，有山逢之，稍得。日时见金为财，须有山木助之则吉，无则凶。见土惟\n" +
            "砂中有巽，能扬此火，别土无益。大凡此火无木见害，多是下贱之命。见火炉中太炎，霹火\n" +
            "凶害，太阳昏蒙，山下战刑，皆所不宜，命带二、三火，如限数逢木，主祸生不测，或夭，\n" +
            "大都此火大怕刑冲。 ",""],
            "乙亥": ["山头火者，野焚燎原，延烧极目，依稀天际斜晖，仿佛山头落日，此乃九月烧荒，衰草\n" +
            "尽烬之火也。大概宜山木与风木，喜大林、松柏，以辰已有风，寅卯归禄，更得癸丑为山上\n" +
            "木，主贵。无山则木无所依，火无所见，纵有风亦不光显，余木无用，只以禄马看。水宜涧\n" +
            "下，多为交泰，主吉，井泉清水，有木助之，亦吉；大溪，甲戌见甲寅，乙亥见乙卯，却真\n" +
            "禄俱吉；天上须有雨露，而火到午未得地，再得清水济之，不至于燥，主福，不然则夭；大\n" +
            "海就位相克，最凶，有山逢之，稍得。日时见金为财，须有山木助之则吉，无则凶。见土惟\n" +
            "砂中有巽，能扬此火，别土无益。大凡此火无木见害，多是下贱之命。见火炉中太炎，霹火\n" +
            "凶害，太阳昏蒙，山下战刑，皆所不宜，命带二、三火，如限数逢木，主祸生不测，或夭，\n" +
            "大都此火大怕刑冲。 ",""],
            "壬子": ["桑柘木者，缯彩基，绮罗根本，士民飘飘之袂，圣贤楚楚之衣，此木供蚕为弧，其用甚大。",
                "最爱【砂土】，以为根基，又以【辰已】为蚕食之地，不宜刑冲互破，【路旁、大驿】二土次吉，余土无益。" ,
                "水喜【天河】，为雨露之滋，长流、溪涧、井泉诸水皆可相依，亦须先得土为基，更加禄贵为妙，沧海水漂泛无定，无土主夭。",
                "见火【灯头】最吉，亦以辰已之中为蚕位故也；炉中位居寅卯，木之旺地；天上、霹雳二火与此木干支有合化之情，有坎离交媾之妙，俱吉，但诸火不宜叠见。" ,
                "以金言之，【砂中】第一，【剑锋】能修整此木，为次，钗泊二金须得土为基，如逢冲破，又凶。" ,
                "木喜【庚寅辛卯】，为以弱就强，以小变大，作贵格论，纵无砂土，亦吉；平地、石榴，无土则凶；大林乃东南蚕食之位，有土资生，主大贵；遇杨柳为桑柳成林，亦是贵格，须生春夏方吉。"],
            "癸丑":  ["桑柘木者，缯彩基，绮罗根本，士民飘飘之袂，圣贤楚楚之衣，此木供蚕为弧，其用甚大。",
                "最爱【砂土】，以为根基，又以【辰已】为蚕食之地，不宜刑冲互破，【路旁、大驿】二土次吉，余土无益。" ,
                "水喜【天河】，为雨露之滋，长流、溪涧、井泉诸水皆可相依，亦须先得土为基，更加禄贵为妙，沧海水漂泛无定，无土主夭。",
                "见火【灯头】最吉，亦以辰已之中为蚕位故也；炉中位居寅卯，木之旺地；天上、霹雳二火与此木干支有合化之情，有坎离交媾之妙，俱吉，但诸火不宜叠见。" ,
                "以金言之，【砂中】第一，【剑锋】能修整此木，为次，钗泊二金须得土为基，如逢冲破，又凶。" ,
                "木喜【庚寅辛卯】，为以弱就强，以小变大，作贵格论，纵无砂土，亦吉；平地、石榴，无土则凶；大林乃东南蚕食之位，有土资生，主大贵；遇杨柳为桑柳成林，亦是贵格，须生春夏方吉。"],
            "庚寅": ["松柏木者，泼雪凑霜，参天覆地，风撼笙篁之奏，雨余旌旆之张。此木藏居金下，位列\n" +
            "正东，乃为极旺，最喜山为根基，水为滋润。天河雨露之水可以滋润，涧下丁丑属山，可为\n" +
            "根基，丙子不如大溪有乙卯为雷，可以发荣，却嫌风霹，有损折之凶；大海水有山则吉，癸\n" +
            "亥清静无山，亦吉。若柱有平地，得屋土，则为已成栋梁，无用山水。无此二件，乃山间之\n" +
            "茂木也，须要山水。命中有火，最忌炉中，就位相生，再加风木，灰飞烟灭，五行无水，主\n" +
            "夭折；山头、山下、太阳、覆灯皆不可犯；寅人尤忌戊午、丙寅，以木不南奔，寅午三合火\n" +
            "局故也，辛卯无害；霹火虽可滋生，运加凡火，主凶。土见路旁，似无足贵，若无死木，其\n" +
            "福还真；驿土无山贫夭，更加海水，尤凶。金逢乙丑，为印为山；泊金就位自旺，主吉；剑\n" +
            "锋能削能斫，更得壁土相成，松柏相资，主贵。大林有风，杨柳会火，二木最忌；桑柘癸丑\n" +
            "为山，可以相助；石榴是辛酉金反化死木，有造化，却吉。妙选有苍松冬秀格，" +
            "是以此木生人月日时属三冬为贵；有日合辛卯、日值庚寅二格，虽取戊午已未，生居夏秋，然专论此木\n" +
            "为贵。 ",""],
            "辛卯": ["松柏木者，泼雪凑霜，参天覆地，风撼笙篁之奏，雨余旌旆之张。此木藏居金下，位列\n" +
            "正东，乃为极旺，最喜山为根基，水为滋润。天河雨露之水可以滋润，涧下丁丑属山，可为\n" +
            "根基，丙子不如大溪有乙卯为雷，可以发荣，却嫌风霹，有损折之凶；大海水有山则吉，癸\n" +
            "亥清静无山，亦吉。若柱有平地，得屋土，则为已成栋梁，无用山水。无此二件，乃山间之\n" +
            "茂木也，须要山水。命中有火，最忌炉中，就位相生，再加风木，灰飞烟灭，五行无水，主\n" +
            "夭折；山头、山下、太阳、覆灯皆不可犯；寅人尤忌戊午、丙寅，以木不南奔，寅午三合火\n" +
            "局故也，辛卯无害；霹火虽可滋生，运加凡火，主凶。土见路旁，似无足贵，若无死木，其\n" +
            "福还真；驿土无山贫夭，更加海水，尤凶。金逢乙丑，为印为山；泊金就位自旺，主吉；剑\n" +
            "锋能削能斫，更得壁土相成，松柏相资，主贵。大林有风，杨柳会火，二木最忌；桑柘癸丑\n" +
            "为山，可以相助；石榴是辛酉金反化死木，有造化，却吉。妙选有苍松冬秀格，" +
            "是以此木生人月日时属三冬为贵；有日合辛卯、日值庚寅二格，虽取戊午已未，生居夏秋，然专论此木\n" +
            "为贵。 ",""],
            "戊辰": ["大林木者，枝干撼风，柯条撑月，耸壑昂霄之德，凌云蔽日之功。此木生居东南，春夏\n" +
            "之交，长养成林，金假艮土为源，癸丑为山，三命无破陷，最为福厚权贵，戊辰为上，己巳\n" +
            "次之。土遇路旁，为负载，戊辰见辛未为贵，己巳见庚午为禄，主富；壁、屋二土，再得剑\n" +
            "金，则大林之木取为栋梁，成格最吉，无此乃山间茂林之木也。此木无论死活，皆欲见土，\n" +
            "如己人见甲，虽云化土，然不如辰戌丑未，土局纯金为妙。若此木已死在山之下；见甲戌乙\n" +
            "亥烧之，主凶夭；灯火就位相生，乙巳不如甲辰更吉；霹雳、太阳二火皆能长育运中，遇之\n" +
            "亦吉，然二火嫌并见，持胜须有土为根基方可。水见天河，戊辰见丁未带贵，虽无土与山，\n" +
            "亦主有衣食，即灵槎入天河格也，生秋冬死绝方是；溪、海二水重见，主贫夭，有山稍得。\n" +
            "妙选有苍龙驾海格，是戊辰见癸亥为贵，涧下丁丑最吉，丙子不如。诸金俱不宜见，海中有\n" +
            "乙丑为山，剑锋得屋壁为本，余金无用，逢之主夭贱。木喜桑柘，唯癸丑最妙；平地还须得\n" +
            "路旁土，谓之平林在野；松柏，东方生旺之地，柱有癸丑而得松柏为密荫，最佳。 ",""],
            "己巳": ["大林木者，枝干撼风，柯条撑月，耸壑昂霄之德，凌云蔽日之功。此木生居东南，春夏\n" +
            "之交，长养成林，金假艮土为源，癸丑为山，三命无破陷，最为福厚权贵，戊辰为上，己巳\n" +
            "次之。土遇路旁，为负载，戊辰见辛未为贵，己巳见庚午为禄，主富；壁、屋二土，再得剑\n" +
            "金，则大林之木取为栋梁，成格最吉，无此乃山间茂林之木也。此木无论死活，皆欲见土，\n" +
            "如己人见甲，虽云化土，然不如辰戌丑未，土局纯金为妙。若此木已死在山之下；见甲戌乙\n" +
            "亥烧之，主凶夭；灯火就位相生，乙巳不如甲辰更吉；霹雳、太阳二火皆能长育运中，遇之\n" +
            "亦吉，然二火嫌并见，持胜须有土为根基方可。水见天河，戊辰见丁未带贵，虽无土与山，\n" +
            "亦主有衣食，即灵槎入天河格也，生秋冬死绝方是；溪、海二水重见，主贫夭，有山稍得。\n" +
            "妙选有苍龙驾海格，是戊辰见癸亥为贵，涧下丁丑最吉，丙子不如。诸金俱不宜见，海中有\n" +
            "乙丑为山，剑锋得屋壁为本，余金无用，逢之主夭贱。木喜桑柘，唯癸丑最妙；平地还须得\n" +
            "路旁土，谓之平林在野；松柏，东方生旺之地，柱有癸丑而得松柏为密荫，最佳。 ",""],
            "壬午": ["杨柳木者，隋堤袅娜，汉苑轻盈，万缕不蚕之丝，千条不针之带，午未木之死墓，壬癸\n" +
            "木之滋润。此木根基唯喜砂土，见艮山则依倚摇金，遇寅卯东方得地；辛丑有山，庚子不如；\n" +
            "戊寅虽吉，已卯尤胜；丙辰丁已却嫌戌亥对冲；若见大驿，有丑为山边之驿，稍可，无丑独\n" +
            "见此土，主夭贱；路旁就位，复值死墓，日时遇之，主人卑弱；屋土壬午见丁亥，丁壬合化\n" +
            "则吉，丙戌不如。水见井泉、长流、大溪、涧下皆吉，中间又分合化之位，尤吉。丙午丁未，\n" +
            "丙丁真火，午未亦火，此木至午未死墓，壬午见之，大凶，癸庶几有别，水济之无害；此木\n" +
            "午未已自有火，更见别火，恐引起伤寿，灯头乙已有风木折，主夭；炉中寅卯本位，木旺反\n" +
            "吉；霹火如壬午见己丑，癸未见戊子，阴阳交遇，更有砂土为基，主贵，若子午丑未对冲则\n" +
            "不为吉。金见木无造化，钗钏、金泊却喜成功，海、蜡、剑、砂虽忌见之，其间轻重当以禄\n" +
            "贵德煞，参祥见松柏木，为脱体化神之格也，主贵。桑柘癸丑为山，作倚傍成林，主吉；庚\n" +
            "申辛酉木既死绝，又逢金克，以弱遇小，其人必贱。妙选有花红柳禄格，是以此木遇石榴，\n" +
            "生于春夏，不以贱论；有杨柳拖金格，是以此木生于三春而时得一金，辛亥、甲子、癸卯、\n" +
            "辛已最妙，乃壬癸禄贵之地故也。 ",""],
            "癸未": ["杨柳木者，隋堤袅娜，汉苑轻盈，万缕不蚕之丝，千条不针之带，午未木之死墓，壬癸\n" +
            "木之滋润。此木根基唯喜砂土，见艮山则依倚摇金，遇寅卯东方得地；辛丑有山，庚子不如；\n" +
            "戊寅虽吉，已卯尤胜；丙辰丁已却嫌戌亥对冲；若见大驿，有丑为山边之驿，稍可，无丑独\n" +
            "见此土，主夭贱；路旁就位，复值死墓，日时遇之，主人卑弱；屋土壬午见丁亥，丁壬合化\n" +
            "则吉，丙戌不如。水见井泉、长流、大溪、涧下皆吉，中间又分合化之位，尤吉。丙午丁未，\n" +
            "丙丁真火，午未亦火，此木至午未死墓，壬午见之，大凶，癸庶几有别，水济之无害；此木\n" +
            "午未已自有火，更见别火，恐引起伤寿，灯头乙已有风木折，主夭；炉中寅卯本位，木旺反\n" +
            "吉；霹火如壬午见己丑，癸未见戊子，阴阳交遇，更有砂土为基，主贵，若子午丑未对冲则\n" +
            "不为吉。金见木无造化，钗钏、金泊却喜成功，海、蜡、剑、砂虽忌见之，其间轻重当以禄\n" +
            "贵德煞，参祥见松柏木，为脱体化神之格也，主贵。桑柘癸丑为山，作倚傍成林，主吉；庚\n" +
            "申辛酉木既死绝，又逢金克，以弱遇小，其人必贱。妙选有花红柳禄格，是以此木遇石榴，\n" +
            "生于春夏，不以贱论；有杨柳拖金格，是以此木生于三春而时得一金，辛亥、甲子、癸卯、\n" +
            "辛已最妙，乃壬癸禄贵之地故也。 ",""],
            "庚申": ["石榴木者，性辛如姜，花红似火，数颗枝头，累累多子，房内莹莹，干支纯金而纳音属\n" +
            "木，乃木之变者也。可以移盆内而妆做山，故喜成器之土，以为根基，城头为上，屋上次之，\n" +
            "然必阴阳交见，则丙辛丁庚互官，戊辛已寅互印，主吉；路、壁、驿、砂四土有山助之，亦\n" +
            "吉，若无何用？见金砂中最吉，泊金干支水木而纳音金，榴木干支金而纳音木，皆脱去本性\n" +
            "而互换归旺，以木旺寅卯，金旺申酉，各得其位，谓之功侔造化格，主大贵；海中乙丑为山，\n" +
            "更逢水助则吉，或壁上，城头，亦得剑锋，就位相克，最凶，若先有砂金，能制其毒，亦不\n" +
            "为害。水见天河，雨露相滋，井泉、溪涧，清水浇灌，大海太泛滥，非贫则夭，有艮土稍得。\n" +
            "太阳、霹雳二火虽喜，不宜并见；炉中寅卯旺位，本吉，再加别火则凶。若此木生于五月，\n" +
            "日时止带一火，谓之石榴喷火，主贵。桑柘、大林、杨柳三木皆喜见之，见大林戊辰脱体，\n" +
            "见杨柳花红柳绿，皆主功名；见桑柘癸丑为山，见松柏则强，见平地则大，若无别物夹杂，\n" +
            "则禄绕红围，亦主富贵，如得城土为基，水运为助，享福优游，最为长久。 ",""],
            "辛酉": ["石榴木者，性辛如姜，花红似火，数颗枝头，累累多子，房内莹莹，干支纯金而纳音属\n" +
            "木，乃木之变者也。可以移盆内而妆做山，故喜成器之土，以为根基，城头为上，屋上次之，\n" +
            "然必阴阳交见，则丙辛丁庚互官，戊辛已寅互印，主吉；路、壁、驿、砂四土有山助之，亦\n" +
            "吉，若无何用？见金砂中最吉，泊金干支水木而纳音金，榴木干支金而纳音木，皆脱去本性\n" +
            "而互换归旺，以木旺寅卯，金旺申酉，各得其位，谓之功侔造化格，主大贵；海中乙丑为山，\n" +
            "更逢水助则吉，或壁上，城头，亦得剑锋，就位相克，最凶，若先有砂金，能制其毒，亦不\n" +
            "为害。水见天河，雨露相滋，井泉、溪涧，清水浇灌，大海太泛滥，非贫则夭，有艮土稍得。\n" +
            "太阳、霹雳二火虽喜，不宜并见；炉中寅卯旺位，本吉，再加别火则凶。若此木生于五月，\n" +
            "日时止带一火，谓之石榴喷火，主贵。桑柘、大林、杨柳三木皆喜见之，见大林戊辰脱体，\n" +
            "见杨柳花红柳绿，皆主功名；见桑柘癸丑为山，见松柏则强，见平地则大，若无别物夹杂，\n" +
            "则禄绕红围，亦主富贵，如得城土为基，水运为助，享福优游，最为长久。 ",""],
            "戊戌": ["平地木者，初生萌蘖，始发枝条，唯资雨露之功，不喜雪霜之积，此乃地上之茂材，人\n" +
            "间之屋木。戊戌为栋，已亥为梁，最宜互换见之，须以土为基，土爱路旁，为正格，更逢子\n" +
            "午，尤贵，以子午为天地正柱故也；屋、壁、城头三土以此木相资，中间有升化，尤吉；砂、\n" +
            "驿无用，日时见之，主灾；太阳、霹雳，最为显耀，炉中遇水则福，灯头无风则固，余火无\n" +
            "水则凶；此已成之木，不宜剑金，有木相资则可；泊金增饰光辉，又天干合，地支旺，更有\n" +
            "旁土为基，主大贵。余金无用。水见天河，为润泽，主吉；溪、海无山俱凶；井泉、涧下虽\n" +
            "吉，内甲申合丁丑为山，遇之尤吉。木见大林，有风摇动，主寿促；桑柘癸丑最吉，壬子己\n" +
            "亥人见之为贵，戊戌人不堪；松柏木倚辅平地为栋梁，更有土助，主贵。大抵此木恶金而喜水、土，若生三冬时，得寅卯为寒谷回春，亦贵论也。 ",""],
            "己亥": ["平地木者，初生萌蘖，始发枝条，唯资雨露之功，不喜雪霜之积，此乃地上之茂材，人\n" +
            "间之屋木。戊戌为栋，已亥为梁，最宜互换见之，须以土为基，土爱路旁，为正格，更逢子\n" +
            "午，尤贵，以子午为天地正柱故也；屋、壁、城头三土以此木相资，中间有升化，尤吉；砂、\n" +
            "驿无用，日时见之，主灾；太阳、霹雳，最为显耀，炉中遇水则福，灯头无风则固，余火无\n" +
            "水则凶；此已成之木，不宜剑金，有木相资则可；泊金增饰光辉，又天干合，地支旺，更有\n" +
            "旁土为基，主大贵。余金无用。水见天河，为润泽，主吉；溪、海无山俱凶；井泉、涧下虽\n" +
            "吉，内甲申合丁丑为山，遇之尤吉。木见大林，有风摇动，主寿促；桑柘癸丑最吉，壬子己\n" +
            "亥人见之为贵，戊戌人不堪；松柏木倚辅平地为栋梁，更有土助，主贵。大抵此木恶金而喜水、土，若生三冬时，得寅卯为寒谷回春，亦贵论也。 ",""],
            "庚子": ["壁上土者，恃栋依梁，兴门立户，却暑御寒之德，遮霜护雪之功。此乃人间壁土，非平\n" +
            "地何以为靠？子午，天地正柱，逢之尤为吉庆。凡见木皆可为主。庚寅辛卯亦是栋梁，只申\n" +
            "酉冲破，子卯相刑；大林有风，若无承载之土，加凡火，主作事难成，贫贱而夭。土爱路旁，\n" +
            "谓之负载，屋上、城头可以护身，皆吉。见火全无造化，太阳、霹雳虽云照耀，到底蹇危，\n" +
            "若命先已见木，遇火助，鬼焚克运，再逢之，主祸患夭折，柱有水救济，稍得。水见甲申为\n" +
            "最吉，乙酉次之；天上雨露，亦吉；大海漂泛，此土何安？纵有根基，亦凶。金唯爱泊金，\n" +
            "命里先有木神则贵，以其成宫室而金碧辉煌，非朝廷不敢用也；剑金伤害，余金无用。 ",""],
            "辛丑": ["壁上土者，恃栋依梁，兴门立户，却暑御寒之德，遮霜护雪之功。此乃人间壁土，非平\n" +
            "地何以为靠？子午，天地正柱，逢之尤为吉庆。凡见木皆可为主。庚寅辛卯亦是栋梁，只申\n" +
            "酉冲破，子卯相刑；大林有风，若无承载之土，加凡火，主作事难成，贫贱而夭。土爱路旁，\n" +
            "谓之负载，屋上、城头可以护身，皆吉。见火全无造化，太阳、霹雳虽云照耀，到底蹇危，\n" +
            "若命先已见木，遇火助，鬼焚克运，再逢之，主祸患夭折，柱有水救济，稍得。水见甲申为\n" +
            "最吉，乙酉次之；天上雨露，亦吉；大海漂泛，此土何安？纵有根基，亦凶。金唯爱泊金，\n" +
            "命里先有木神则贵，以其成宫室而金碧辉煌，非朝廷不敢用也；剑金伤害，余金无用。 ",""],
            "戊寅": ["城头土者，天京玉垒，帝里金城，龙盘千里之形，虎踞四维之势。此土有成有未成，作\n" +
            "两般论。凡遇见路旁，为已成之土，不必用火，若无路旁，为未成之土，必须用火；大都城\n" +
            "土皆须资木，杨柳癸未最佳，壬午则忌；桑拓癸丑为上，壬子次之；庚寅辛卯就位相克则城\n" +
            "崩不甯，何以安人也耶？如见木无夹辅，只以贵人禄马论之。见水有山为显贵，甲申、丁丑\n" +
            "俱吉，天河滋助，亦吉，唯忌霹雳、大海，壬戌不忌，合化俱以吉。推土爱路旁，防见诸火，\n" +
            "大驿逢山，须作贵观，若独见无根本，贫夭孤寒。五行见金，只有白蜡，怕巽，二者相妨，\n" +
            "余金无用，亦须以贵人禄马看之。 ",""],
            "已卯": ["城头土者，天京玉垒，帝里金城，龙盘千里之形，虎踞四维之势。此土有成有未成，作\n" +
            "两般论。凡遇见路旁，为已成之土，不必用火，若无路旁，为未成之土，必须用火；大都城\n" +
            "土皆须资木，杨柳癸未最佳，壬午则忌；桑拓癸丑为上，壬子次之；庚寅辛卯就位相克则城\n" +
            "崩不甯，何以安人也耶？如见木无夹辅，只以贵人禄马论之。见水有山为显贵，甲申、丁丑\n" +
            "俱吉，天河滋助，亦吉，唯忌霹雳、大海，壬戌不忌，合化俱以吉。推土爱路旁，防见诸火，\n" +
            "大驿逢山，须作贵观，若独见无根本，贫夭孤寒。五行见金，只有白蜡，怕巽，二者相妨，\n" +
            "余金无用，亦须以贵人禄马看之。 ",""],
            "丙辰": ["砂中土者，浪回所积，波渚而成，龙蛇盘隐之宫，陵谷变迁之地。",
            "此土清秀，唯喜清金养之，更得犯净之土，主早贵；\n" +
            "【钗、砂、剑、泊】此四金清秀相助，如丙人见辛亥为丙丁入于乾户，号曰驾海长虹，又有星拱北之论，皆贵格也，\n" +
            "更得水相涵，尤为上吉，若无水而时日得天上火照，亦可，如丙辰乙未癸酉戊午，此命有二金资养，却全无水，得太阳火照，故贵；\n" +
            "如丁巳癸卯己未壬申，此命二金资养，得天上火照，亦贵。然戊午太燥，己未稍缓，寿夭不同。",
            "水以井涧清洁为吉，若有金以养之，贵；如此土已得金养而日时有海水便坏造化，癸亥\n" +
            "轻清，丙人见之限运，逢亦主显荣，余水无用。" ,
            "火喜太阳，在格号为朱雀腾空，主贵；山头、\n" +
            "山下、炉中，覆灯诸火若无水济，主寿夭。" ,
            "木爰桑拓、杨柳，以此土能载二木故也，余木却以禄马贵人参之，如日中刑破冲克之木，虽见之有何造化？不如无为吉。" ,
            "五行最忌土相刑，路旁安身，有金木资生，亦主福庆；大驿往来，最不宜见，纵有金水亦凶，余土尤不为吉。",""],
            "丁巳": ["砂中土者，浪回所积，波渚而成，龙蛇盘隐之宫，陵谷变迁之地。",
                "此土清秀，唯喜清金养之，更得犯净之土，主早贵；\n" +
                "【钗、砂、剑、泊】此四金清秀相助，如丙人见辛亥为丙丁入于乾户，号曰驾海长虹，又有星拱北之论，皆贵格也，\n" +
                "更得水相涵，尤为上吉，若无水而时日得天上火照，亦可，如丙辰乙未癸酉戊午，此命有二金资养，却全无水，得太阳火照，故贵；\n" +
                "如丁巳癸卯己未壬申，此命二金资养，得天上火照，亦贵。然戊午太燥，己未稍缓，寿夭不同。",
                "水以井涧清洁为吉，若有金以养之，贵；如此土已得金养而日时有海水便坏造化，癸亥\n" +
                "轻清，丙人见之限运，逢亦主显荣，余水无用。" ,
                "火喜太阳，在格号为朱雀腾空，主贵；山头、\n" +
                "山下、炉中，覆灯诸火若无水济，主寿夭。" ,
                "木爰桑拓、杨柳，以此土能载二木故也，余木却以禄马贵人参之，如日中刑破冲克之木，虽见之有何造化？不如无为吉。" ,
                "五行最忌土相刑，路旁安身，有金木资生，亦主福庆；大驿往来，最不宜见，纵有金水亦凶，余土尤不为吉。",""],
            "庚午": ["路旁土者，大地连途，平田万顷，禾稼赖以资生，草木由之畅茂。此乃火暖土温，长养\n" +
            "万物之土也，故须假水为先，乃灌溉滋润之论，次第尤宜水化为妙，更得金来相助，则禾稼\n" +
            "成实。如庚午见甲申，辛未见乙酉为禄，若无冲破，主早贵；天上水雨露相滋，庚午喜见丁\n" +
            "未，辛未喜见丙午，为官贵禄合之妙；涧下庚午见丁丑，贵禄交驰，辛未见丙子，化水逢生；\n" +
            "大溪乙卯为雷，能发生，此土又乙庚合化，故皆主吉；长流、大海二水以其不能浇灌，此土\n" +
            "故最忌之，主凶夭。火逢霹雳，庚午见己丑，贵禄交穿，辛未见戊子，印贵朝阳，皆吉，天\n" +
            "上火就位相生，太燥则土反不能生物，有水润之始得，若独见，主夭；炉中火亦燥，亦主妨\n" +
            "寿；灯头有屋土，方应造化，名超凡入圣，不然亦凶。见木可以发生，然有贵人禄马则吉，\n" +
            "刑煞冲破则凶。只有庚寅木，此土逢之大好，大林不能胜载，如土位见丙辰、丙戊、辛丑、\n" +
            "辛未，皆吉；若庚午见辛未，辛未见庚午，为二仪贵偶，无有不贵。钗钏、砂中二金可以滋\n" +
            "助，清水金水并见，大吉，若命已见水，无金运，遇此金亦福；乙丑海金可为山论，若得天\n" +
            "河清水助之，庚人大好。妙选有金马嘶风格，以庚午、甲午生人得辛巳时；有马化龙驹格，\n" +
            "又以午生人见辰时；有哨风猛虎格，以庚辛生人得辛巳、乙巳。俱以贵论，而水、火、土、\n" +
            "金似不相拘。 ",""],
            "辛未": ["路旁土者，大地连途，平田万顷，禾稼赖以资生，草木由之畅茂。此乃火暖土温，长养\n" +
            "万物之土也，故须假水为先，乃灌溉滋润之论，次第尤宜水化为妙，更得金来相助，则禾稼\n" +
            "成实。如庚午见甲申，辛未见乙酉为禄，若无冲破，主早贵；天上水雨露相滋，庚午喜见丁\n" +
            "未，辛未喜见丙午，为官贵禄合之妙；涧下庚午见丁丑，贵禄交驰，辛未见丙子，化水逢生；\n" +
            "大溪乙卯为雷，能发生，此土又乙庚合化，故皆主吉；长流、大海二水以其不能浇灌，此土\n" +
            "故最忌之，主凶夭。火逢霹雳，庚午见己丑，贵禄交穿，辛未见戊子，印贵朝阳，皆吉，天\n" +
            "上火就位相生，太燥则土反不能生物，有水润之始得，若独见，主夭；炉中火亦燥，亦主妨\n" +
            "寿；灯头有屋土，方应造化，名超凡入圣，不然亦凶。见木可以发生，然有贵人禄马则吉，\n" +
            "刑煞冲破则凶。只有庚寅木，此土逢之大好，大林不能胜载，如土位见丙辰、丙戊、辛丑、\n" +
            "辛未，皆吉；若庚午见辛未，辛未见庚午，为二仪贵偶，无有不贵。钗钏、砂中二金可以滋\n" +
            "助，清水金水并见，大吉，若命已见水，无金运，遇此金亦福；乙丑海金可为山论，若得天\n" +
            "河清水助之，庚人大好。妙选有金马嘶风格，以庚午、甲午生人得辛巳时；有马化龙驹格，\n" +
            "又以午生人见辰时；有哨风猛虎格，以庚辛生人得辛巳、乙巳。俱以贵论，而水、火、土、\n" +
            "金似不相拘。 ",""],
            "戊申": ["大驿土者，堂堂大道，坦坦平途，九州无所不通，万国无所不至，此乃位属坤方，德乃\n" +
            "厚载，轮天转日，负海乘山之土也。发生万物，以木为基。戊申，长生之土，德厚无疆，见\n" +
            "三、四木皆能滋生，己酉，自败之土，木多则窃气；大林合中逢冲，主夭，别木则吉，更以\n" +
            "禄贵参之。井泉、涧下二水清贵不燥，如戊申见丁丑或乙酉，己酉见丙子或甲申，谓之官贵，\n" +
            "主吉；天河丙午而己酉得之，丁未而戊申得之，亦为贵禄，主福；长流戊申见癸巳，己酉见壬辰，亦吉，多逢则不宁静；大溪乙卯为东震发生之义，单见亦吉；海水对穿，土不能胜，\n" +
            "日时遇主夭，得山稍轻，内戊申见癸亥，戊癸合申亥，为地天交泰，反吉。火见太阳、霹雳，\n" +
            "谓之圣火，最能发生，此土如逢水助，主显达，其于凡火，再逢木生之，更燥，主凶夭。五\n" +
            "行见土，唯路旁最宜，屋上、壁上、砂中纵先得木，亦为泯绝，城头有水，稍吉。命若有金，\n" +
            "清秀，吉；钗钏得辛亥，金泊得壬寅，戊申遇之，柱中更加水助，乃地天交泰，水绕山环大\n" +
            "格，主贵，己酉见庚戌、癸卯稍次；砂金造化亦同，剑金须候木得用，不然无益。 ",""],
            "己酉": ["大驿土者，堂堂大道，坦坦平途，九州无所不通，万国无所不至，此乃位属坤方，德乃\n" +
            "厚载，轮天转日，负海乘山之土也。发生万物，以木为基。戊申，长生之土，德厚无疆，见\n" +
            "三、四木皆能滋生，己酉，自败之土，木多则窃气；大林合中逢冲，主夭，别木则吉，更以\n" +
            "禄贵参之。井泉、涧下二水清贵不燥，如戊申见丁丑或乙酉，己酉见丙子或甲申，谓之官贵，\n" +
            "主吉；天河丙午而己酉得之，丁未而戊申得之，亦为贵禄，主福；长流戊申见癸巳，己酉见壬辰，亦吉，多逢则不宁静；大溪乙卯为东震发生之义，单见亦吉；海水对穿，土不能胜，\n" +
            "日时遇主夭，得山稍轻，内戊申见癸亥，戊癸合申亥，为地天交泰，反吉。火见太阳、霹雳，\n" +
            "谓之圣火，最能发生，此土如逢水助，主显达，其于凡火，再逢木生之，更燥，主凶夭。五\n" +
            "行见土，唯路旁最宜，屋上、壁上、砂中纵先得木，亦为泯绝，城头有水，稍吉。命若有金，\n" +
            "清秀，吉；钗钏得辛亥，金泊得壬寅，戊申遇之，柱中更加水助，乃地天交泰，水绕山环大\n" +
            "格，主贵，己酉见庚戌、癸卯稍次；砂金造化亦同，剑金须候木得用，不然无益。 ",""],
            "丙戌": ["屋上土者，埏埴为林，水火既济，盖蔽雪霜之积，震凌风雨之功，此土瓦也。非木无以\n" +
            "架之，故以木为根基，平地为上，大林次之，余取天干化木，亦吉，只怕冲破。此巳城之土，\n" +
            "不宜见火，炉中丙寅最凶，丁卯稍可；太阳、霹雳可取相资；山下、山头，有木生之则祸；\n" +
            "灯头丙戌见乙巳为上，丁亥见甲辰次之，谓之火土入堂格，若柱中木多，亦不为吉。水宜天\n" +
            "河、井泉、涧下，皆吉，如先得平地木成格，大贵；溪流无木多夭，若丙戌而得癸巳，丁亥\n" +
            "而得甲寅，则又别论，再看日时所成造化何如；大海无山则不宜见土。土见路旁，如丙戌得\n" +
            "辛未，丁亥得庚午，阴阳互见，更假木为基，主贵；壁土亦宜；余则汨没。若缺木而三刑聚，\n" +
            "纵是二土亦凶，砂土独丁已不妨。金唯剑锋、钗钏最吉，丁见壬申，天干化木，地支乾坤清\n" +
            "夷，丙见辛亥，天干化水，地支丙入乾户，皆大贵格，若丁亥见庚戌，丙戌见癸酉，则不为\n" +
            "吉；泊金有粉饰之用，亦吉；余金无用，当以贵禄参详。 ",""],
            "丁亥": ["屋上土者，埏埴为林，水火既济，盖蔽雪霜之积，震凌风雨之功，此土瓦也。非木无以\n" +
            "架之，故以木为根基，平地为上，大林次之，余取天干化木，亦吉，只怕冲破。此巳城之土，\n" +
            "不宜见火，炉中丙寅最凶，丁卯稍可；太阳、霹雳可取相资；山下、山头，有木生之则祸；\n" +
            "灯头丙戌见乙巳为上，丁亥见甲辰次之，谓之火土入堂格，若柱中木多，亦不为吉。水宜天\n" +
            "河、井泉、涧下，皆吉，如先得平地木成格，大贵；溪流无木多夭，若丙戌而得癸巳，丁亥\n" +
            "而得甲寅，则又别论，再看日时所成造化何如；大海无山则不宜见土。土见路旁，如丙戌得\n" +
            "辛未，丁亥得庚午，阴阳互见，更假木为基，主贵；壁土亦宜；余则汨没。若缺木而三刑聚，\n" +
            "纵是二土亦凶，砂土独丁已不妨。金唯剑锋、钗钏最吉，丁见壬申，天干化木，地支乾坤清\n" +
            "夷，丙见辛亥，天干化水，地支丙入乾户，皆大贵格，若丁亥见庚戌，丙戌见癸酉，则不为\n" +
            "吉；泊金有粉饰之用，亦吉；余金无用，当以贵禄参详。 ",""],
            "丙子": ["涧下水者，山环细浪，雪涌飞端，相连南北之流，对峙坎离之脉。此水清澄，喜见金养，\n" +
            "砂中、剑锋二金最宜。钗钏庚戌丁丑不宜，以丑戌相刑，辛亥见丙子则丙辛化水，尤贵；余\n" +
            "金以禄贵参之，取其资生，恶其冲破。见木一位不妨，二三则主劳苦，亦以贵人禄马参之。\n" +
            "命中见土，主人多浊天元，若木或化水，则主清吉；砂中、屋上二土，其气稍清，路旁、大\n" +
            "驿则浊甚矣，主财散祸生，如辰、戌、丑、未土局，其凶尤甚，以水浊土浑故也。火见太阳，\n" +
            "虽炎，中间有既济未济之论；霹雳就位相争，最所不宜。若二火拼论，无金资助，主荒淫，\n" +
            "有金别论；山下、山头亦吉，若并临，时日则嫌。命中遇水，反成漂荡，见天河为引凡入圣，\n" +
            "见大海为福贵朝宗，皆吉，独丁丑见壬戌，则丑戌相刑，丁壬淫合，主风声不雅；大溪性急，\n" +
            "长流不静，皆不为吉，大抵此水须以多为主，而无火土夹杂，再得甲寅乙卯之水，则源远流\n" +
            "清，真君子人也。 ",""],
            "丁丑": ["涧下水者，山环细浪，雪涌飞端，相连南北之流，对峙坎离之脉。此水清澄，喜见金养，\n" +
            "砂中、剑锋二金最宜。钗钏庚戌丁丑不宜，以丑戌相刑，辛亥见丙子则丙辛化水，尤贵；余\n" +
            "金以禄贵参之，取其资生，恶其冲破。见木一位不妨，二三则主劳苦，亦以贵人禄马参之。\n" +
            "命中见土，主人多浊天元，若木或化水，则主清吉；砂中、屋上二土，其气稍清，路旁、大\n" +
            "驿则浊甚矣，主财散祸生，如辰、戌、丑、未土局，其凶尤甚，以水浊土浑故也。火见太阳，\n" +
            "虽炎，中间有既济未济之论；霹雳就位相争，最所不宜。若二火拼论，无金资助，主荒淫，\n" +
            "有金别论；山下、山头亦吉，若并临，时日则嫌。命中遇水，反成漂荡，见天河为引凡入圣，\n" +
            "见大海为福贵朝宗，皆吉，独丁丑见壬戌，则丑戌相刑，丁壬淫合，主风声不雅；大溪性急，\n" +
            "长流不静，皆不为吉，大抵此水须以多为主，而无火土夹杂，再得甲寅乙卯之水，则源远流\n" +
            "清，真君子人也。 ",""],
            "甲寅": ["大溪水者，惊涛薄岸，骇浪浮天，光涵万里之宽，碧倒千山之影，最喜有归有养，遇坎\n" +
            "则为有归，得金则为有养，所嫌者，日月时中，有申酉冲动，或辰已风吹，主飘流；井泉水\n" +
            "净而止，涧下有丑为艮，天河沾润，大海朝宗，此四水皆吉；长流有风，独不宜见。此水以\n" +
            "清金为助养，唯钗、砂最宜，蜡金亦清，若有钗金对冲则不宜；海中虽无造化，甲子属坎，\n" +
            "乙丑为艮，乃归源之地，亦吉；泊金最微，不能相生，岂有超显之理？剑金虽化于大溪，却\n" +
            "忌卯雷巽风，主性不定。五行有土，皆为无益，屋上、城头壅阻此水，路旁稍可，亦不为奇；\n" +
            "壁上独辛丑为山，大驿唯己酉有合，戊申则冲，庚子则刑，皆不为吉。火见太阳，虽假照耀，\n" +
            "霹雳尤忌相逢，若二火互见，主贫，单见别论。木见此水，徒被漂荡，唯桑拓木壬子有坎，\n" +
            "癸丑为山，为水绕山环之贵，内甲寅人见壬子吉，乙卯人见癸丑吉；余木以禄贵参之，尤忌\n" +
            "冲破。 ",""],
            "乙卯": ["大溪水者，惊涛薄岸，骇浪浮天，光涵万里之宽，碧倒千山之影，最喜有归有养，遇坎\n" +
            "则为有归，得金则为有养，所嫌者，日月时中，有申酉冲动，或辰已风吹，主飘流；井泉水\n" +
            "净而止，涧下有丑为艮，天河沾润，大海朝宗，此四水皆吉；长流有风，独不宜见。此水以\n" +
            "清金为助养，唯钗、砂最宜，蜡金亦清，若有钗金对冲则不宜；海中虽无造化，甲子属坎，\n" +
            "乙丑为艮，乃归源之地，亦吉；泊金最微，不能相生，岂有超显之理？剑金虽化于大溪，却\n" +
            "忌卯雷巽风，主性不定。五行有土，皆为无益，屋上、城头壅阻此水，路旁稍可，亦不为奇；\n" +
            "壁上独辛丑为山，大驿唯己酉有合，戊申则冲，庚子则刑，皆不为吉。火见太阳，虽假照耀，\n" +
            "霹雳尤忌相逢，若二火互见，主贫，单见别论。木见此水，徒被漂荡，唯桑拓木壬子有坎，\n" +
            "癸丑为山，为水绕山环之贵，内甲寅人见壬子吉，乙卯人见癸丑吉；余木以禄贵参之，尤忌\n" +
            "冲破。 ",""],
            "壬辰": ["长流水者，混混无穷，滔滔不竭，就下必纳于东南，顺流自归于辰巳。此水喜金生养，\n" +
            "金要白蜡、钗钏，以天干有庚辛真金，地支辰巳就位相生，戌亥为归源之地；剑锋纯是金水，\n" +
            "泊金水木居东，皆以吉论；海中，砂中无取。嫌土蹇涸，而土有堤防之用，六土之中，取庚\n" +
            "辛丙丁为吉，戊己无用。遇火则相刑，而有既济之妙，内壬辰喜见丁卯、丁酉，癸巳喜见戊\n" +
            "子、戊午，以天干合化故也；灯头癸巳尤喜见甲辰，山头壬辰尤喜遇乙亥，化龙归禄，取义\n" +
            "更佳。逢木虽漂泛，而桑拓癸丑为山，杨柳癸未为园，年时得此水围之，为水绕花堤，大贵\n" +
            "格也；松柏、石榴，天干有金相生；大林、平地，虽嫌有土，而癸巳见戊辰，壬辰见己亥，\n" +
            "俱吉。水为同类，涧下则丁壬合化，天上则雨露相资；井泉、大溪无益；海乃众流所归，而\n" +
            "壬辰之龙得癸亥则龙跃天门，春夏秋生为吉，或龙潜大海，则冬生乃宜，柱中须先得金为妙。" +
            "又壬辰为自印之水，再见壬辰则刑，刑则自害，见戊戌则冲，冲则泛滥，主凶；癸巳，自绝\n" +
            "之水，名为涸流，若遇丙戌、丁亥、庚子、辛丑之土，其涸可待，柱中如得三合生旺之金生\n" +
            "之则吉。 ",""],
            "癸巳":  ["长流水者，混混无穷，滔滔不竭，就下必纳于东南，顺流自归于辰巳。此水喜金生养，\n" +
            "金要白蜡、钗钏，以天干有庚辛真金，地支辰巳就位相生，戌亥为归源之地；剑锋纯是金水，\n" +
            "泊金水木居东，皆以吉论；海中，砂中无取。嫌土蹇涸，而土有堤防之用，六土之中，取庚\n" +
            "辛丙丁为吉，戊己无用。遇火则相刑，而有既济之妙，内壬辰喜见丁卯、丁酉，癸巳喜见戊\n" +
            "子、戊午，以天干合化故也；灯头癸巳尤喜见甲辰，山头壬辰尤喜遇乙亥，化龙归禄，取义\n" +
            "更佳。逢木虽漂泛，而桑拓癸丑为山，杨柳癸未为园，年时得此水围之，为水绕花堤，大贵\n" +
            "格也；松柏、石榴，天干有金相生；大林、平地，虽嫌有土，而癸巳见戊辰，壬辰见己亥，\n" +
            "俱吉。水为同类，涧下则丁壬合化，天上则雨露相资；井泉、大溪无益；海乃众流所归，而\n" +
            "壬辰之龙得癸亥则龙跃天门，春夏秋生为吉，或龙潜大海，则冬生乃宜，柱中须先得金为妙。" +
            "又壬辰为自印之水，再见壬辰则刑，刑则自害，见戊戌则冲，冲则泛滥，主凶；癸巳，自绝\n" +
            "之水，名为涸流，若遇丙戌、丁亥、庚子、辛丑之土，其涸可待，柱中如得三合生旺之金生\n" +
            "之则吉。 ",""],
            "丙午": ["天河水者，乱洒六野，密沛千郊，淋淋泻下银河，细细飞来碧落，此乃天上雨露，发生\n" +
            "万物，无不赖之。银河之水，土不能克，故见土不忌，而且有滋润之益；天上之水，地金难\n" +
            "生，故见金难益，而亦有涵秀之情；生旺太过则为淫潦，反伤于物，死绝太多则为旱干，又\n" +
            "不能生物，要生三秋得时为贵也。水喜长流、大海，内丙午宜癸巳、癸亥，丁未宜壬辰、壬\n" +
            "戌，阴阳互见，尤吉；大溪乙卯为雷，井泉己酉为贵，俱以吉论。火喜霹雳，为神龙之火，\n" +
            "与此水相济。而倏忽变化，云行雨施，岂有不贵？炉中火旺，大海水旺，如柱中得二火二水，\n" +
            "上下上相济，谓之精神俱足，大贵格也；灯头有风，山头有贵，皆以吉论，又须以别水济之\n" +
            "方吉；天上就位相克，则忌见之。木石榴、杨柳俱吉，大林有巽，平地有亥，亦吉；松柏、\n" +
            "石榴遇丙辛合化，亦以吉论。妙选有灵槎入天河格，是取死绝无根之木，柱无土培则漂流天\n" +
            "河是也。土虽不能克，而柱逢庚午辛未，就位相克，土壅水滞，或水又冬生，则水结池塘，\n" +
            "必主浊滥；余土如砂中、屋上皆吉，城头，大驿无用，壁上对冲，亦坏造化。水、金虽不能\n" +
            "生，独辛亥钗金却属乾天，水在天上，只此最吉；余金亦取天干有庚辛、壬癸者为用，甲乙\n" +
            "无益，再以禄马贵人参之始得。妙选又以水生人得庚子、壬子为云腾雨施，生春则旱，夏则\n" +
            "潦，冬则寒，独三秋最吉；遇甲辰乙巳、庚辰辛巳，柱中有壬为云，有辰为龙，为风雨作霖；\n" +
            "若生冬月，是为霜凝薄露，日时喜遇寅卯温和之气，可解斯冻，俱贵格也。 ",""],
            "丁未": ["天河水者，乱洒六野，密沛千郊，淋淋泻下银河，细细飞来碧落，此乃天上雨露，发生\n" +
            "万物，无不赖之。银河之水，土不能克，故见土不忌，而且有滋润之益；天上之水，地金难\n" +
            "生，故见金难益，而亦有涵秀之情；生旺太过则为淫潦，反伤于物，死绝太多则为旱干，又\n" +
            "不能生物，要生三秋得时为贵也。水喜长流、大海，内丙午宜癸巳、癸亥，丁未宜壬辰、壬\n" +
            "戌，阴阳互见，尤吉；大溪乙卯为雷，井泉己酉为贵，俱以吉论。火喜霹雳，为神龙之火，\n" +
            "与此水相济。而倏忽变化，云行雨施，岂有不贵？炉中火旺，大海水旺，如柱中得二火二水，\n" +
            "上下上相济，谓之精神俱足，大贵格也；灯头有风，山头有贵，皆以吉论，又须以别水济之\n" +
            "方吉；天上就位相克，则忌见之。木石榴、杨柳俱吉，大林有巽，平地有亥，亦吉；松柏、\n" +
            "石榴遇丙辛合化，亦以吉论。妙选有灵槎入天河格，是取死绝无根之木，柱无土培则漂流天\n" +
            "河是也。土虽不能克，而柱逢庚午辛未，就位相克，土壅水滞，或水又冬生，则水结池塘，\n" +
            "必主浊滥；余土如砂中、屋上皆吉，城头，大驿无用，壁上对冲，亦坏造化。水、金虽不能\n" +
            "生，独辛亥钗金却属乾天，水在天上，只此最吉；余金亦取天干有庚辛、壬癸者为用，甲乙\n" +
            "无益，再以禄马贵人参之始得。妙选又以水生人得庚子、壬子为云腾雨施，生春则旱，夏则\n" +
            "潦，冬则寒，独三秋最吉；遇甲辰乙巳、庚辰辛巳，柱中有壬为云，有辰为龙，为风雨作霖；\n" +
            "若生冬月，是为霜凝薄露，日时喜遇寅卯温和之气，可解斯冻，俱贵格也。 ",""],
            "甲申": ["井泉水者，寒泉清冽，取养不穷，八家凿之以同饮，万民资之以生活。此水生于金而出\n" +
            "于木，故喜见金为福，砂中有土，性与之最宜，钗钏清秀次之，蜡金与钗金相冲，故不宜再\n" +
            "见；剑锋申酉太旺，恐有泛滥之灾；海金无取，乙丑为艮，山下出泉，亦吉。此非木不能出，\n" +
            "譬之桶论，故见木皆吉，如见平地、大林，须假剑金削之，方可取用；桑拓、杨柳无用；松\n" +
            "柏则互换归禄，此其最吉。诸火阴阳互见则吉，霹雳名为入圣，太阳号为显照，二火相见最\n" +
            "吉，但不宜并有则凶。诸土路旁、砂中最吉，屋上有天门生水之源，亦吉；城头，壁上与此\n" +
            "水则无干涉；大驿就位相克，水为土掩则井不食，须有木去之方可。水喜大海，为引凡入圣；\n" +
            "天上、涧下、长流亦不为在灾；大溪甲寅乙卯为吉，如甲申见乙酉，乙酉见甲申，官星互换，\n" +
            "最吉；如二水在年时，二木在月日，谓之水绕花堤，乃贵格也。 ",""],
            "乙酉": ["井泉水者，寒泉清冽，取养不穷，八家凿之以同饮，万民资之以生活。此水生于金而出\n" +
            "于木，故喜见金为福，砂中有土，性与之最宜，钗钏清秀次之，蜡金与钗金相冲，故不宜再\n" +
            "见；剑锋申酉太旺，恐有泛滥之灾；海金无取，乙丑为艮，山下出泉，亦吉。此非木不能出，\n" +
            "譬之桶论，故见木皆吉，如见平地、大林，须假剑金削之，方可取用；桑拓、杨柳无用；松\n" +
            "柏则互换归禄，此其最吉。诸火阴阳互见则吉，霹雳名为入圣，太阳号为显照，二火相见最\n" +
            "吉，但不宜并有则凶。诸土路旁、砂中最吉，屋上有天门生水之源，亦吉；城头，壁上与此\n" +
            "水则无干涉；大驿就位相克，水为土掩则井不食，须有木去之方可。水喜大海，为引凡入圣；\n" +
            "天上、涧下、长流亦不为在灾；大溪甲寅乙卯为吉，如甲申见乙酉，乙酉见甲申，官星互换，\n" +
            "最吉；如二水在年时，二木在月日，谓之水绕花堤，乃贵格也。 ",""],
            "壬戌": ["大海水者，总纳百川，汪洋无际，包括乾坤之大，升沈日月之光。此水原有清浊，以两\n" +
            "般分论：壬戌有土气为浊，癸亥干支纯水而纳音又水，故清。壬戌人嫌山，以土气太盛，有\n" +
            "金清之方吉，癸亥最喜见山，然后海水之性始安；涧下丁丑为山，天河与海上下相通，柱中\n" +
            "有木为槎则乘槎入于天河，极为上格；长流、大溪等水毕竟皆归于海，以海水不择细流，故\n" +
            "能成其大也；壬辰为龙归大海，尤吉，中间又分阴阳互见，干支合化方可；井泉则有所制，\n" +
            "与海不通，故不喜见之。诸金独海中第一，以壬戌癸亥喜见甲子乙丑；砂中亦得，余金又当\n" +
            "以贵人禄马参之。火喜天上，与海水相为照耀，最吉；霹雳己丑为山，戊癸合化，柱得木火\n" +
            "旺地，亦吉；山下、山头、覆灯诸火不宜见。木唯壬子癸丑、壬午癸未俱吉；大林有风冲动，\n" +
            "水性不安；平地厚载，则就位相得；松柏、石榴若无土制则漂泊无定。土爱路旁、大驿，唯\n" +
            "此二土足以振之不泄，况癸亥见戊申为天关地轴大格，日时遇此厚土，纵有风雷，亦不为害；\n" +
            "城头己卯须资艮则吉，如逢霹雳，则雷火变化，海水汹涌，亦主贫寒。",""],
            "癸亥": ["大海水者，总纳百川，汪洋无际，包括乾坤之大，升沈日月之光。此水原有清浊，以两\n" +
            "般分论：壬戌有土气为浊，癸亥干支纯水而纳音又水，故清。壬戌人嫌山，以土气太盛，有\n" +
            "金清之方吉，癸亥最喜见山，然后海水之性始安；涧下丁丑为山，天河与海上下相通，柱中\n" +
            "有木为槎则乘槎入于天河，极为上格；长流、大溪等水毕竟皆归于海，以海水不择细流，故\n" +
            "能成其大也；壬辰为龙归大海，尤吉，中间又分阴阳互见，干支合化方可；井泉则有所制，\n" +
            "与海不通，故不喜见之。诸金独海中第一，以壬戌癸亥喜见甲子乙丑；砂中亦得，余金又当\n" +
            "以贵人禄马参之。火喜天上，与海水相为照耀，最吉；霹雳己丑为山，戊癸合化，柱得木火\n" +
            "旺地，亦吉；山下、山头、覆灯诸火不宜见。木唯壬子癸丑、壬午癸未俱吉；大林有风冲动，\n" +
            "水性不安；平地厚载，则就位相得；松柏、石榴若无土制则漂泊无定。土爱路旁、大驿，唯\n" +
            "此二土足以振之不泄，况癸亥见戊申为天关地轴大格，日时遇此厚土，纵有风雷，亦不为害；\n" +
            "城头己卯须资艮则吉，如逢霹雳，则雷火变化，海水汹涌，亦主贫寒。",""],
        };



        //天干五行
        var ganwuxing = {
            "甲": "木",
            "乙": "木",
            "丙": "火",
            "丁": "火",
            "戊": "土",
            "己": "土",
            "庚": "金",
            "辛": "金",
            "壬": "水",
            "癸": "水"
        };

        function getganwuxing(gan) {

            return ganwuxing[gan];

        }

        //天干禄地支
        var ganlu = {
            "甲": "寅",
            "乙": "卯",
            "丙": "巳",
            "丁": "午",
            "戊": "巳",
            "己": "午",
            "庚": "申",
            "辛": "酉",
            "壬": "亥",
            "癸": "子"
        };

        function getlu(gan) {
            return ganlu[gan];
        }

        var zhilu = {
            "寅": "甲",
            "卯": "乙",
            "巳": "丙戊",
            "午": "丁己",
            "申": "庚",
            "酉": "辛",
            "亥": "壬",
            "子": "癸"
        };

        function getzhilu(zhi) {
            return zhilu[zhi];
        }



        // 丧门 命前两位为丧门
        var sangmen = {
            "子": "寅",
            "丑": "卯",
            "寅": "辰",
            "卯": "巳",
            "辰": "午",
            "巳": "未",
            "午": "申",
            "未": "酉",
            "申": "戌",
            "酉": "亥",
            "戌": "子",
            "亥": "丑"
        };
        //吊客 命后两位为吊客
        var diaoke = {
            "子": "戌",
            "丑": "亥",
            "寅": "子",
            "卯": "丑",
            "辰": "寅",
            "巳": "卯",
            "午": "辰",
            "未": "巳",
            "申": "午",
            "酉": "未",
            "戌": "申",
            "亥": "酉",
        };


        var gou = {
            "子": "卯",
            "丑": "辰",
            "寅": "巳",
            "卯": "午",
            "辰": "未",
            "巳": "申",
            "午": "酉",
            "未": "戌",
            "申": "亥",
            "酉": "子",
            "戌": "丑",
            "亥": "寅"
        };

        var jiao = {
            "子": "亥",
            "丑": "子",
            "寅": "丑",
            "卯": "寅",
            "辰": "卯",
            "巳": "辰",
            "午": "巳",
            "未": "午",
            "申": "未",
            "酉": "申",
            "戌": "酉",
            "亥": "戌",
        };



        //天乙贵人
        var tianyi = {
            "甲": "丑未",
            "戊": "丑未",
            "庚": "丑未",
            "乙": "子申",
            "己": "子申",
            "丙": "亥酉",
            "丁": "亥酉",
            "壬": "巳卯",
            "癸": "巳卯",
            "辛": "午寅"
        };

        function gettianyi(gan) {
            return tianyi[gan];
        }

        var zhitianyi = {
            "丑": "甲戊庚",
            "未": "甲戊庚",

            "子": "乙己",
            "申": "乙己",

            "亥": "丙丁",
            "酉": "丙丁",

            "巳": "壬癸",
            "卯": "壬癸",
            "午": "辛",
            "寅": "辛"
        };

        function getzhitianyi(zhi) {
            return zhitianyi[zhi];
        }

        //六仪,子加寅顺数至生月

        var liuyi = {
            "寅": "子",
            "卯": "丑",
            "辰": "寅",
            "巳": "卯",
            "午": "辰",
            "未": "巳",
            "申": "午",
            "酉": "未",
            "戌": "申",
            "亥": "酉",
            "子": "戌",
            "丑": "亥"
        };

        //旬六仪
        var xunliuyi = {
            "甲子": "戊",
            "甲戌": "己",
            "甲申": "庚",
            "甲午": "辛",
            "甲辰": "壬",
            "甲寅": "癸"
        };

        //空亡 六甲 四大 地支缺天干禄
        var xunkong = {
            "甲子": "六甲-戌亥,四大-水",
            "甲戌": "六甲-申酉,落空亡-庚辛",
            "甲申": "六甲-午未,四大-金，落空亡-丙丁",
            "甲午": "六甲-辰巳,四大-水",
            "甲辰": "六甲-寅卯,四大,落空亡-甲乙",
            "甲寅": "六甲-子丑,四大-金，落空亡-壬癸"
        };



        function getXunKongWang(jiazi) {
            return xunkong[liujiaxun[jiazi]];
        }

        //进交退伏
        var jinjiaotuifu = {
            "甲子": "进",
            "己卯": "进",
            "甲午": "进",
            "己酉": "进",
            "丙子": "交",
            "辛卯": "交",
            "丙午": "交",
            "辛酉": "交",
            "丁丑": "退",
            "壬辰": "退",
            "丁未": "退",
            "壬戌": "退",
            "戊寅": "伏",
            "癸巳": "伏",
            "戊申": "伏",
            "癸亥": "伏"
        };

        // vm.importantInfo["进交退伏"]={
        //     "进":"甲子,己卯,甲午,己酉"
        //     ,"交":"丙子,辛卯,丙午,辛酉"
        //     ,"退":"丁丑,壬辰,丁未,壬戌"
        //     ,"伏":"戊寅,癸巳,戊申,癸亥"
        // };

        //截路空亡
        var jielukongwang = {
            "甲": "申酉",
            "乙": "午未",
            "丙": "辰巳",
            "丁": "寅卯",
            "戊": "子丑戌亥",
            "己": "申酉",
            "庚": "午未",
            "辛": "辰巳",
            "壬": "寅卯",
            "癸": "子丑戌亥",
        };
        vm.importantInfo["截路空亡"] = jielukongwang;

        var jieluzhu = ["甲申", "己酉", "乙未", "庚午", "丙辰", "辛巳", "丁卯", "壬寅", "戊子", "戊戌", "癸丑", "癸亥"];
        vm.importantInfo["截路空亡柱"] = jieluzhu;

        //食神
        var shishen = {
            "甲": "丙",
            "乙": "丁",
            "丙": "戊",
            "丁": "己",
            "戊": "庚",
            "己": "辛",
            "庚": "壬",
            "辛": "癸",
            "壬": "甲",
            "癸": "乙"
        };

        //正财
        var zhengcai = {
            "甲": "己",
            "乙": "戊",
            "丙": "辛",
            "丁": "庚",
            "戊": "癸",
            "己": "壬",
            "庚": "乙",
            "辛": "甲",
            "壬": "丁",
            "癸": "丙"
        };

        //正财
        var piancai = {
            "甲": "戊",
            "乙": "己",
            "丙": "庚",
            "丁": "辛",
            "戊": "壬",
            "己": "癸",
            "庚": "甲",
            "辛": "乙",
            "壬": "丙",
            "癸": "丁"
        };

        //正官
        var zhengguan = {
            "甲": "辛",
            "乙": "庚",
            "丙": "癸",
            "丁": "壬",
            "戊": "乙",
            "己": "甲",
            "庚": "丁",
            "辛": "丙",
            "壬": "己",
            "癸": "戊"
        };

        //正官禄，五虎遁官禄位
        var zhengguanlu = {
            "甲": ["癸酉"],
            "己": ["丙寅"],
            "乙": ["甲申"],
            "庚": ["壬午"],
            "丙": ["庚子"],
            "辛": ["癸巳"],
            "丁": ["辛亥"],
            "壬": ["丙午"],
            "戊": ["乙卯"],
            "癸": ["丁巳"]

        }


        //驿马
        var yima = {
            "申": "寅",
            "子": "寅",
            "辰": "寅",

            "亥": "巳",
            "卯": "巳",
            "未": "巳",

            "寅": "申",
            "午": "申",
            "戌": "申",

            "巳": "亥",
            "酉": "亥",
            "丑": "亥"
        };

        function getma(zhi) {
            return yima[zhi];
        }


        //劫杀-五行绝地
        var jiesha = {
            "申": "巳",
            "子": "巳",
            "辰": "巳",

            "亥": "申",
            "卯": "申",
            "未": "申",

            "寅": "亥",
            "午": "亥",
            "戌": "亥",

            "巳": "寅",
            "酉": "寅",
            "丑": "寅"
        };


        //六害["子未","丑午","寅巳","卯辰","申亥","酉戌"]
        var liuhai = {
            "子": "未",
            "未": "子",
            "午": "丑",
            "丑": "午",

            "寅": "巳",
            "巳": "寅",
            "申": "亥",
            "亥": "申",

            "卯": "辰",
            "辰": "卯",
            "酉": "戌",
            "戌": "酉",
        };
        //亡神-五行禄地
        var wangshen = {
            "申": "亥",
            "子": "亥",
            "辰": "亥",

            "亥": "寅",
            "卯": "寅",
            "未": "寅",

            "寅": "巳",
            "午": "巳",
            "戌": "巳",

            "巳": "申",
            "酉": "申",
            "丑": "申"
        };

        //【纳音五行正印】
        var wuxingzhengyin = {
            "金": "乙丑",
            "木": "癸未",
            "水": "壬辰",
            "火": "甲戌",
            "土": "丙辰"
        };

        //华盖印
        var huagaiyin = {
            "巳": "乙丑",
            "酉": "乙丑",
            "丑": "乙丑",

            "亥": "癸未",
            "卯": "癸未",
            "未": "癸未",


            "申": "壬辰",
            "子": "壬辰",
            "辰": "壬辰",

            "寅": "甲戌",
            "午": "甲戌",
            "戌": "甲戌"

        };

        //夹贵印
        var jiaguiyin = {

            "壬": "丙辰，壬辰",
            "癸": "丙辰，壬辰",
            "戊": "丙辰，壬辰",
            "己": "丙辰，壬辰",

            "丙": "甲戌",
            "丁": "甲戌"

        };

        function getwuxingzhengyin(wuxing) {
            return wuxingzhengyin[wuxing];
        }

        var infoChangShengJue = ["长生", "沐浴", "冠带", "临官", "帝旺", "衰", "病", "死", "墓", "绝", "胎", "养"]
        var nayinchangshengjue = {
            "金": {
                "巳": "长生",
                "午": "沐浴",
                "未": "冠带",
                "申": "临官",
                "酉": "帝旺",
                "戌": "衰",
                "亥": "病",
                "子": "死",
                "丑": "墓",
                "寅": "绝",
                "卯": "胎",
                "辰": "养"
            },
            "木": {
                "亥": "长生",
                "子": "沐浴",
                "丑": "冠带",
                "寅": "临官",
                "卯": "帝旺",
                "辰": "衰",
                "巳": "病",
                "午": "死",
                "未": "墓",
                "申": "绝",
                "酉": "胎",
                "戌": "养"
            },
            "水": {
                "申": "长生",
                "酉": "沐浴",
                "戌": "冠带",
                "亥": "临官",
                "子": "帝旺",
                "丑": "衰",
                "寅": "病",
                "卯": "死",
                "辰": "墓",
                "巳": "绝",
                "午": "胎",
                "未": "养"
            },
            "火": {
                "寅": "长生",
                "卯": "沐浴",
                "辰": "冠带",
                "巳": "临官",
                "午": "帝旺",
                "未": "衰",
                "申": "病",
                "酉": "死",
                "戌": "墓",
                "亥": "绝",
                "子": "胎",
                "丑": "养"
            },
            "土": {
                "申": "长生",
                "酉": "沐浴",
                "戌": "冠带",
                "亥": "临官",
                "子": "帝旺",
                "丑": "衰",
                "寅": "病",
                "卯": "死",
                "辰": "墓",
                "巳": "绝",
                "午": "胎",
                "未": "养"
            }
        };

        function getnayinchangshengjue(wuxing) {
            return nayinchangshengjue[wuxing];

        }

        var wuxingchangshengjue = {
            "金": {
                "巳": "长生",
                "午": "沐浴",
                "未": "冠带",
                "申": "临官",
                "酉": "帝旺",
                "戌": "衰",
                "亥": "病",
                "子": "死",
                "丑": "墓",
                "寅": "绝",
                "卯": "胎",
                "辰": "养"
            },
            "木": {
                "亥": "长生",
                "子": "沐浴",
                "丑": "冠带",
                "寅": "临官",
                "卯": "帝旺",
                "辰": "衰",
                "巳": "病",
                "午": "死",
                "未": "墓",
                "申": "绝",
                "酉": "胎",
                "戌": "养"
            },
            "水": {
                "申": "长生",
                "酉": "沐浴",
                "戌": "冠带",
                "亥": "临官",
                "子": "帝旺",
                "丑": "衰",
                "寅": "病",
                "卯": "死",
                "辰": "墓",
                "巳": "绝",
                "午": "胎",
                "未": "养"
            },
            "火": {
                "寅": "长生",
                "卯": "沐浴",
                "辰": "冠带",
                "巳": "临官",
                "午": "帝旺",
                "未": "衰",
                "申": "病",
                "酉": "死",
                "戌": "墓",
                "亥": "绝",
                "子": "胎",
                "丑": "养"
            },
            "土": {
                "寅": "长生",
                "卯": "沐浴",
                "辰": "冠带",
                "巳": "临官",
                "午": "帝旺",
                "未": "衰",
                "申": "病",
                "酉": "死",
                "戌": "墓",
                "亥": "绝",
                "子": "胎",
                "丑": "养"
            }
        };

        function getwuxingchangshengje(wuxing) {
            return wuxingchangshengjue[wuxing];
        }

        //选择后
        vm.genderSelected = vm.genderList[0];

        function getSelectedGender(value) {
            for (var i = 0; i < vm.genderList.length; i++) {

                if (vm.genderList[i].value === value) {
                    return vm.genderList[i];
                }
            }

        }


        vm.bazi = {
            birth: 1984,
            "gender": "男",
            "niangan": "丙",
            "nianzhi": "子",
            niannayin: "",
            nianzhu: "丙子",

            "yuegan": "丙",
            "yuezhi": "寅",
            yuenayin: "",

            "rigan": "甲",
            "rizhi": "寅",
            rinayin: "",

            "shigan": "乙",
            "shizhi": "卯",
            shinayin: "",

            "taigan": "",
            "taizhi": "",
            tainayin: "",

            "minggan": "甲",
            "mingzhi": "子",
            "shengan": "甲",
            "shenzhi": "子",

            "yungan": "乙",
            "yunzhi": "丑",

            "liuniangan": "丙",
            "liunianzhi": "寅",
            "xingniangan": "丁",
            "xingnianzhi": "亥",

            dayun: "乙丑",
            dayunnayin: "",
            liunian: "乙丑",
            xingnian: "乙丑"

        };
        vm.year = 1984;

        vm.xingnian = [
            [],
            [],
            [],
            [],
            [],
            [],
            [],
            [],
            [],
            []
        ];
        vm.xingnianShiZhu = [
            [],
            [],
            [],
            [],
            [],
            [],
            [],
            [],
            [],
            []
        ];

        //四柱分析结果
        vm.sizhuAnalyze = {};
        //岁运
        vm.suiyunAnalyze = {};

        var yangGan = ["甲", "丙", "戊", "庚", "壬"];

        function isYangGan(gan) {
            var index = yangGan.indexOf(gan);
            return index >= 0;
        }

        vm.calculateXingNian = calculateXingNian;
        vm.calculateXingNianShiZhu = calculateXingNianShiZhu;


        //60甲子属性
        //http://blog.sina.com.cn/s/blog_614375770102wn3s.html
        var jiazishuxinglist = {
            "甲子": ['海中金', '从革之金，其气散，得【戊申土】，【癸巳水】相之，则吉。戊申乃金临官之地，土者更旺于子，必能生成，癸巳系金，生于巳，水旺于子，纳音各有所归，又为朝元禄，忌丁卯丁酉戊午之火', '进神', "阎东叟云：甲子金为进神，禀沉潜灵中之德，四时皆吉，入贵格，承旺气，则术业精微，主魁夺之荣。", "玉霄宝鉴云：甲子乙丑未成器金，见火则成，多见则吉。", "为宝物,喜金木旺地"],
            "乙丑": ["海中金", "自库之金，火不能克，盖退藏之金，苟无刑害冲破，未有不显荣者，独忌【己丑】【戊午】【己未】之火。", "正印", "阎东叟云：具大福德，秋冬富贵寿考，春夏吉中有凶，入格则建功享福，带煞类为凶会，", "玉霄宝鉴云：甲子乙丑未成器金，见火则成，多见则吉。", "为顽矿,喜火及南方月时"],
            "丙寅": ["炉中火", "丙寅赫牺之火，无水制之，则为燔灼炎烈之患，水不可遇，独爱甲寅之水，就位济之，又名朝元禄。", "五行要论云：丙寅火食灵明冲粹之气，四时生生之德，入贵格，则文彩发应，主科甲之贵。", "珞琭子云：丙寅丁卯秋天宜以保持。莹和尚注云：丙寅丁卯举火之类，秋天保持者，言水生于秋也。鬼谷遗文云：丙寅丁卯秋冬宜以保持。注云：木不南奔火无西旺，火至秋冬，势恐不久。", "", ""],
            "丁卯": ["炉中火", "丁卯伏明之火，气弱宜木生之，遇水则凶，乙卯乙酉水最毒。", "五行要论云：丁卯沐浴之火，含雷动风作之气，水济之则达，土载之则基厚，以木资之为文彩，以金橐之，更逢夏令则凶暴。", "珞琭子云：丙寅丁卯秋天宜以保持。莹和尚注云：丙寅丁卯举火之类，秋天保持者，言水生于秋也。鬼谷遗文云：丙寅丁卯秋冬宜以保持。注云：木不南奔火无西旺，火至秋冬，势恐不久。", ""],
            "戊辰": ["大林木", "戊辰两土下木，众金不能克，盖生金，有母子之道，得土生之为佳。", "五行要论云：戊辰庚寅癸丑三辰，挺木德清健之数，生于春夏，能转立独奋，随变成功，更成旺气，则有凌霄耸壑之志，惟忌秋生，虽怀志节，屈而不伸。", "珞琭子云：己巳戊辰度乾宫而脱厄。莹和尚注云：己巳戊辰举木之数，西方金鬼旺乡，纳音之木，至此绝矣，斯谓厄会。若度乾亥之宫，木得水以生长，故脱厄。", ""],
            "己巳": ["大林木", "己巳为近火之木，金自此生，于我无伤，忌见生旺之火。", "阎东叟云：己巳在巽为风动之木，根危易拔，和之以金土，运归东南方成材用虽外阳内阴，别无辅助，则其气灵散，更为生鬼所克，乃不材之本也。", "珞琭子云：己巳戊辰度乾宫而脱厄。莹和尚注云：己巳戊辰举木之数，西方金鬼旺乡，纳音之木，至此绝矣，斯谓厄会。若度乾亥之宫，木得水以生长，故脱厄。"],
            "庚午": ["路旁土", "始生之土，木不能克，惟忌水多，反伤其气，木多却有归，盖归未也。", "阎东叟云：庚午辛未戊申丁巳，皆厚德之土，含容镇静，和气融怡，福禄优裕。入格则多历方岳之任，有普惠博爱之功。", "", ""],
            "辛未": ["路旁土", "始生之土，木不能克，惟忌水多，反伤其气，木多却有归，盖归未也。", "阎东叟云：庚午辛未戊申丁巳，皆厚德之土，含容镇静，和气融怡，福禄优裕。入格则多历方岳之任，有普惠博爱之功。"],
            "壬申": ["剑锋金", "临官之金，利见水土，若丙申丙寅戊午之火，则为灾害。 ", "阎东叟云：壬申金，持天将之威，资临官之气，秋冬掌生杀之权，春夏吉少凶多，入格以功名自奋，带杀之刻剥为能。", "玉霄宝鉴云：壬申癸酉，金旺之位，不可复旺，旺则伤物；不可见火，见火则自伤。", "", ""],
            "癸酉": ["剑锋金", "坚成之金，火死于酉，见火何伤，惟忌丁酉火，【就位克之】。 ", "阎东叟云：癸酉自旺之金，禀纯粹之气，春夏为性英明，秋冬尤贵。入格则功业节概，挺转出伦；带杀则少年刚劲，四十之后，渐成纯德。", "玉霄宝鉴云：壬申癸酉，金旺之位，不可复旺，旺则伤物；不可见火，见火则自伤。", "", ""],


            "甲戌": ["山头火", "自库之火，不嫌众水，惟忌壬戌，所谓墓中受克，其患难逃。", "", "", ""],
            "乙亥": ["山头火", "", "", ""],
            "丙子": ["涧下水", "", "", ""],
            "丁丑": ["涧下水", "", "", ""],
            "戊寅": ["城头土", "", "", ""],
            "己卯": ["城头土", "", "", ""],
            "庚辰": ["白蜡金", "", "", ""],
            "辛巳": ["白蜡金", "", "", ""],
            "壬午": ["杨柳木", "", "", ""],
            "癸未": ["杨柳木", "", "", ""],
            "甲申": ["泉中水"],
            "乙酉": ["泉中水"],
            "丙戌": ["屋上土"],
            "丁亥": ["屋上土"],
            "戊子": ["霹雳火"],
            "己丑": ["霹雳火"],
            "庚寅": ["松柏木"],
            "辛卯": ["松柏木"],
            "壬辰": ["长流水"],
            "癸巳": ["长流水"],
            "甲午": ["沙中金"],
            "乙未": ["沙中金"],
            "丙申": ["山下火"],
            "丁酉": ["山下火"],
            "戊戌": ["平地木"],
            "己亥": ["平地木"],
            "庚子": ["壁上土"],
            "辛丑": ["壁上土"],
            "壬寅": ["金箔金"],
            "癸卯": ["金箔金"],
            "甲辰": ["复灯火"],
            "乙巳": ["复灯火"],
            "丙午": ["天河水"],
            "丁未": ["天河水"],
            "戊申": ["大驿土"],
            "己酉": ["大驿土"],
            "庚戌": ["钗钏金"],
            "辛亥": ["钗钏金"],
            "壬子": ["桑拓木"],
            "癸丑": ["桑拓木"],
            "甲寅": ["大溪水"],
            "乙卯": ["大溪水"],
            "丙辰": ["沙中土"],
            "丁巳": ["沙中土"],
            "戊午": ["天上火"],
            "己未": ["天上火"],
            "庚申": ["石榴木"],
            "辛酉": ["石榴木"],
            "壬戌": ["大海水"],
            "癸亥": ["大海水"]
        };

        //调侯用神大运表
        var tiaohoudayun = {

            "甲寅": ["【丙癸】调侯入【辛】运。在事业方面，在成就之中而有阻碍。在家庭方面，为【眷属】人口之口舌不吉", "【庚丁】调候入【癸】运。主体弱身体有疾病。天干无【戊】出干，此运某事难成"],
            "甲卯": ["入【癸】运。因财务之事不顺，因而牵连影响家庭和谐。未婚者因财务牵连男女感情分裂。【女命】，则以【体弱，生病】为主要征兆"],
            "甲辰": ["入【丁】运。四柱若有【甲。乙】则作为【事业】上失意"],
            "甲巳": ["入【戊】运。诸事徒劳、迟滞，但不作大凶之论。", "入【丙】运。因过度保守，而坐失良机，不作大凶"],
            "甲午": ["入【戊】运。此运一事无成，徒然辛劳，不作凶论"],
            "甲未": ["入【癸】运。适合守成", "入【己】运。财【争合】日主，男女主有感情上困扰"],
            "甲申": ["入【酉、亥】运。在事业方面有渐渐退守现象", "入【丙】运。白忙一场"],
            "甲酉": ["入【癸】运。即使四柱【有丙丁】，也难有成就。无丙丁有【官非】"],
            "甲戌": ["入【甲、乙】运。皆是为亲友人情破财，不论任何格局，都是无谓散财"],
            "甲亥": ["入【甲】运。主家庭、夫妻、男女等【感情不和】", "入【壬】运。四柱如果没有【庚】十年衰退"],
            "甲子": ["入【壬】运。合去丁则为【大意失荆州】", "入【癸】运。败于【操之过急】"],
            "甲丑": ["入【壬】运。财势【一落千丈】守成也需5年", "入【癸】运。非独【财势失地】且主【体弱多病】以及【官非灾害】"],
            "乙寅": ["入【癸】运。四柱无【丙】非但不能帮身，反而失败", "入【戊】运。主【身体有病】"],
            "乙卯": ["入【辛】运。虽非杀格，主守成岁月", "入【戊】运。恐有【失职、误事】之灾"],
            "乙辰": ["入【己】运。即使八字没有【驿马】也主远方奔波劳碌", "入【庚】运。四柱有【庚】者【大凶】无庚小退"],
            "乙巳": ["入【戊】运。身体有疾病"],
            "乙午": ["入【戊】运。身体有疾病"],
            "乙未": ["入【甲】运。四柱【无癸、丙】等同桃花"],
            "乙申": ["入【壬】运。因文字失策，引起官非灾害"],
            "乙酉": ["入【丁】运。主生病以及损失财务", "入【辛】运。日主无根，有【大凶疾灾】"],
            "乙戌": ["入【丙】运。【辛】七杀格，一事无成之运", "入【戊】运。守成则无灾难，妄动招引灾难"],
            "乙亥": ["入【壬】运。四处奔波没有成就。若四柱【戊】无根，则是贫困之运，虚有外表光华"],
            "乙子": ["入【癸】运。主多疑多虑，心神不宁。若四柱有【壬】出天干，有大疾病或意外之灾"],
            "乙丑": ["入【癸】运。主身体衰弱，经常有疾病。四柱若只有一个【丙】，乃是【大凶】运"],
            "丙寅": ["入【丁】运。大意自傲，举止失常，判断措施，大意失荆州。若地支有【寅、申】冲，【大凶】"],
            "丙卯": ["入【丁】运。【正财格】因酒色误事。【食神格】多病，难拖办事业"],
            "丙辰": ["入【戊】运。四柱【有甲】无大碍，守成。【无甲】文人，难论发越"],
            "丙巳": ["入【戊】运。人生消极，感情失意。有宗教修为倾向。主钱财失策", "入【丁】运。只事宜守成，动则有悔"],
            "丙午": ["入【戊】运。主不利亲属人口", "入【己】运。不利眷属，夫妻争吵", "入【丁】运。事业不利，损耗财务。无事乱忙，神不守舍。有损及感情之事"],
            "丙未": ["入【癸】运。尤其地支是【金、水】运，主破财不顺", "入【己】运。平常，无所烦神的清闲人士。修学【宗教、文学等】大吉"],
            "丙申": ["入【戊】运。亲属之间有纠纷", "入【己】运。女命主家庭有风波"],
            "丙戌": ["入【戊】运。文人切忌【酸辣】心态若有嫉妒，恐引火上身", "入【己】运。纸上谈兵，空有理论，无实际益处", "入【丁】运。外表光华，内里空虚，朱门食客，闲人"],
            "丙亥": ["入【癸】运。享受型的【虚浮花钱】，最忌少年行此运，【败家子】"],
            "丙子": ["入【己】运。有成就基础上，逐步衰退，名利皆失，守成难", "入【甲】运。守成尚可，进取反败"],
            "丙丑": ["入【己】运。无凶险之事，靠自己努力，无贵人帮助下，奠定基础", "入【甲】运。有虚名，无实质利益", "入【乙】运。外表尚可，浮财往来，略有声誉"],
            "丁寅": ["入【乙】运。主家务上的烦恼，协助亲友的负担", "入【丁】运。无凶兆，男命是守成岁月，女命则忌，【婚姻感情有变化】"],
            "丁卯": ["入【乙】运。尤其以【乙酉、乙丑】金水地支运，财务有重大损耗", "入【己】运。守成，无大灾难"],
            "丁辰": ["入【己】运。四柱【甲】偏印成格者，主大疾，无甲则无事", "入【丁】运。钱财不顺，女命婚姻有碍"],
            "丁巳": ["入【癸】运。是非诉讼，或者身染疾病", "入【丙】运。经济困难，调度失策"],
            "丁午": ["入【丙】运。收少出多，心情焦虑，财务紧迫", "入【己】运。不能自己一人创业，权且依附贵人"],
            "丁未": ["入【己】运。【甲】正印格者，时长生病。【壬】正官格，有小人，官非之灾"],
            "丁申": ["入【丁】运。连续损财，为事业所困，进退不得，欲罢不能，身不由己。"],
            "丁酉": ["入【丁】运。失去主动形式，心神不宁，不知所为。", "入【庚】运。业务驳杂，小人近身，忙中无头绪，左右皆为难，守成也难"],
            "丁戌": ["入【壬】运。事业将改组，自己退居清闲之职，商人将失去大客户。"],
            "丁亥": ["入【己】运。财务尚可，但引入是非之中", "入【丙】运。因他人之事受牵连，【谨慎】合作事业"],
            "丁子": ["入【己】运。财务尚可，但引入是非之中", "入【丙】运。因他人之事受牵连，【谨慎】合作事业"],
            "丁丑": ["入【己】运。财务尚可，但引入是非之中", "入【丙】运。因他人之事受牵连，【谨慎】合作事业"],
            "戊寅": ["入【】运。"],
            "戊卯": ["入【】运。"],
            "戊辰": ["入【】运。"],
            "戊巳": ["入【】运。"],
            "戊午": ["入【】运。"],
            "戊未": ["入【】运。"],
            "戊申": ["入【】运。"],
            "戊酉": ["入【】运。"],
            "戊戌": ["入【】运。"],
            "戊亥": ["入【】运。"],
            "戊子": ["入【】运。"],
            "戊丑": ["入【】运。"],
            "己寅": ["入【】运。"],
            "己卯": ["入【】运。"],
            "己辰": ["入【】运。"],
            "己巳": ["入【】运。"],
            "己午": ["入【】运。"],
            "己未": ["入【】运。"],
            "己申": ["入【】运。"],
            "己酉": ["入【】运。"],
            "己戌": ["入【】运。"],
            "己亥": ["入【】运。"],
            "己子": ["入【】运。"],
            "己丑": ["入【】运。"],
            "庚寅": ["入【】运。"],
            "庚卯": ["入【】运。"],
            "庚辰": ["入【】运。"],
            "庚巳": ["入【】运。"],
            "庚午": ["入【】运。"],
            "庚未": ["入【】运。"],
            "庚申": ["入【】运。"],
            "庚酉": ["入【】运。"],
            "庚戌": ["入【】运。"],
            "庚亥": ["入【】运。"],
            "庚子": ["入【】运。"],
            "庚丑": ["入【】运。"],
            "辛寅": ["入【】运。"],
            "辛卯": ["入【】运。"],
            "辛辰": ["入【】运。"],
            "辛巳": ["入【】运。"],
            "辛午": ["入【】运。"],
            "辛未": ["入【】运。"],
            "辛申": ["入【】运。"],
            "辛酉": ["入【】运。"],
            "辛戌": ["入【】运。"],
            "辛亥": ["入【】运。"],
            "辛子": ["入【】运。"],
            "辛丑": ["入【】运。"],
            "壬寅": ["入【】运。"],
            "壬卯": ["入【】运。"],
            "壬辰": ["入【】运。"],
            "壬巳": ["入【】运。"],
            "壬午": ["入【】运。"],
            "壬未": ["入【】运。"],
            "壬申": ["入【】运。"],
            "壬酉": ["入【】运。"],
            "壬戌": ["入【】运。"],
            "壬亥": ["入【】运。"],
            "壬子": ["入【】运。"],
            "壬丑": ["入【】运。"],
            "癸寅": ["入【】运。"],
            "癸卯": ["入【】运。"],
            "癸辰": ["入【】运。"],
            "癸巳": ["入【】运。"],
            "癸午": ["入【】运。"],
            "癸未": ["入【】运。"],
            "癸申": ["入【】运。"],
            "癸酉": ["入【】运。"],
            "癸戌": ["入【】运。"],
            "癸亥": ["入【】运。"],
            "癸子": ["入【】运。"],
            "癸丑": ["入【】运。"]
        };


        var riyuebak = {

            "甲寅": [""],
            "甲卯": [""],
            "甲辰": [""],
            "甲巳": [""],
            "甲午": [""],
            "甲未": [""],
            "甲申": [""],
            "甲酉": [""],
            "甲戌": [""],
            "甲亥": [""],
            "甲子": [""],
            "甲丑": [""],
            "乙寅": [""],
            "乙卯": [""],
            "乙辰": [""],
            "乙巳": [""],
            "乙午": [""],
            "乙未": [""],
            "乙申": [""],
            "乙酉": [""],
            "乙戌": [""],
            "乙亥": [""],
            "乙子": [""],
            "乙丑": [""],
            "丙寅": [""],
            "丙卯": [""],
            "丙辰": [""],
            "丙巳": [""],
            "丙午": [""],
            "丙未": [""],
            "丙申": [""],
            "丙酉": [""],
            "丙戌": [""],
            "丙亥": [""],
            "丙子": [""],
            "丙丑": [""],
            "丁寅": [""],
            "丁卯": [""],
            "丁辰": [""],
            "丁巳": [""],
            "丁午": [""],
            "丁未": [""],
            "丁申": [""],
            "丁酉": [""],
            "丁戌": [""],
            "丁亥": [""],
            "丁子": [""],
            "丁丑": [""],
            "戊寅": [""],
            "戊卯": [""],
            "戊辰": [""],
            "戊巳": [""],
            "戊午": [""],
            "戊未": [""],
            "戊申": [""],
            "戊酉": [""],
            "戊戌": [""],
            "戊亥": [""],
            "戊子": [""],
            "戊丑": [""],
            "己寅": [""],
            "己卯": [""],
            "己辰": [""],
            "己巳": [""],
            "己午": [""],
            "己未": [""],
            "己申": [""],
            "己酉": [""],
            "己戌": [""],
            "己亥": [""],
            "己子": [""],
            "己丑": [""],
            "庚寅": [""],
            "庚卯": [""],
            "庚辰": [""],
            "庚巳": [""],
            "庚午": [""],
            "庚未": [""],
            "庚申": [""],
            "庚酉": [""],
            "庚戌": [""],
            "庚亥": [""],
            "庚子": [""],
            "庚丑": [""],
            "辛寅": [""],
            "辛卯": [""],
            "辛辰": [""],
            "辛巳": [""],
            "辛午": [""],
            "辛未": [""],
            "辛申": [""],
            "辛酉": [""],
            "辛戌": [""],
            "辛亥": [""],
            "辛子": [""],
            "辛丑": [""],
            "壬寅": [""],
            "壬卯": [""],
            "壬辰": [""],
            "壬巳": [""],
            "壬午": [""],
            "壬未": [""],
            "壬申": [""],
            "壬酉": [""],
            "壬戌": [""],
            "壬亥": [""],
            "壬子": [""],
            "壬丑": [""],
            "癸寅": [""],
            "癸卯": [""],
            "癸辰": [""],
            "癸巳": [""],
            "癸午": [""],
            "癸未": [""],
            "癸申": [""],
            "癸酉": [""],
            "癸戌": [""],
            "癸亥": [""],
            "癸子": [""],
            "癸丑": [""],
        };

      

        //管见子平格局
        var guanjianziping = {
            "建禄格": [
                "其一", "建禄身强旺本元，财轻印重不堪言。", "杀官不见同人透，伤食无形继母存。", "运背岁强还有祸，年通月利总为屯。", "不为湖海清闲客，也守空门度晨昏。", "其二", "建禄天元座弱宫，财彰官旺福无穷。", "食神暗隐元无碍，禄马明逢却有功。", "制服运乡多发达，财官旺地必亨通。", "不为庙廊青云客，也是人间富贵翁。", "解:", "月令建禄，日干本旺，印绶太重，财星反轻，不可言福也。柱中原无官杀，却有比肩透出，支下又无伤官食神，反有偏印，甚旺无依。虽流年通畅，大运背禄，为福少而为祸多，乃九流僧道之命。若建禄身座弱宫，又有财官并透，以制其旺气，伤官食神以泄其旺气，，一制一泄，则禀其中和矣，必庙廊功名之士，富贵享福之人也。"
            ],
            "阳刃格": [
                "柱中羊刃慢言凶，七杀伤官最喜逢。", "叠见刃星妻不克，重逢财破定难容。", "提纲杀合真豪杰，月令逢冲是老农。", "无破无伤杀刃显，边疆万里俟侯封。", "解:", "柱中羊刃，不可便以凶言，如有伤官泄之，七杀制之，反为贵命。赋云，小人命内，亦有正气官星，君子格中，也犯七杀羊刃是也。羊刃不忌多，只怕见财有争夺之祸。如提逢羊刃，即有七杀合之，乃英雄豪杰之士，真贵之命。若月令羊刃而被冲破，又无煞驾威严，止为乡人而已。如无伤破而有煞星制服，多出武职，主掌兵符，功名起于边陲。羊刃克妻，有羊刃多而反不克者，是未见财也。若见财星争夺，恐难容于不伤也。"
            ],
            "正官格": [
                "正官一位格清高，带印忠良果俊豪。", "无杀身强情坦坦，有财气旺志嚣嚣。", "却嫌分夺忧埋没，最忌刑冲叹寂寥。", "内外合多官不显，支干伤尽数难逃。", "解:", "正官只宜一位权专，喜见印绶，秉性忠良英豪伟俊。", "不宜见杀，无杀则性情舒坦。", "财乃官之元神，见财则有嚣嚣自得之意。", "分夺者再入他格(比肩劫财为分，伤官为夺)，埋没者藏而不见。", "贪合忘官，柱中忌见。刑冲破害，局内最嫌。至于伤官，格中忌神，见之者寿不永也。"


            ],
            "七杀格": [
                "偏官赋性最刚强，身杀相争定不详。", "杀浅身强权可羡，气衰杀重命难长。", "刃星得合功名远，印绶相生福禄昌。", "只怕杀官多印少，始终贫困事乖张。", "解:", "偏官者，阳克阳,阴克阴之类是也，无阴阳配合，故谓之偏。", "身强有制服者为偏官，身弱无制服者为七煞。身杀相停者妙，如身弱杀旺，身杀相争俱不为佳。身强杀浅，假杀为权，杀重身轻，终须有损。正此之谓也。羊刃能合杀，伤官能驾杀，食神能制杀，印绶能化杀。此四者见之，主功名远大，富贵绵长。但忌官杀混杂，又无印化，不但福气菲薄，亦恐难为寿矣。阴日伤官驾杀，阳日伤官不能驾杀，只可论伤官带杀矣。"

            ],
            "正财格": [
                "正财旺相要根深，内助妻贤琴瑟谐。", "柱带比肩恒不足，运临七煞福弥深。", "五行生处多获宝，三合逢时广积金。", "官印两般同入格，功名早遂少年心。", "解:", "正财格，必要支下有根为贵。赋云，地支财伏暗生者奇。盖财者妻也，财星有气，必有贤能之妻。比肩分财，自然不足。财多身弱者，反不忌之。赋云：命用财运逢煞，吉亦堪陈。故云福弥深也。用财者要柱中原有生气，三合局中最妙。财合则聚，如此者多积财宝金珠之富。再见官印，此乃三奇全备，定主早登科第，乃富贵双全。禄嫌冲破，马忌空亡，不可不知。"

            ],
            "偏财格": [
                "偏财生旺在月支，慷慨风流果出奇。", "官煞清纯财禄盛，比肩混乱利名亏。", "平生事业要妻管，半世生涯赖子为。", "墓库运临冲劫地，寿元福气两参差。", "解:", "月上偏财最宜生旺，为人慷慨风流。或官或煞，只许一位，方为纯而不杂，乃有福有禄之人也。比肩劫财重见，则混乱。偏财乃众人之财，能有其机。若被比劫分去，则利名自然亏损。偏财格，主人情性疏懒好自在，凡事悉凭妻子，宠爱偏妾。如行运到墓库死绝劫杀分夺其秀气福寿，岂不参差矣。"


            ],
            "正印格": [
                "正印从来生我身，柱中先要识元神。", "煞官不见难言贵，偏正财多定是贫。", "劫重见财还有用，印轻透杀反为亲。", "食神偶尔来相犯，风疾缠绵病不仁。", "解:", "印绶者，生我日干也，官煞乃印绶元神，柱中不可无。财为印绶忌神，柱中不可有。子平云：重重生气若无官，当作清高技艺看。官杀不来无爵禄，纵为技艺也孤寒。又云，月生日干无天财，乃印绶之名。又云，用印见财，十有九贫。柱之若比劫重重，见财反吉。赋云，财星破印，喜逢比劫之宫。如印绶轻者，喜杀星透出有杀印相生之义，最可亲也。印绶见食神，比财尤甚。赋云：印绶重重享现成，食神只恐暗相刑，早年若不归黄土，孤苦伶仃风疾萦。盖述此义。"

            ],
            "偏印格": [
                "偏印枭神提上居，无官无杀利名虚。", "妾星暗见愁无限，天厨明透病有余。", "性格奔忙多计较，行藏迟钝甚趦趄。", "运临死绝财乡地，数尺红罗姓字书。", "解:", "偏印者，阳生阳，阴生阴也，又名枭神者何也?枭乃恶鸟也，其声甚怪，人闻其鸣则凶。柱中无食曰印，有食曰枭，能夺我之食也。如提纲偏印，柱无官杀，为虚名虚利之人。妾星者，偏财也，能克偏印，故主愁苦。天厨者，食神也，枭印忌见。夫枭忌见食，食忌见枭。赋云，年时月令有偏印，吉凶未萌，大运岁君逢寿星，灾殃立至。即此理也。偏印性本奔忙而干事多主迟钝，心虽计较而谋为却费趦趄。如行死绝之运，财星又来克破，官杀不来救解，定为泉路之人。偏印多系偏出寄生，主带暗疾，役于豪门。多以侄男养子为嗣，义女为妻。往往有验。枭字不可轻忽，凡柱中有枭食相争，无官杀解救，决不得于令终也。"
            ],
            "食神格": [
                "食神原是寿星名，最爱财扶喜弟兄。", "明暗要分轻与重，阴阳当辩浊中清。", "财彰杀隐形还壮，印旺官强势必倾。", "继母枭神来入格，嗟夫福寿两无成。", "解:", "食神名天厨，亦名寿星，喜财星比肩辅助。或干或支，当辩其轻重。书云：阳日食神无伤损，则暗合官星，阴日食神无破亏，须契合自亲印绶。阳日食神，身旺忌见官星。阴日食神，身弱忌见印绶。如见此二者，为破格填实不美。财透杀藏，足以壮其根本，最宜见之。印旺官强，是夺其威仪，其势自然倾颓。不论阴阳食神，俱以偏印为忌。用食见枭，其寿不延，又安能成其福哉。"

            ],
            "伤官格": [
                "其一", "五样伤官论不同，身强财煞是英雄。", "火土土金官去贵，金水木火无官穷。", "柱中木火如成格，喜见财官方亨通。", "只怕见官财印绝，终身劳碌任西东。", "解:", "伤官格有五样：火土伤官，土金伤官，二者不宜见官。身旺用财，身弱用印，定主富贵。若见官星，破了格局，不以贵论。又有金水伤官喜见官印，水木伤官喜见财官。二者若无官星，反不为美。又有木火伤官格，最喜见财，财多者见官不忌，无财者见官则凶。凡伤官格，身旺无财，身弱无印，终身劳碌。贫苦之人也。凡伤官多出技艺，未免刑伤子息。", "其二", "伤官伶俐性聪明，傲物高强志尚清。", "财印要分轻与重，煞官当辩浅和深。", "柱中原有官乡重，柱内无官官见轻。", "财印两明杀刃旺，定知富贵足平生。", "解:", "伤官为人性傲，故常以天下之人不如己，伶俐聪明，志尚清高。身旺有财，身弱有印，二者分明为富贵荣达之命。柱中若杀官并见，当辩浅深，然后可断其祸福。凡柱中原有官星再见官，则为祸重。如柱中原无官星，岁运见官星祸轻。柱中财印既明又有羊刃七杀以助其威，定主功名显达。如身弱无印身旺无财伤官见官刑冲破害，主克陷六亲难为妻子，乃九流艺术之辈，僧道师巫之命。"

            ]
        }

         //子平真诠
         var zipingzhenquan = {

            "建禄格": ["建禄者，月建逢禄堂也，禄即是劫。或以禄堂透出，即可依以用者，非也。故建禄与月劫，可同一格，不必加分，皆以透干会支，别取财官煞食为用。 "
                , " 【禄格用官】，干头透出为奇，又要财印相随，不可孤官无辅。"
                ,"有用官而印护者，如庚戌、戊子、癸酉、癸亥，金丞相命是也。"
                ,"有用官而财助者，如丁酉、丙午、丁巳、壬寅，李知府命是也。"
                , "有官而兼带财印者，所谓身强值三奇，尤为贵气。三奇者，财官印也，只要以官隔之，使财印两不相伤，其格便大，"
                ,"如庚午、戊子、癸卯、丁巳，王少师命是也。"
                , "  【禄劫用财】，须带食伤，盖月令为劫而以财作用，二者相克，必以伤食化之，始可转劫生财，如甲子、丙子、癸丑、壬辰，张都统命是也。 ", "  至于化劫为财，与化劫为生，尤为秀气。如己未、已巳、丁未、辛丑，丑与巳会，即以劫财之火为金局之财，安得不为大贵？所谓化劫为财也。如高尚书命，庚子、甲申、庚子、甲申，即以劫财之金，化为生财之水，所谓化劫为生也。 ", "  禄劫用煞，必须制伏台，如娄参政命，丁巳、壬子、癸卯、己未，壬合丁财以去其党煞，卯未会局以制伏是也。 ", "  至用煞而又财，本为不美，然能去煞存财，又成贵格。戊辰、癸亥、壬午、丙午，合煞存财，袁内阁命是也。", "  其禄劫之格，无财官而用伤食，泄其太过，亦为秀气。唯春木秋金，用之则贵，盖木逢火则明，金生水则灵。如张状元命，甲子、丙寅、甲子、丙寅，木火通明也；又癸卯、庚申、庚子、庚辰，金水相涵也。", "  更有禄劫而官煞竞出，必取清方为贵格。如一平章命，辛丑、庚寅、甲辰、乙亥、合煞留这也；如辛亥、庚写、甲申、丙寅，制煞留官也。", "  倘或两官竞出，亦须制伏，所谓争正官不可无伤也。", "  若夫用官而孤官无辅，格局更小，难于取贵，若透伤食便不破格。然亦有官伤并透而贵者，何也？如己酉、乙亥、壬戌、庚子，庚合乙而去伤存官，王总兵命也", "  用财而不透伤食，便难于发端，然干头透一位而不杂，地支根多，亦可取富，但不贵耳。", "  用官煞重而无制伏，运行制伏，亦可发财，但不可官煞太重，致令身危也。 ", "建禄月劫取运", "  禄劫取运，即以禄劫所成之局，分而配之。禄劫用官，印护者喜财，怕官星之逢合，畏七煞这相乘。伤食不能为害，劫比未即为凶。", "  禄劫用财而带伤食，财食重则喜印绶，而不书法比肩；财食轻则宜助财，而不喜印比。逢煞无伤，遇官非福。", "  禄劫用煞食制，食重煞轻，则运宜助煞；食轻煞重，则运喜助食。", "  若用煞而带财，命中合煞存财，则伤食为宜，财运不忌，透官无虑，身旺亦亨。若命中合财存煞，而用食制，煞轻则助煞，食轻则助食则已。 ", "  禄劫而用伤食，财运最宜，煞亦不忌，行印非吉，透官不美。若命中伤食太重，则财运固利，而印亦不忌矣。", "  禄劫而官煞并出，不论合煞留官，存官制煞，运喜伤食，比肩亦宜，印绶未为良图，财官亦非福运。"],
            "阳刃格": ["阳刃者，劫我正财之神，乃正财之七煞也。禄前一位，惟五阳有之，故为阳刃。不曰劫而曰刃，劫之甚也。", "【刃宜伏制，官煞皆宜，财印相随，尤为贵显】。夫正官而财印相随美矣，七煞得之，夫乃甚乎？岂知他格以煞能伤身，故喜制伏，忌财印；阳刃用之，则赖以制刃，不怕伤身，故反喜财印，忌制伏也。 ", "   然同是官煞制刃，而格亦有高低，如【官煞露而根深，其贵也大】；官煞藏而不露，或露而根浅，其贵也小。若己酉、丙子、壬寅、丙午，官透有力，旺财生之，丞相命也。又辛酉、甲午、丙申、壬辰，透煞根浅，财印助之，亦丞相命也。 ", "  然亦有【官煞制刃带伤食而贵者】，何也？或是印护，或是煞太重而裁损之，官煞轻而取清之，", " 如穆同知命，甲午、癸酉、庚寅、戊寅，癸水伤寅午之官，而戊以合之，【所谓印护也】，", " 如贾平章命，甲寅、庚午、戊申、甲寅，煞两透而根太重，食以制之，【所谓裁损也】。", " 如丙戌、丁酉、庚申、壬午，官煞竞出 ，而壬合丁官，煞纯而不杂。况阳刃之格，利于留煞，【所谓取清也】。", "  其中【丙生午月】，内藏己土，可以克水，尤宜带财佩印，", " 若【戊生午月】，【干透丙火，支会火局】，则化刃为印，或官或煞，透则去刃存印其格愈清。倘或【财煞并透露】，则犯去印存煞之忌，不作生煞制煞之例，富贵两空矣。", "  更若阳刃用财，格所不喜，然财根深而用伤食，以转刃生财，虽不比建禄月劫，可以取贵，亦可就富。不然，则刃与财相搏，不成局矣。 ", "【阳刃取运】", "    阳刃用官，则运喜助官，然命中官星根深，则印绶比劫之方，反为美运，但不喜伤食合官耳。", "    阳刃用煞，煞不甚旺，则运喜助煞；煞若太重，则运喜身旺印绶，伤食亦不为忌。 ", "    阳刃而官煞并出，不论去官去煞，运喜制伏，身旺亦利，财地官乡反为不吉也。 "],
            "正官格": ["官以克身，虽与七煞有别，终受彼制，何以切忌刑冲破害，尊之若是乎？岂知人生天地间，必无矫焉自尊之理，虽贵极天子，亦有天 祖临之。正官者分所当尊，在国有君，在家有亲，刑冲破害，以下犯上，乌乎可乎？", "  以刑冲破害为忌，则以生之护之为喜矣。存其喜而去其忌则贵，而贵之中又有高低者，何也？", "  以财印并透者论之，两不相碍，其贵也大,二者相合，仍以孤官无辅论。", "  若财印不以两用，则单用印不若单用财，以印能护官，亦能泄官，而财生官也。", "  若化官为印而透财，则又为甚秀，大贵之格也。", "  遇伤在于佩印，混煞贵乎取清.", "  官格透伤用印者，又忌见财，以财能去印，未能生官，而适以护伤故也.", "大运:", "    正官而用财印，身稍轻则取助身，官稍轻则助官。若官露而不可逢合，不可杂煞，不可重官", "    正官用财，运喜印受身旺之地，切忌食伤。若身旺而财轻官弱，即仍取财官运可也。", "    正官佩印，运喜财乡，伤食反吉。若官重身轻而佩印，则身旺为宜，不必财运也。", "    正官带伤食而用印制，运喜官旺印旺之乡，财运切忌。若印绶叠出，财运亦无害矣。", "    正官而带煞，伤食反为不碍。其命中用劫合煞，则财运可行，伤食可行，身旺，印绶亦可行，不宜复露七杀", "     若命用伤官合煞，则伤食与财俱可行，而不宜逢印矣（不可言：此处的伤官主要还是合杀的伤官，照应前文’混煞贵乎取清‘，七杀一定要合，阳日主甲用乙阳刃合，阴日主 如乙木用丙伤合。）", "     （不可言：若不配印，首要看官和身的强弱，参考通考的病药原理。没有讨论露食神的问题。）"],
            "七杀格": ["煞以攻身，似非美物，然大贵之格，多存七煞。盖控制得宜，煞为我用，如大英雄大豪杰，似难驾驭，而处之有方，则惊天动地之功，忽焉而就。此王侯将相所以多存七煞也。 ", "七煞之格局亦不一：", "      煞用食制者，上也，煞旺食强而身健，极为贵格。如乙亥、乙 酉、乙卯、丁丑，极等之贵也。 ", "  煞用食制，不要露财透印，以财能转食生煞，而印能去食护煞也。然而财先食后，财生煞而食以制之，或印先食后，食太旺而印制，则格成大贵。如脱脱丞相命，壬辰、甲胡、丙戌、戊戌，辰中暗煞，壬以透之，戊坐四支，食太重而透甲印，以损太过，岂非贵格？若煞强食泄而印露，则破局矣。 ", "  有七煞用印者，印能护煞，本非所宜，而印有情，便为贵格。如何参政命，丙寅、戊戌、壬戌、辛丑，戊与辛同通月令，是煞印有情也。 ", "  亦有煞重身轻，用食则身不能当，不若转而就印，虽不通根月令，亦为无情而有情。格亦许贵，但不大耳。 ", "  有煞而用财者，财以党煞，本非所喜，而或食被制，不能伏煞，而财以去印存食，便为贵格。如周丞相命，戊戌、甲子，丁未、庚戌，戊被制不能伏煞，时透庚财，即以清食者，生不足之煞。生煞即以制煞，两得其用，尤为大贵。", "  又有身重煞轻，煞又化印，用神不清，而借财以清格，亦为贵格。如甲申、乙亥、丙戌、庚寅，刘运使命是也。", "  更有杂气七煞，干头不透财以清用，亦可取贵。", "  有煞而杂官者，或去官，或去煞，取清则贵。如岳统制命，癸卯、丁巳、庚寅、庚辰，去官留煞也。夫官为贵气，去官何如去煞？岂知月令偏官，煞为用而官非用，各从其重。若官格杂煞而去官留煞，不能如是之清矣。如沈郎中命，丙子、甲午、辛亥、辛卯，子冲午而克煞，是去煞留官也。 ", "  有煞无食制而用印当者，如戊辰、甲寅、戊寅、戊午、赵员外命是也。 ", "  至书有制煞不可太过之说，虽亦有理，然运行财印，亦能发福，不可执一也，乃若弃命从煞，则于外格详之。 ", "偏官取运，即以偏官所成之局分而配之。", "  煞用食制，煞重食轻则助食，煞轻食重则助煞，煞食均而日主根轻则助身。忌正官之混杂，畏印绶之夺食。", "  煞用印绶，不利财乡，伤官为美，印绶身旺，俱为福地。", "  七煞用财，其以财而去印存食者，不利劫财，伤食皆吉，喜财怕印，透煞亦顺。", "  其以财而助煞不及者，财已足，则喜食印与帮身；财未足，则喜财旺而露煞。", "  煞带正官，不论去官留煞，去煞留官，身轻则喜助身，食轻则喜助食。莫去取清之物，无伤制煞之神。", "  煞无食制而用刃当煞，煞轻刃重则喜助煞，刃轻煞重，则宜制伏，无食可夺，印运何伤？七煞既纯，杂官不利。", "  ", "  ", "  "

            ],
            "正财格": [
                "财为我克，使用之物也，以能生官，所以为美。为财帛，为妻妾，为才能，为驿马，皆财类也。", "财喜根深，不宜太露，然透一位以清用，格所最喜，不为之露。即非月令用神，若寅透乙、卯透甲之类， 一亦不为过，太多则露矣。然而财旺生官，露亦不忌，盖露不忌，盖露以防劫，生官则劫退，譬如府库钱粮，有官守护，即使露白，谁敢劫之？如葛参政命，壬申、壬子、戊午、乙卯，岂非财露？唯其生官，所以不忌也。", "财格之贵局不一，有财旺生官者，身强而不透伤官，不混七煞，贵格也。", "有财用食生者，身强而不露官，略带一位比劫，益觉有情，如壬寅、壬寅、庚辰、辛巳，杨待郎之命是也。透官身弱，则格坏矣。", "有财格佩印者，盖孤财不贵，佩印帮身，即印取贵。如乙未、甲申、丙申、庚寅，曾参政之命是也，然财印宜相并，如乙未、己卯、庚寅、辛巳，乙与己两不相能，即有好处，小富而已。", "有用食而兼用印者，食与印两不相碍，或有暗官而去食护官，皆贵格也。如吴榜眼命，庚戌、戊子、戊子、丙辰，庚与丙隔两戊而不相克，是食与印不相碍也。如平江伯命，壬辰、乙巳、癸巳、辛酉，虽食印相克，而欲存巳戊官，是去食护官也。反是则减福矣。", "有财用伤官者，财不甚旺而比强，辂露一位伤官以化之，如甲子、辛未、辛酉、壬辰，甲透未库，逢辛为劫，壬以化劫生财，汪学士命是也，财旺无劫而透伤，反为不利，盖伤官本非美物，财轻透劫，不得已而用之。旺而露伤，何苦用彼？徒使财遇伤而死生官之具，安望富贵乎？", "有财带七煞者，或合煞存财，或制煞生财，皆贵格也，如毛状元命，乙酉、庚辰、甲午、戊辰，合煞存财也；李御史命，庚辰、戊子、戊寅、甲寅，制煞生财也。", "有财用煞印者，党煞为忌，印以化之，格成富局，若冬土逢之亦贵格。如赵侍郎命，乙丑、丁亥、乙亥，化煞而即以解冻，又不露财以杂其印，所以贵也。若财用煞印而印独，财煞并透，非特不贵，亦不富也。", "至于壬生午月，癸生巳月，单透财而亦贵，又月令有暗官也。如丙寅、癸巳、癸未、壬戌，林尚书命是也。又壬生巳月，单透财而亦贵，以其透丙藏戊，弃煞就财，美者存在赠者弃也。如丙辰、癸巳、壬戌、壬寅，王太仆命是也。", "至于劫刃太重，弃财就煞，如一尚书命，丙辰、丙申、丙午、壬辰，此变之又变者也。", "大运:", "  财格取运，即以财格所就之局，分而配之。其财旺生官者，运喜身旺印缓，不利七煞伤官；若生官而后透印，伤官之地 ，不甚有害。至于生官而带食破局，则运喜印绶，而逢煞反吉矣。", "  财用食生，财食重而身轻，则喜助身；财食轻而身重，则仍行财食。煞运不忌，官印反晦矣。 ", "  财格佩印，运喜官乡，身弱逢之，最喜印旺。", "  财用食印，财轻则喜财食，身轻则喜比印，官运有碍，煞反不忌也。", "  财带伤官，财运则亨，煞运不利，运行官印，未见其美矣。", "  财带七煞。不论合煞制煞，运喜食伤身旺之方。", "  财用煞印，印旺最宜，逢财必忌。伤食之方，亦任意矣。"

            ],
            "偏财格": [
                "财为我克，使用之物也，以能生官，所以为美。为财帛，为妻妾，为才能，为驿马，皆财类也。", "财喜根深，不宜太露，然透一位以清用，格所最喜，不为之露。即非月令用神，若寅透乙、卯透甲之类， 一亦不为过，太多则露矣。然而财旺生官，露亦不忌，盖露不忌，盖露以防劫，生官则劫退，譬如府库钱粮，有官守护，即使露白，谁敢劫之？如葛参政命，壬申、壬子、戊午、乙卯，岂非财露？唯其生官，所以不忌也。", "财格之贵局不一，有财旺生官者，身强而不透伤官，不混七煞，贵格也。", "有财用食生者，身强而不露官，略带一位比劫，益觉有情，如壬寅、壬寅、庚辰、辛巳，杨待郎之命是也。透官身弱，则格坏矣。", "有财格佩印者，盖孤财不贵，佩印帮身，即印取贵。如乙未、甲申、丙申、庚寅，曾参政之命是也，然财印宜相并，如乙未、己卯、庚寅、辛巳，乙与己两不相能，即有好处，小富而已。", "有用食而兼用印者，食与印两不相碍，或有暗官而去食护官，皆贵格也。如吴榜眼命，庚戌、戊子、戊子、丙辰，庚与丙隔两戊而不相克，是食与印不相碍也。如平江伯命，壬辰、乙巳、癸巳、辛酉，虽食印相克，而欲存巳戊官，是去食护官也。反是则减福矣。", "有财用伤官者，财不甚旺而比强，辂露一位伤官以化之，如甲子、辛未、辛酉、壬辰，甲透未库，逢辛为劫，壬以化劫生财，汪学士命是也，财旺无劫而透伤，反为不利，盖伤官本非美物，财轻透劫，不得已而用之。旺而露伤，何苦用彼？徒使财遇伤而死生官之具，安望富贵乎？", "有财带七煞者，或合煞存财，或制煞生财，皆贵格也，如毛状元命，乙酉、庚辰、甲午、戊辰，合煞存财也；李御史命，庚辰、戊子、戊寅、甲寅，制煞生财也。", "有财用煞印者，党煞为忌，印以化之，格成富局，若冬土逢之亦贵格。如赵侍郎命，乙丑、丁亥、乙亥，化煞而即以解冻，又不露财以杂其印，所以贵也。若财用煞印而印独，财煞并透，非特不贵，亦不富也。", "至于壬生午月，癸生巳月，单透财而亦贵，又月令有暗官也。如丙寅、癸巳、癸未、壬戌，林尚书命是也。又壬生巳月，单透财而亦贵，以其透丙藏戊，弃煞就财，美者存在赠者弃也。如丙辰、癸巳、壬戌、壬寅，王太仆命是也。", "至于劫刃太重，弃财就煞，如一尚书命，丙辰、丙申、丙午、壬辰，此变之又变者也。", "大运:", "  财格取运，即以财格所就之局，分而配之。其财旺生官者，运喜身旺印缓，不利七煞伤官；若生官而后透印，伤官之地 ，不甚有害。至于生官而带食破局，则运喜印绶，而逢煞反吉矣。", "  财用食生，财食重而身轻，则喜助身；财食轻而身重，则仍行财食。煞运不忌，官印反晦矣。 ", "  财格佩印，运喜官乡，身弱逢之，最喜印旺。", "  财用食印，财轻则喜财食，身轻则喜比印，官运有碍，煞反不忌也。", "  财带伤官，财运则亨，煞运不利，运行官印，未见其美矣。", "  财带七煞。不论合煞制煞，运喜食伤身旺之方。", "  财用煞印，印旺最宜，逢财必忌。伤食之方，亦任意矣。"

            ],
            "正印格": ["印绶喜其生身，正偏同为美格，故财与印不分偏正，同为一格而论之。印绶之格局亦不一，", "【有印而透官者】，正官不独取其生印，而即可以为用，与用煞者不同。故身旺印强，不愁太过，只要官星清纯", "      然亦有带伤食而贵者，则如朱尚书命，丙戌、戊戌、辛未、壬辰，壬为戊制，不伤官也。又如临淮侯命，乙亥、己卯、丁酉、壬寅，己为乙制，己不碍官也。 ", "【有印而用伤食者】，身强印旺，恐其太过，泄身以为秀气。如戊戌、乙卯、丙午、乙亥，李状元命也，若印浅身轻，而用层层伤食，则寒贫之局矣。 ", "【有用偏官者】，偏官本非美物，藉其生印，不得已而用之。故【必身重印轻，或身轻印重，有所不足，始为有情】。如茅状元命，己巳、癸酉、癸未、庚申，此身轻印重也。马参政命，壬寅、戊申、壬辰、壬寅，此身重印轻也。若身印并重而用七煞，非孤则贫矣。 ", "【有用煞而兼带伤食者】，则用煞而有制，生身而有泄，不论身旺印重，皆为贵格。", "【有印多而用财者】，印重身强，透财以抑太过，权而用之，只要根深，无防财破。如辛酉、丙申、壬申、辛亥，汪侍郎命是也。若印轻财重，又无劫财以救，则为贪财破印，贫贱之局也。 ", "即或印重财轻而兼露伤食，财与食相生，轻而不轻，即可就富，亦不贵矣。然亦有带食而贵者，何也？如庚寅、乙酉、癸亥、丙辰，此牛监薄命，乙合庚而不生癸，所以为贵，若合财存食，又可类推矣。如己未、甲戌、辛未、癸已，此合财存食之贵也。 ", "又有印而兼透官煞者，或合煞，或有制，皆为贵格。如辛亥、庚子、甲辰、乙亥，此合煞留官也；壬子、癸卯、丙子、己亥、此官煞有制也。", "至于化印为劫；弃之以就财官，如赵知府命，丙午、庚寅、丙午、癸巳，则变之又变者矣。", "更有印透七煞，而劫财以存煞印，亦有贵格，如庚戌、戊子、甲戌、乙亥是也。然此格毕竟难看，宜细详之。 ", "印格取运，即以印格所成之局，分而配之。", "   其印绶用官者，官露印重，财运反吉，伤食之方，亦为最利。", "   若用官而带伤食，运喜官旺印绶之乡，伤食为害，逢煞不忌矣。 ", "   印绶而用伤食，财运反吉，伤食亦利，若行官运，反见其灾，煞运则反能为福矣。", "   印用七煞，运喜伤食，身旺之方，亦为美地，一见财乡，其凶立至。", "   若用煞而兼带伤食，运喜身旺印绶之方，伤食亦美，逢官遇财，皆不吉也。 ", "   印绶遇财，运喜劫地，官印亦亨，财乡则忌。 ", "   其印格而官煞竞透，运喜食神伤官，印旺身旺，行之亦利。若再透官煞，行财运，立见其灾矣。", "   印用食伤，印轻者亦不利见财也。", "   其印绶用官者，官露印重，财运反吉，伤食之方，亦为最利。"],
            "偏印格": ["印绶喜其生身，正偏同为美格，故财与印不分偏正，同为一格而论之。印绶之格局亦不一，", "【有印而透官者】，正官不独取其生印，而即可以为用，与用煞者不同。故身旺印强，不愁太过，只要官星清纯", "      然亦有带伤食而贵者，则如朱尚书命，丙戌、戊戌、辛未、壬辰，壬为戊制，不伤官也。又如临淮侯命，乙亥、己卯、丁酉、壬寅，己为乙制，己不碍官也。 ", "【有印而用伤食者】，身强印旺，恐其太过，泄身以为秀气。如戊戌、乙卯、丙午、乙亥，李状元命也，若印浅身轻，而用层层伤食，则寒贫之局矣。 ", "【有用偏官者】，偏官本非美物，藉其生印，不得已而用之。故【必身重印轻，或身轻印重，有所不足，始为有情】。如茅状元命，己巳、癸酉、癸未、庚申，此身轻印重也。马参政命，壬寅、戊申、壬辰、壬寅，此身重印轻也。若身印并重而用七煞，非孤则贫矣。 ", "【有用煞而兼带伤食者】，则用煞而有制，生身而有泄，不论身旺印重，皆为贵格。", "【有印多而用财者】，印重身强，透财以抑太过，权而用之，只要根深，无防财破。如辛酉、丙申、壬申、辛亥，汪侍郎命是也。若印轻财重，又无劫财以救，则为贪财破印，贫贱之局也。 ", "即或印重财轻而兼露伤食，财与食相生，轻而不轻，即可就富，亦不贵矣。然亦有带食而贵者，何也？如庚寅、乙酉、癸亥、丙辰，此牛监薄命，乙合庚而不生癸，所以为贵，若合财存食，又可类推矣。如己未、甲戌、辛未、癸已，此合财存食之贵也。 ", "又有印而兼透官煞者，或合煞，或有制，皆为贵格。如辛亥、庚子、甲辰、乙亥，此合煞留官也；壬子、癸卯、丙子、己亥、此官煞有制也。", "至于化印为劫；弃之以就财官，如赵知府命，丙午、庚寅、丙午、癸巳，则变之又变者矣。", "更有印透七煞，而劫财以存煞印，亦有贵格，如庚戌、戊子、甲戌、乙亥是也。然此格毕竟难看，宜细详之。 ", "印格取运，即以印格所成之局，分而配之。", "   其印绶用官者，官露印重，财运反吉，伤食之方，亦为最利。", "   若用官而带伤食，运喜官旺印绶之乡，伤食为害，逢煞不忌矣。 ", "   印绶而用伤食，财运反吉，伤食亦利，若行官运，反见其灾，煞运则反能为福矣。", "   印用七煞，运喜伤食，身旺之方，亦为美地，一见财乡，其凶立至。", "   若用煞而兼带伤食，运喜身旺印绶之方，伤食亦美，逢官遇财，皆不吉也。 ", "   印绶遇财，运喜劫地，官印亦亨，财乡则忌。 ", "   其印格而官煞竞透，运喜食神伤官，印旺身旺，行之亦利。若再透官煞，行财运，立见其灾矣。", "   印用食伤，印轻者亦不利见财也。", "   其印绶用官者，官露印重，财运反吉，伤食之方，亦为最利。"],
            "食神格": ["食神本属泄气，以其能生正财，所以喜之。故食神生财，美格也。财要有根，不必偏正叠出，如身强食旺而财透，大贵之格。", "藏食露伤，主人性刚如丁亥、癸卯、癸卯、甲寅，沈路分命是也。偏正叠出，富贵不巨，职甲午、丁卯、癸丑、丙辰，龚知县命是也。", "夏木用财，火炎土燥，贵多就武。如己未、己巳、甲寅、丙寅，黄都督之命是也。", "若不用财而就煞印，最为威权显赫。如辛卯、辛卯、癸酉、己未，常国公命是也。若无印绶而单露偏官，只要无财，亦为贵格，如戊戌、壬戌、丙子、戊戌，胡会元命是也。", "若金水食神而用煞，贵而且秀，职丁亥、壬子、辛巳、丁酉，舒尚书命是也。至于食神忌印，夏火太炎而木焦，透印不碍，\n" +
                "如丙午、癸巳、甲子、丙寅，钱参政命是也。食神忌官，金水不忌，即金水伤官可见官之谓。", "至若单用食神，作食神有气，有财运则富，无财运则贫。", "更有印来夺食，透财以解，亦有富贵，须就其全局之势而断之。至于食神而官煞竞出，亦可成局，但不甚贵耳。", "更有食神合煞存财，最为贵格。", "至若食神透煞。本忌见财，而财先煞后，食以间之，而财不能党煞，亦可就贵。如刘提台命，癸酉、辛酉、己卯、乙亥是也。其余变化，不能尽述，类而推之可也。", "食神取运，即以食神所成之局，分而配之。", "  食神生财，财重食轻，则行财食，财食重则喜帮身。官煞之方，俱为不美。", "  食用煞印，运喜印旺，切忌财乡。身旺，食伤亦为福运，行官行煞，亦为吉也。", "  食伤带煞，喜行印绶，身旺，食伤亦为美运，财则最忌。若食太重而煞轻，印运最利，逢财反吉矣。", "  食神太旺而带印，运最利财，食伤亦吉，印则最忌，官煞皆不吉也。", "  若食神带印，透财以解，运喜财旺，食伤亦吉，印与官煞皆忌也。"
            ],
            "伤官格": ["伤官虽非吉神，实为秀气，故文人学士，多于伤官格内得之。而夏木见水，冬金见火，则又为秀之尤秀者也。其中格局比他格多，变化尤多，在查其气候，量其强弱，审其喜忌，观其纯杂，微之又微，不可执也。 ", "  故有伤官用财者，盖伤不利于民，所以为凶，伤官生财，则以伤官为生官之具，转凶为吉，故最利。只要身强而有根，便为贵格，如壬午、己酉、戊午、庚申，史春芳命也。", "  至于化伤为财，大为秀气，如罗状元命，甲子、乙亥、辛未、戊子，干头之甲，通根于亥，然又会未成局，化水为木，化之生财，尤为有情，所以伤官生财，冬金不贵，以冻水不能生木。若乃化木，不待于生，安得不为殿元乎？ ", "  至于财伤有情，与化伤为财者，其秀气不相上下，如秦龙图命，己卯、丁丑、丙寅、庚寅，已与庚同根月令是也。 ", "  有伤官佩印者，印能制伤，所以为贵，反要伤官旺，身稍弱，始为秀气。如孛罗平章命，壬申、丙午、申午、壬申、伤官旺，印根深，身又弱，又是夏木逢润，其秀百倍，所以一品之贵。然印旺极深，不必多见，偏正叠出，反为不秀，故伤轻身重而印绶多见，贫穷之格也。", "  有伤官兼用财印者，财印相克，本不并用，只要干头两清而不相碍；又必生财者，财太旺而带印，佩印者印太重而带财，调停中和，遂为贵格。如丁酉、己酉、戊子、壬子，财太重而带印，而丁与壬隔以戊已，两不碍，且金水多而觉寒，得火融和，都统制命也。又如壬戌、己酉、戊午、丁巳，印太重而隔戊已，而丁与壬不相碍，一丞相命也。反是则财印不并用而不秀矣。 ", "  有伤官用煞印者，伤多身弱，赖煞生印以邦身而制伤，如己未、丙子、庚子、丙子，蔡贵妃也。煞因伤而有制，两得其宜，只要无财，便为贵格，如壬寅、丁未、丙寅，夏阁老命是也。", "  有伤官用官者，他格不用，金水独宜，然要财印为辅，不可伤官并透。如戊申、甲子、庚午、丁丑，藏癸露丁，戊甲为辅，官又得禄，所以为丞相之格。若孤官无辅，或官伤并透，则发福不大矣。", "  若冬金用官，而又化伤为财，则尤为极秀极贵。如丙申、己亥、辛未、己亥，郑丞相命是也。 ", "  然亦有非金水而见官，何也？化伤为财，伤非其伤，作财旺生官而不作伤官见官，如甲子、壬申、己亥、辛未，章丞相命也。", "  至于伤官而官煞并透，只要干头取清，金水得之亦清，不然则空结构而已。", "伤官取运，即以伤官所成之局，分而配之。", "  伤官用财，财旺身轻，则利印比；身强财浅，则喜财运，伤官亦宜。 ", "  伤官佩印，运行官煞为宜，印运亦吉，伤食不碍，财地则凶。 ", "  伤官而兼用财印，其财多而带印者，运喜助印，印多而带财者，运喜助财。 ", "  伤官而用煞印，印运最利，伤食亦亨，杂官非吉，逢财即危。", "  伤官带煞，喜印忌财，然伤重煞轻，运喜印而财亦吉。惟七根重，则运喜伤食，印绶身旺亦吉，而逢财为凶矣。 ", "  伤官用官，运喜财印，不利食伤，若局中官露而财印两旺，则比劫伤官，未绐非吉矣。"
            ]
        }


        //自己先确认
        var dingge = {

            "甲寅": "建禄格",
            "甲卯": "阳刃格",
            "甲辰": "偏财格",
            "甲巳": "食神格",
            "甲午": "伤官格",
            "甲未": "正财格",
            "甲申": "七杀格",
            "甲酉": "正官格",
            "甲戌": "偏财格",
            "甲亥": "偏印格",
            "甲子": "正印格",
            "甲丑": "正财格",
            "乙寅": "建禄格",
            "乙卯": "建禄格",
            "乙辰": "正财格",
            "乙巳": "伤官格",
            "乙午": "食神格",
            "乙未": "偏财格",
            "乙申": "正官格",
            "乙酉": "七杀格",
            "乙戌": "正财格",
            "乙亥": "正印格",
            "乙子": "偏印格",
            "乙丑": "偏财格",
            "丙寅": "偏印格",
            "丙卯": "正印格",
            "丙辰": "食神格",
            "丙巳": "建禄格",
            "丙午": "阳刃格",
            "丙未": "伤官格",
            "丙申": "偏财格",
            "丙酉": "正财格",
            "丙戌": "食神格",
            "丙亥": "七杀格",
            "丙子": "正官格",
            "丙丑": "伤官格",
            "丁寅": "正印格",
            "丁卯": "偏印格",
            "丁辰": "伤官格",
            "丁巳": "建禄格",
            "丁午": "建禄格",
            "丁未": "食神格",
            "丁申": "正财格",
            "丁酉": "偏财格",
            "丁戌": "伤官格",
            "丁亥": "正官格",
            "丁子": "七杀格",
            "丁丑": "食神格",
            "戊寅": "七杀格",
            "戊卯": "正官格",
            "戊辰": "建禄格",
            "戊巳": "偏印格",
            "戊午": "正印格",
            "戊未": "建禄格",
            "戊申": "食神格",
            "戊酉": "伤官格",
            "戊戌": "建禄格",
            "戊亥": "偏财格",
            "戊子": "正财格",
            "戊丑": "建禄格",
            "己寅": "正官格",
            "己卯": "七杀格",
            "己辰": "建禄格",
            "己巳": "正印格",
            "己午": "偏印格",
            "己未": "建禄格",
            "己申": "伤官格",
            "己酉": "食神格",
            "己戌": "建禄格",
            "己亥": "正财格",
            "己子": "偏财格",
            "己丑": "建禄格",
            "庚寅": "偏财格",
            "庚卯": "正财格",
            "庚辰": "偏印格",
            "庚巳": "七杀格",
            "庚午": "正官格",
            "庚未": "正印格",
            "庚申": "建禄格",
            "庚酉": "阳刃格",
            "庚戌": "偏印格",
            "庚亥": "食神格",
            "庚子": "伤官格",
            "庚丑": "正印格",
            "辛寅": "正财格",
            "辛卯": "偏财格",
            "辛辰": "正印格",
            "辛巳": "正官格",
            "辛午": "七杀格",
            "辛未": "偏印格",
            "辛申": "建禄格",
            "辛酉": "建禄格",
            "辛戌": "正印格",
            "辛亥": "伤官格",
            "辛子": "食神格",
            "辛丑": "偏印格",
            "壬寅": "食神格",
            "壬卯": "伤官格",
            "壬辰": "七杀格",
            "壬巳": "偏财格",
            "壬午": "正财格",
            "壬未": "正官格",
            "壬申": "偏印格",
            "壬酉": "正印格",
            "壬戌": "七杀格",
            "壬亥": "建禄格",
            "壬子": "阳刃格",
            "壬丑": "正官格",
            "癸寅": "伤官格",
            "癸卯": "食神格",
            "癸辰": "正官格",
            "癸巳": "正财格",
            "癸午": "偏财格",
            "癸未": "七杀格",
            "癸申": "正印格",
            "癸酉": "偏印格",
            "癸戌": "正官格",
            "癸亥": "建禄格",
            "癸子": "建禄格",
            "癸丑": "七杀格",
        };

       

        //定格局诀
        var dinggeju = {
            "甲寅": ["甲日寅月是建禄"],
            "甲卯": ["卯月羊刃可堪凭"],
            "甲辰": ["三月财星藏辰库"],
            "甲巳": ["巳为食神财暗伏"],
            "甲午": ["午月丁火伤官格"],
            "甲未": ["未月杂气取财星"],
            "甲申": ["七月申提七杀论"],
            "甲酉": ["酉为正气官星得"],
            "甲戌": ["九月戌中惟杂气"],
            "甲亥": ["十月偏印格局真"],
            "甲子": ["十一月取正印格"],
            "甲丑": ["丑中杂气仔细详"],
            "乙寅": ["乙曰寅月号伤官"],
            "乙卯": ["卯为建禄格中真"],
            "乙辰": ["三月财官俱杂气"],
            "乙巳": ["巳中伤官财星端"],
            "乙午": ["午提丁火食神格"],
            "乙未": ["未中杂气曰财官"],
            "乙申": ["申月正气官星论"],
            "乙酉": ["八月酉中作杀推"],
            "乙戌": ["戌内财官俱杂气"],
            "乙亥": ["亥月正印便扶身"],
            "乙子": ["子癸之中偏印是"],
            "乙丑": ["杂气推来在丑中"],
            "丙寅": ["丙日逢寅偏印生"],
            "丙卯": ["卯月正印喜官星"],
            "丙辰": ["辰初杂气用食神"],
            "丙巳": ["巳中定取建禄格"],
            "丙午": ["午火羊刃又伤官"],
            "丙未": ["未取伤官宜伤尽"],
            "丙申": ["申是偏财喜旺神"],
            "丙酉": ["酉月财旺生官格"],
            "丙戌": ["戌上杂气为食神"],
            "丙亥": ["亥月偏印七杀真"],
            "丙子": ["子中正官宜官旺"],
            "丙丑": ["丑宫分明杂气生"],
            "丁寅": ["丁日寅提正印评"],
            "丁卯": ["卯上偏印格局真"],
            "丁辰": ["辰初杂气末伤官"],
            "丁巳": ["巳上伤官便生财"],
            "丁午": ["午中建禄分明取"],
            "丁未": ["未月食神独可嗔"],
            "丁申": ["申内正财生官格"],
            "丁酉": ["酉月偏财可追寻"],
            "丁戌": ["戌中杂气未伤官"],
            "丁亥": ["亥月正官及正印"],
            "丁子": ["子月偏官七杀真"],
            "丁丑": ["丑月杂气是财官"],
            "戊寅": ["戊藏寅月杀拘印"],
            "戊卯": ["卯是正官寻贵气"],
            "戊辰": ["辰内杂气财官格"],
            "戊巳": ["巳上亦取号建禄"],
            "戊午": ["午月刃取正印格"],
            "戊未": ["未上杂气作官印"],
            "戊申": ["七月食神生财旺"],
            "戊酉": ["八月伤官喜遇财"],
            "戊戌": ["戌中杂气分明取"],
            "戊亥": ["亥月财杀格中真"],
            "戊子": ["子提正财生官格"],
            "戊丑": ["丑上杂气号财官"],
            "己寅": ["己生寅月正官印"],
            "己卯": ["卯推七杀便是真"],
            "己辰": ["辰是杂气取财官"],
            "己巳": ["巳中正印格可清"],
            "己午": ["午中建禄居此位"],
            "己未": ["未土杂气借财杀"],
            "己申": ["申月伤官真论此"],
            "己酉": ["酉中食神亦可寻"],
            "己戌": ["戌月借取杂气格"],
            "己亥": ["亥上正财生官格"],
            "己子": ["子月偏财明怕劫"],
            "己丑": ["丑月杂气取财官"],
            "庚寅": ["庚到寅宫评财杀"],
            "庚卯": ["卯月正财便生官"],
            "庚辰": ["辰初杂气用偏印"],
            "庚巳": ["巳火七杀号偏官"],
            "庚午": ["午月炎天寻正官"],
            "庚未": ["未中杂气用正印"],
            "庚申": ["申中便取建禄格"],
            "庚酉": ["酉用羊刃格中寻"],
            "庚戌": ["戌中杂气用偏印"],
            "庚亥": ["亥上食神喜身强"],
            "庚子": ["子月伤官真可论"],
            "庚丑": ["丑中只可作杂气"],
            "辛寅": ["辛日寅财旺生官"],
            "辛卯": ["卯月偏财是福基"],
            "辛辰": ["辰是杂气未正印"],
            "辛巳": ["巳上正官及正印"],
            "辛午": ["午月偏官喜枭神"],
            "辛未": ["未取杂气用偏印"],
            "辛申": ["申月借取伤官格"],
            "辛酉": ["酉是建禄怕逢冲"],
            "辛戌": ["戌中杂气戊是印"],
            "辛亥": ["亥日伤官喜见财"],
            "辛子": ["子月之中求食神"],
            "辛丑": ["丑上下旬论偏印"],
            "壬寅": ["壬逢寅地号食神"],
            "壬卯": ["卯上见印取伤官"],
            "壬辰": ["辰是杂气为七杀"],
            "壬巳": ["巳取偏财并偏官"],
            "壬午": ["午月财官正两全"],
            "壬未": ["未上杂气取财官"],
            "壬申": ["申月偏印无别论"],
            "壬酉": ["酉取正印怕逢财"],
            "壬戌": ["戌月杂气为七杀"],
            "壬亥": ["亥末建禄用食神"],
            "壬子": ["子月之中羊刃格"],
            "壬丑": ["丑中杂气是财官"],
            "癸寅": ["癸日寅月取伤官"],
            "癸卯": ["卯月食神定是真"],
            "癸辰": ["辰中杂气是正官"],
            "癸巳": ["巳月正财官便是"],
            "癸午": ["午月偏财又偏官"],
            "癸未": ["六月杂气是七杀"],
            "癸申": ["申月正印怕逢寅"],
            "癸酉": ["酉月偏印忌见比"],
            "癸戌": ["戌中杂气是财官"],
            "癸亥": ["亥月借取伤官格"],
            "癸子": ["子中建禄定其真"],
            "癸丑": ["丑中杂气为七杀"],
        };


        //四明丁丑版 栏江网
        var lanjiangwang = {

            "甲寅": ["木值春生，乃欣欣向荣之象。", "期届寅正，犹凛凛凝寒之气。", "干有丙火，冠盖可比王谢。", "兼透癸水，鼎钟出于贵戚。", "岁于癸而时干丙，厥是南宫名宿。", "年月丙而时见癸，可称东观英才。", "四柱庚辛会局，不免鼓盆之凄，丧朋之痛。", "满盘壬癸无制，定有封甑之尘，豈尽天年。", "无庚透丁，才智如春耕营室。", "有丁见癸，迂执同夏虫语冰。", "支成火局泻气多，虽耿直亦愚鲁带疾。", "柱多癸水火神灭，李义府藏笑中之刀。", "亥卯未全，得庚为贵，失庚为闲。", "申子辰备，得庚为贵，无戊则贫。"],
            "甲卯": ["时透庚金运逢财，弹筝祝寿。", "干遇癸水用受困，吹箫乞量。"],
            "甲辰": ["透庚并透壬，廟廊决策。", "有壬并有癸，黌宇论文。", "柱有戊己支局土，无水混淆，堪羡從财有托。", "干见二丙支藏庚，用神暗损，可叹祖业无归。"],
            "甲巳": ["先用癸而后用丁，若遇庚金嫌太多，壬透可解", "柱无壬又无丁庚，只见丙戊或辛金，命不逢辰", "一庚二丙，课耕督织。", "癸丁齐庚，出仕知名。", "藏癸露庚丁，纳粟拜爵。", "透壬并庚丁，营运起家。"],
            "甲午": ["透癸又透庚，官迁显秩。", "叠丙又逢丁，历任封疆。", "干多庚，透出丙丁或壬癸，诚良工琢玉。", "柱叠金，若无克制反生扶，乃痴钝寒蝇。", "壬水高透运逢印，贫夭相继。", "甲己双合支有辰，富贵可期。", "二己合一甲，男主蓬飘逐水。", "两女争一夫，女主杨花舞风。"],
            "甲未": ["先有丁而后有庚，为凌风之秋鹗。", "既逢丁而再逢癸，乃啼月之寒鸟。"],
            "甲申": ["入秋之甲，偏宜阴火。", "带火之木，兼爱阳金。", "行运復背逐，亦清贫之辈。"],
            "甲酉": ["丁庚高透，留官为贵。", "癸水若见，克火无功。", "透丙不见癸，食神得力。", "透丙若见丁，门户自毁。", "有丙又有庚，可射利于江淮。", "无丁兼无丙，乃托钵于沙门。", "支会巳丑干有庚，膏肓暗藏二堅子。", "干露丙火逢见癸，茅塞不开一愚人"],
            "甲戌": ["丁壬癸同透，若见戊已，如鱼躍龙门。", "火水土全备，旺扶庚金，乃画龙点睛。", "比肩无庚制，为白丁之士。", "行运復背逐，亦清贫之辈。"],
            "甲亥": ["庚丁逢戊，贵为元首。", "庚戊缺丁，富而期颐。", "见壬不见戊，到处寻寻觅觅。", "支有申亥干戊己，小贵可取。", "见戊又透甲，终日戚戚。", "苟无戊土只有己，大福难载。"],
            "甲子": ["庚丁得寅巳，见戊兮，高攀桂苑之枝。", "癸水伤丁火，无土兮，常染连绵之疾。", "重重壬水无丁合，蛙居井底。", "支会水局飘木去，魂寄客舍。"],
            "甲丑": ["庚丁透天干，戎装赫奕。", "丁火藏地支，儒服斯文。", "丁火重重比肩透。缙绅子弟。", "独木磷磷火多，田舍公郎。"],
            "乙寅": ["得丙以生香，得癸以润色。", "癸多丙少，学虽优终贫。", "丙多癸少，田舍翁俗富。", "有丙不见癸，每多快意。", "有癸若见己，反苦羁身。"],
            "乙卯": ["透丙露癸不见官，门迎三千珠履。", "无杀有印独透庚，屏列十二金钗。", "一丙一癸亥未全，龙门显达。", "若水若火戊土多，雪窗孤寒。"],
            "乙辰": ["先癸而后丙，无己庚者，美才鹊起。", "露丙兼透戊，成水局者，景运鸿升。", "己庚混丙癸，家无宿量。", "无己独有庚，圃有桑麻。", "月时并见庚辰，穷途落魄。", "岁干透出丁火，虎帐请缨。"],
            "乙巳": ["癸水潺潺齐庚辛，眉飞双彩。", "丙戊重重支火局，两目无瞳。", "丙癸得甲以制戊，游庠食粟。", "丙辛居未以化水，荒唐倾家。"],
            "乙午": ["至前阳极，先癸后丙。", "至后阴生，丙癸并用。", "年庚辛而时癸水，位列三台。", "得官杀而失印绶，难拾一芹。", "痼疾缠身，丙透干而支合火。", "侥幸获救，癸当头而或见壬。"],
            "乙未": ["柱多金水支本局，得癸则显，缺癸则困。", "杂乱戊己干透土，有比则吉，无比则凶。", "土多不见甲，难钟灵秀。", "丁透无丙癸，终是凡庸。", "丙癸得甲以制戊，游庠食粟。", "丙辛居未以化水，荒唐倾家。"],
            "乙申": ["申庚当令，己土为宜。", "透癸蔵丙，乃文书之士。", "透癸无丙，为刀笔之吏。", "支无丙己多庚癸，老死户牖。", "时落庚辰化乙木，少人公卿。"],
            "乙酉": ["时在白露前，专用癸水为宜。", "节届秋分后，当以丙火为尊。", "癸丙齐透，关中秉銊。", "水火俱无，林下投簪。", "透癸无壬，一生衣食无缺。", "局金蔵丁，中年名利有成。", "干齐丙丁并透戊，功名得之异路。", "柱有癸水时透丙，文章入于词林。", "透丙无癸，稍能如意。", "透癸无丙，决不称心。"],
            "乙戌": ["干透癸辛杀印显，无癸则辱，无辛则贱。", "柱包戊己财星透，无劫则富，有劫别贫。"],
            "乙亥": ["干透丙戊无刑冲，名重四方。", "支多阳火入南离，声振寰宇。", "有丙无戊，身入儒林为伍。", "无丙无己，殃及妻子可悲。"],
            "乙子": ["支藏阳火透双丙，若无癸水，可得恩封末秩。", "干透壬癸支局水，倘无火土，必受饥寒终身。", "独丁难解寒冻，若重重阴火，反成奸滑且多子。", "壬癸消尽火气，倘支多水象，若非天折即孤寒。"],
            "乙丑": ["一丙高悬无刑克，九重命驾。", "若失丙兮，则丧车引发。", "众已满柱无比劫，千倾连陌。", "倘运夺兮，贫无立錐之地。"],
            "丙寅": ["丙火得寅为可贵，壬庚透干为最奇。", "透庚支藏壬，损职迁爵。", "透壬支藏庚，异路求名。", "壬多丙少有戊藏，凶顽变吉。", "杀重身轻无土制，刁恶不悛。", "年时皆是辛，登徒色艺。", "戊多不见甲，酸馁气冲。"],
            "丙卯": ["透壬有根，名高望重。", "透己无壬，衣暖食丰。", "日坐丙子時辛卯，败尽祖业。", "丁破辛金存壬水，超出人群。"],
            "丙辰": ["壬甲透天干，蟾宫稳步。", "庚金破甲木，麟阁难登。", "壬透甲藏，富有金帛。", "甲透壬缺，蝇头觅利。", "藏壬无甲者，少年落魄。", "无壬无甲者，百业无踪。"],
            "丙巳": ["壬庚透丁无刑冲，恩荫袭爵。", "天干无水成孤阳，金榜除名。", "见庚并见癸，白玉为堂金作屋。", "无癸又无壬，寒门流雀户流萤。", "丙叠叠兮无壬，早登泉路。", "火炎炎而失水，幼入空门。"],
            "丙午": ["壬庚两透，才如囊中脱颕。", "戊己混壬，功至幕下请缨。", "杂乱火土若逢癸，乃盲目之孤独。", "满盘丙丁不见水，为削发之尼僧。", "干露庚金逢癸水，财殊富厚。", "齐透甲乙背西北，家素高明。"],
            "丙未": [
                "有壬并庚，乃陨风劲鸟。", "见戊缺壬，乃失水子巨鳞。", "透壬无庚戊，辉联奎壁。", "得戊制壬水，器宇条畅。"
            ],
            "丙申": [
                "壬戊齐天干，为九苞之灵凤。", "一土化众水，是千里之神驹。", "杀众不见戊，定朝秦而暮楚。", "戊多少见壬，乃意马而心猿。", "(财格最忌见杀 现在杀旺而没有制 合 不从杀 则贫苦之人 朝秦而暮楚：比喻人反复无常，没有原则。亦比喻行踪不定或生活不安定)"
            ],
            "丙酉": [
                "四柱多丙，壬透可披青矜。", "地支藏壬，隐杀终是白衣。", "见辛合丙兮，幼饥寒而老贫苦。", "遇丁制辛兮，男好诈而女淫贱。"
            ],
            "丙戌": [
                "丙衰三秋透甲壬，龙城飞将。", "火近重阳透甲癸，虎帐骁骑。", "庚戊困木水，三灵降谴。", "壬癸兼庚辛，二堅施灾。"
            ],
            "丙亥": [
                "甲戊并透兼有庚，掇魏科如拾芥。", "辛金高透支带辰，取高第似探囊。"
            ],
            "丙子": [
                "一阳来復，壬戊同济。", "三冬送旧，水土有功。", "多壬少土，只可随声附影。", "得甲济戊，到处遼志适情。", "无戊见己，也是出类拔萃。", "多壬无甲，定然特殊超群。", "与丑月同"
            ],
            "丙丑": [
                "一阳来復，壬戊同济。", "三冬送旧，水土有功。", "多壬少土，只可随声附影。", "得甲济戊，到处遼志适情。", "无戊见己，也是出类拔萃。", "多壬无甲，定然特殊超群。", "与子月同"
            ],
            "丁寅": [
                "甲木透干，乃燃灯添油。", "金水列柱，为洗釜调羹。", "天干并见丁壬，男命得之极贵。", "四柱透出金水，，己土制之有功。", "全甲无庚，众母养成骄子。", "全水无金，众鬼侮辱病躯。"
            ],
            "丁卯": [
                "先财后取印，火金比华。", "透庚又透甲，风月有情。", "透庚藏甲，求名如在蜗角。", "透甲藏庚，觅利可获蝇头。", "官印财食遇杀旺，运入西北，如浓霜盖雪。", "庚辛壬甲要己藏，运至东南，乃光日穿云。"
            ],
            "丁辰": [
                "阳壬独透支局水，云泉遗憾。", "戊己并出柱无冲，轩冕希荣。"
            ],
            "丁巳": [
                "见甲透庚兮，乃席间之吉士。", "见癸破格兮，为堂下之走仆。", "庚戊同透不见申，盈门车马。", "阳土独出无水木，满腹经纶。", "多木多水，两足何曾闲逸。", "多丙无水，一身奚得从容。", "二丁一丙出天干，封侯万里。", "二巳一午见地支，食禄千钟。"
            ],
            "丁午": [
                "有庚有壬带寅戌，命贵龙姿。", "无刑无冲透癸水，万里封侯。", "丁日丙时无滴水，梵利宣教。", "木生金助有壬癸，帷幄运筹。"
            ],
            "丁未": [
                "透甲会木支藏水，文章惊人。", "多水弱火柱无木，终生庸碌。"
            ],
            "丁申": [
                "干透甲丙支有庚，男多荣贵。", "柱明木火支藏金，女多财帛。"
            ],
            "丁酉": [
                "干见甲庚丙，名立千古。", "柱无刑害破，威震三台。"
            ],
            "丁戌": [
                "甲庚并透，利比陶公。", "丙火兼加，名齐萧曹。", "庚丙壬无甲，志存三千逍遥。", "壬癸水有戊，势成独立擎天。", "透丁透辛不透庚，名曰从财。", "见壬见癸不见戊，号为离魂。"
            ],
            "丁亥": [
                "三冬丁火，凭取甲木。", "凌寒之烛，全赖灯油。", "丙火夺丁无光，藏壬可解。", "甲庚济火有助，见己无功。", "厥命清贵，因支藏有金水。", "年月透癸时逢辛，乃金枝玉叶。", "年月透癸支局木，必袭爵誥封。", "有水无金，司书簿吏。", "有财兼印，达官名臣。", "丁火十月、十一月、十二月论相同"
            ],
            "丁子": [
                "三冬丁火，凭取甲木。", "凌寒之烛，全赖灯油。", "丙火夺丁无光，藏壬可解。", "甲庚济火有助，见己无功。", "厥命清贵，因支藏有金水。", "年月透癸时逢辛，乃金枝玉叶。", "年月透癸支局木，必袭爵誥封。", "有水无金，司书簿吏。", "有财兼印，达官名臣。", "丁火十月、十一月、十二月论相同"
            ],
            "丁丑": [
                "三冬丁火，凭取甲木。", "凌寒之烛，全赖灯油。", "丙火夺丁无光，藏壬可解。", "甲庚济火有助，见己无功。", "厥命清贵，因支藏有金水。", "年月透癸时逢辛，乃金枝玉叶。", "年月透癸支局木，必袭爵誥封。", "有水无金，司书簿吏。", "有财兼印，达官名臣。", "丁火十月、十一月、十二月论相同"
            ],
            "戊寅": [
                "有丙无甲癸，乃春旱不毛。", "无丙有甲癸，是枯寒无成。", "多丙透甲不见癸，晚岁通达。", "有火会局无滴水，一世孤寒。", "甲庚两透会木局，厥为英豪，兼且荣显。", "杀神独出无比食，若非贼盗，亦多灾横。", "戊土一月、二月论同"
            ],
            "戊卯": [
                "有丙无甲癸，乃春旱不毛。", "无丙有甲癸，是枯寒无成。", "多丙透甲不见癸，晚岁通达。", "有火会局无滴水，一世孤寒。", "甲庚两透会木局，厥为英豪，兼且荣显。", "杀神独出无比食，若非贼盗，亦多灾横。", "戊土一月、二月论同"
            ],
            "戊辰": [
                "甲癸高透，宦途轻捷。", "甲癸暗藏，家业绍兴。", "多丙无癸，如春苗顿失泉水。", "透水制火，乃秋麻骤逢甘霖。", "甲乙透干支会水，见庚则富。", "见火则贵，无庚无火必贫乏。", "壬癸露干支火局，有逸而荣。", "有劳而功，分逸分劳俱亨通。"
            ],
            "戊巳": [
                "甲丙伴戊，秩终五马。", "水火济土，名著四海。", "透癸藏壬，乃汾阳之贵，季伦之富。", "局金透癸，有祖逖之志，定远之功。"
            ],
            "戊午": [
                "壬甲齐干年透辛，处公侯加坐任席。", "阳水独透支会火，取功名如反指掌。"
            ],
            "戊未": [
                "透癸透丙，青云起地。", "无癸透丙，陈粟满仓。", "癸带甲无丙，优闲自保。", "癸与辛齐透，奇僬得功。", "多土透甲不见金，独杀得权。", "无丙无辛兼无甲，一盘皆空。"
            ],
            "戊申": [
                "丙癸甲全，拜恩盈室。", "丙癸甲无，托足无门。", "丙甲两透支有辰，拾得昆山之玉。", "水木齐干木无火，逍遥严陵之泮。"
            ],
            "戊酉": [
                "干见丙癸者吉，柱无水火者凶。", "丙藏癸透，一生安逸。", "火暗水绝，百事蹉跎。", "辛多无火，见癸则发。", "土弱于酉，得火方兴。"
            ],
            "戊戌": [
                "透甲兮足食，透癸亦称心。", "干有壬癸支局水，见比劫而反富。", "干有金水支会火，无癸水而遭殃。"
            ],
            "戊亥": [
                "财官两得。乃天干甲丙明透。", "鳌头独占，因地支壬水暗藏。", "狮座韬辉，只因柱少丙甲。", "虎榜標名，盖因木暗火明。"
            ],
            "戊子": [
                "丙甲双透者，为夺魁之客。", "木暗火明者，作入幕之宾。", "有甲若无丙，贫而有廉。", "透丙不见甲，富而成仁。", "多丙透壬，白凤吐氲氤佳气。", "多丙无壬，幽兰遇败逐秋风。", "戊土十一月、十二月同"
            ],
            "戊丑": [
                "丙甲双透者，为夺魁之客。", "木暗火明者，作入幕之宾。", "有甲若无丙，贫而有廉。", "透丙不见甲，富而成仁。", "多丙透壬，白凤吐氲氤佳气。", "多丙无壬，幽兰遇败逐秋风。", "戊土十一月、十二月同"
            ],
            "己寅": [
                "气寒地冻，须阳火为解。", "水冷冰结，得戊土可医。", "洪泛欺土，多贫贱夭折。", "折陵止水，乃高贵清奇。", "甲庚癸丙，得中和之道。", "刑冲克害，乃破格之神。", "火多不见水，富比王侯。", "甲多无庚丁，病同相加。"
            ],
            "己卯": [
                "甲癸忌合，水木宜春。", "兼丙兮禄食上卿，见壬兮级降末等。", "甲受庚制，体无雅骨。", "壬被土伤，面满俗气。"
            ],
            "己辰": [
                "干透丙癸甲，郭令公一身系天下。", "柱无刑冲破，狄人杰独力匡朝廷。", "透癸无丙甲，终日书空咄咄。", "无甲有丙灵，毕竟文质彬彬。", "满堂金玉，干有丙甲而无癸。", "尘封釜甑，柱少水火共木神。"
            ],
            "己巳": [
                "癸丙同透兼有辛，季子印佩六国。", "癸丙同透兼有辛，季子印佩六国。", "丁火克辛并多丙，颜回穷居陋巷。。", "无丙曰孤阴不发，无癸曰亢旱不生。", "己土四月、五月、六月同论"
            ],
            "己午": [
                "癸丙同透兼有辛，季子印佩六国。", "癸丙同透兼有辛，季子印佩六国。", "丁火克辛并多丙，颜回穷居陋巷。。", "无丙曰孤阴不发，无癸曰亢旱不生。", "己土四月、五月、六月同论"
            ],
            "己未": [
                "癸丙同透兼有辛，季子印佩六国。", "癸丙同透兼有辛，季子印佩六国。", "丁火克辛并多丙，颜回穷居陋巷。。", "无丙曰孤阴不发，无癸曰亢旱不生。", "己土四月、五月、六月同论"
            ],
            "己申": [
                "三秋田土，用丙以暖，用癸以润。", "四库全支，透甲者富，无甲者贫。", "有丙兼有癸，文坛飞将。", "有丙若无癸，武科受官。", "干透壬癸柱无丙，食粟常满。", "支成金局干透癸，福利无穷。", "己土七月、八月、九月同论"
            ],
            "己酉": [
                "三秋田土，用丙以暖，用癸以润。", "四库全支，透甲者富，无甲者贫。", "有丙兼有癸，文坛飞将。", "有丙若无癸，武科受官。", "干透壬癸柱无丙，食粟常满。", "支成金局干透癸，福利无穷。", "己土七月、八月、九月同论"
            ],
            "己戌": [
                "三秋田土，用丙以暖，用癸以润。", "四库全支，透甲者富，无甲者贫。", "有丙兼有癸，文坛飞将。", "有丙若无癸，武科受官。", "干透壬癸柱无丙，食粟常满。", "支成金局干透癸，福利无穷。", "己土七月、八月、九月同论"
            ],
            "己亥": [
                "见火则不孤，有戊则不贫。", "有丙兼有甲，博望侯兰薰桂馥。", "多壬若透戊，常山王玉润金声。", "己土十月、十一月、十二月 同论"
            ],
            "己子": [
                "见火则不孤，有戊则不贫。", "有丙兼有甲，博望侯兰薰桂馥。", "多壬若透戊，常山王玉润金声。", "己土十月、十一月、十二月 同论"
            ],
            "己丑": [
                "见火则不孤，有戊则不贫。", "有丙兼有甲，博望侯兰薰桂馥。", "多壬若透戊，常山王玉润金声。", "己土十月、十一月、十二月 同论"
            ],
            "庚寅": [
                "丙甲两透，文章盖世。", "丙藏甲透，弱冠功名。", "土多甲藏，田连阡陌。", "土多甲透，官阶贵胄。", "透丁有土不见水，官籍万斛。", "见金伤木若带火，家业千金。", "透壬有根支局火，才倾士衡。", "支会午戌柱无水，疾叹伯牛。"
            ],
            "庚卯": [
                "丙辛丁齐干，支多水木，乃贵而无子。", "阴火暗生支，干透丁甲，为官而有权。"
            ],
            "庚辰": [
                "双透甲丁，占鹊噪晨檐之喜。", "一逢比肩，有鹃啼暮树之悲。", "支藏甲丁兼藏丙，弃儒生而冠鹤盖。", "干透癸水支局火，题柱客驷马高车。", "透丁藏甲，班定远投笔而起。", "透丁无甲，刘去华下第而归。", "透甲无丁，求名如登蜀道。", "甲丁俱无，谋利若涉瞿塘。"

            ],
            "庚巳": [
                "水火土全备，官至棘寺。", "壬丙戊透干，节驻柏台。", "干多丙火，透壬则荣，失壬则辱。", "支藏庚辛，露丁则富，无丁则贫。"
            ],
            "庚午": [
                "透壬藏癸兼庚辛，唾珠扬名。", "透癸露辛无冲克，投笔占功。", "四柱无壬癸，困龙失水。", "干头出戊己，枯树生华。"
            ],
            "庚未": [
                "有官有财，另成气象。", "透丁透甲，异样风光。", "丁甲不齐，命如哀猿啼峡。", "丁甲不见，悲似孤鹤唳空。"
            ],
            "庚申": [
                "干透丁甲无壬癸，经纶满腹。", "支成水局无木火，愚笨不发。"
            ],
            "庚酉": [
                "丁甲丙齐无刑冲，文相武师。", "孤丁独透多藏丙，名就利成。"
            ],
            "庚戌": [
                "频邀引荐，甲壬须无合无克。", "歌赋鹿鸣，甲壬或有明有暗。", "有甲无壬，才逼太白敌手。", "有壬无甲，识同愚叟移山。", "戊多埋金无甲壬，倾荡祖业。", "支若局水透丙火，首选文坛。"
            ],
            "庚亥": [
                "丁甲透干，琼林赐宴。", "丙火藏支，金殿传胪。", "藏丁透甲，惠兰美质。", "无丁透丙，瓦砾庸才。"
            ],
            "庚子": [
                "干透丁甲支藏丙，平步丹墀，若无丙火居未秩。", "柱无丙丁支会水，丰隆衣食，因伤官星少儿孙。", "有丁无甲，可富可贵。", "有甲无丁，且贱且贫。", "透甲藏丁，车马驰逐。", "藏丁透丙，飞骑金勒。"
            ],
            "庚丑": [
                "丙丁甲齐，世家望重。", "丁甲无丙，才士名扬。", "透丙无甲丁，纨绔得爵。", "无甲透丙丁，白手成家。"
            ],
            "辛寅": [
                "干透己壬支藏庚，秦庭献策。", "柱无己庚干透土，吴市吹箫。", "火局透庚壬，玉山映照。", "藏甲透己土，珠浦联辉。"
            ],
            "辛卯": [
                "壬甲透干无冲破，高侍卫一箭双雕。", "壬水藏支不透土，陶朱公三致千余。"
            ],
            "辛辰": [
                "壬甲两透，门庭车水马龙。", "壬甲俱无，窗户蛛丝燕泥。", "透壬藏甲，腴田接攘。", "透甲藏壬，茂才联名。", "四柱丙丁无壬癸，枯禅寂寂。", "一滴癸水以济火，蝇头营利。"
            ],
            "辛巳": [
                "干透壬癸无刑冲，主人挾贵。", "支藏壬癸及戊己，千里趋荣。", "透火无水，寂寂空帏叹无儿。", "得甲相救，恂恂乡里学神仙。"
            ],
            "辛午": [
                "干透己壬支藏癸，泥金捷报。", "柱无壬水只透己，玉徇参斑。"
            ],
            "辛未": [
                "壬癸露天无刑冲，闻声中外。", "壬己透干带庚金，名震公卿。", "透戊无甲，乃寒酸之子。", "透庚见甲，是庸贱之人。"
            ],
            "辛申": [
                "柱多金水得戊甲，琼林宴会。", "干透戊土无甲木，釜甑尘封。"
            ],
            "辛酉": [
                "透壬无火见庚甲，官拜冕旒。", "见丁兮，蝇头索利。", " 透壬叠戊重比肩，身沐风雨。", " 见甲兮，白手成家。", "透壬叠辛，才贯洛阳。", " 会巳丑局，名重都中。"
            ],
            "辛戌": [
                "壬戊暗藏干透甲，龙门挾策。", "甲壬并齐出天干，帝阙谈经。"
            ],
            "辛亥": [
                "壬丙同透，香芹能掇。", "壬透丙藏，陈仓常盈。", "壬戊同透，丰衣足食。", "有壬无戊，四海飘零。"
            ],
            "辛子": [
                " 戊癸绝迹透壬丙，春闱题名。", "若见戊癸，便成春梦之叹。", "戊甲丙显多壬水，秋榜题名。", " 若无丙戊，反感三秋之悲。"
            ],
            "辛丑": [
                "丙壬两透，吉士联登黄甲。", " 丙壬俱无，秀才难上青云。", "透丙无壬，仓内堪积隨谷。", "透壬无丙，釜中可数游鱼。", "阳火煨珠玉，一水便能致富。", "多丙无克制，透癸定可起家。"
            ],
            "壬寅": [
                "天干庚戊丙，乃五陵之裘马。", "四柱多戊土，拜万阅之衣冠。", "僅有金土，高士原多卓识。", "不见庚戊，常人鲜有通才。"
            ],
            "壬卯": [
                "戊辛两透，锦标可夺。", "戊透辛藏，壮志能酬。", "透庚藏戊辛，腰缠万贯。", "透庚会木局，倚马千言。", "透木多火无壬水，镜花难折。", "有壬并干逢比劫，月桂可栽。"
            ],
            "壬辰": [
                "透甲见癸，名疆逐逐。", "透甲见庚，文思悠悠。", "支藏一甲干无木，财雄数世。", "柱有甲庚支不破，名高群僚。", "四柱无甲，行为盗拓。", "干支无庚，头脑多烘。"
            ],
            "壬巳": [
                "壬与辛并露，斯文潇洒。", "癸辛甲同透，裘轻马肥。", "壬乙夹干寅午巳，首朝北阙。", "水火杂柱财星旺，坦腹东床。"
            ],
            "壬午": [
                "干头庚癸同透，身财俱相称。", "柱中两壬夹庚，人命必主贵。"
            ],
            "壬未": [
                "辛甲并透，公孙对策。", " 甲透辛藏，祖逖著鞭。", "无辛无甲，可比辽东白豕。", "透辛透壬，赛如冀北名骝。"
            ],
            "壬申": [
                "戊丁透干，声华比敲金戛玉。", "戊丁藏支，英俊超阵马风檣。", "戊多见甲，一芹可采。", "戊多无甲，三场无缘。"
            ],
            "壬酉": [
                "支见申亥，资囊绰绰。", "时透甲木，经腹便便。"
            ],
            "壬戌": [
                "干透甲戊，显居台阁。", "柱无丙戊，困守饔室。", "透丙多壬，士林怀宝。", " 多丙无壬，陋室悬磐。"
            ],
            "壬亥": [
                " 戊庚透干，双雕叠中。", "戊庚无踪，孤鹤独寒。", "干透戊庚不见甲，三台列位。", "干透戊甲不见庚，徒留四壁。"
            ],
            "壬子": [
                "戊丙同透，权重资而货殖。", "丙透戊缺，权奇算以贸迁。"
            ],
            "壬丑": [
                "木火解冻，雄图奋发。", "丙甲齐干，壮志激昂。"
            ],
            "癸寅": [
                "丙辛并透无刑冲，锦衣荣达。", "丙丁会火不见壬，老寂伤悲。", "丙透辛透，科开殿选。", "丙透辛藏，才举贤书。", "柱无丙火支会水，呕心沥血。", "支成水局干透丙，吐气扬眉，"
            ],
            "癸卯": [
                "庚辛齐透不见丁，高攀蟾宫丹桂。", "庚辛暗藏无刑冲，直探骊窟明珠。", "或明暗于干支，则磨砖亦可作镜。", "若不见乎四柱，乃画饼焉能充饥。"
            ],
            "癸辰": [
                "辛丙壬齐在清明，才望如云蒸霞蔚。", "癸辛丙透近谷雨，文章似虎绣龙雕。", "四库全备干泛甲，壮志远达。", "三刑见冲支无木，老泪纵横。"
            ],
            "癸巳": [
                "辛庚见壬，金榜题名。", "辛庚见丁，麦饭充饥。", "支藏辛金不见丁，有怀皆是白玉。", "干透壬庚无刑克，无唾不成明珠。", "火土杂柱无刃救，毕竟医求扁鹊。", "庚金生主终力微，难免疾抱河鱼。"
            ],
            "癸午": [
                "庚辛透干并透壬，文同韩潮苏海。", "庚辛透干支水局，才如宋艳班香。", "多金少水，石季伦之豪富。", "透金透水，郭汾阳之尊荣。"
            ],
            "癸未": [
                "庚辛叠丙丁，见壬兮，如奇花吐艳。", "庚辛无比劫，见丁兮，乃鼠食充饥。"
            ],
            "癸申": [
                "干透丁甲，志存鸿鹄。", "丁逢午火，名重骅骝。", "柱多庚辛无丁制，鹑衣蔽体。", "干有丁火无甲助，蜗角争名。"
            ],
            "癸酉": [
                "丙辛同透，焦桐遇蔡邕而暴发", "丙透辛藏，锈铁逢薛烛以腾光。"
            ],
            "癸戌": [
                "干透辛甲支藏癸，乃屠龙之学士。", "干透甲癸柱无破，为砾鼠之吏曹。", "柱有甲癸无辛，可学端木理财。", "柱无甲癸及辛，难免翁子负薪。"
            ],
            "癸亥": [
                "干透庚辛无刑伤，文呈班马。", "支会木局透丁火，名落孙山。", "多壬无戊，瘦躯如鹤", "多戊无金，孤影如鸿。"
            ],
            "癸子": [
                "透丙又透辛，凤毫映日。", "见丙无辛壬，龙气成云。", "有辛无丙，入水掬月。", "无辛无丙，对镜寻花。"
            ],
            "癸丑": [
                "透壬出丙支离戊，贵极公侯。", "失壬兮，职止吏佐。", "透丙藏癸支水局，富夸乡里。", "无丙兮，贫居陋巷。"
            ],
        };


        //调侯用神表，忌神在余氏用神辞渊 139 大运在细批终身 429
        var tiaohou = {
            "甲寅": {
                "用神": "丙癸,庚丁",
                "描述": "调和气候为要。丙火为主。癸水为佐助.雨水后庚为主"
            },
            "甲卯": {
                "用神": "庚，丙，丁，戊，己",
                "描述": "羊刃架杀，专用庚金，以戊己为辅佐。无庚用丙丁泄秀，不取制杀。"
            },
            "甲辰": {
                "用神": "庚，丁，壬",
                "描述": "用庚金必须丁火制之，伤官制杀。无庚用壬"
            },
            "甲巳": {
                "用神": "癸，庚，丁",
                "描述": "调和气候癸水为主。原局气润，庚丁为用"
            },
            "甲午": {
                "用神": "癸，庚，丁",
                "描述": "木性虚焦，癸水为主。无癸用丁，要行北运。木盛先庚，庚盛先丁"
            },
            "甲未": {
                "用神": "癸，庚，丁",
                "描述": "上半月同午月用癸。下半月用庚丁。"
            },
            "甲申": {
                "用神": "庚，丁，壬",
                "描述": "伤官制杀，无丁用壬"
            },
            "甲酉": {
                "用神": "庚，丁，丙",
                "描述": "用丁制杀，用丙调侯。丁丙并用为辅佐"
            },
            "甲戌": {
                "用神": "庚，甲，丁，壬，癸",
                "描述": "土旺者用甲木，木旺者用庚金，丁壬癸为辅佐"
            },
            "甲亥": {
                "用神": "庚，丁，丙，戊",
                "描述": "用庚金必须丁火制之，用丙调侯。水旺用戊"
            },
            "甲子": {
                "用神": "丁，庚，丙",
                "描述": "木性生寒，丁先庚后。用丙调侯。必须支见巳，寅，方为贵格"
            },
            "甲丑": {
                "用神": "丁，庚，丙",
                "描述": "丁火必不可少.丙通根巳、寅。甲木为助。用庚劈甲引丁。"
            },
            "乙寅": {
                "用神": "丙，癸",
                "描述": "取丙火解寒。略取癸水滋润。不宜困丙。火多用癸"
            },
            "乙卯": {
                "用神": "丙，癸",
                "描述": "以癸滋木。以丙泄秀，不宜见金"
            },
            "乙辰": {
                "用神": "癸，丙，戊",
                "描述": "若支成水局，取戊为佐"
            },
            "乙巳": {
                "用神": "癸",
                "描述": "月令丙火得禄，专用癸水，调候为急。"
            },
            "乙午": {
                "用神": "癸，丙",
                "描述": "上半月专用癸水，下半月丙癸并用"
            },
            "乙未": {
                "用神": "癸，丙",
                "描述": "润土滋木，喜用癸水，柱多金水，先用丙火。夏月壬癸，切忌戊，己杂乱。 "
            },
            "乙申": {
                "用神": "丙，癸，己",
                "描述": "月垣庚金司令，取丙火制之，或癸水化之。不论用丙用癸，皆己土为佐。 "
            },
            "乙酉": {
                "用神": "癸，丙，丁",
                "描述": "上半月癸先丙后，下半月丙先癸后，无癸用壬。支成金局，又宜用丁。 "
            },
            "乙戌": {
                "用神": "癸，辛",
                "描述": "以金发水之源。见甲，名藤萝系甲。"
            },
            "乙亥": {
                "用神": "丙，戊",
                "描述": "乙木向阳，专取丙火。水多以戊佐"
            },
            "乙子": {
                "用神": "丙",
                "描述": "寒木向阳，专取丙火，忌见癸水"
            },
            "乙丑": {
                "用神": "丙",
                "描述": "寒谷回春，专用丙火"
            },
            "丙寅": {
                "用神": "壬，庚",
                "描述": "壬水为用，庚金发水之源为佐"
            },
            "丙卯": {
                "用神": "壬，己",
                "描述": "专用壬水，水多用戊制之，身弱用印化之"
            },
            "丙辰": {
                "用神": "壬，甲",
                "描述": "专用壬水，土重以甲为佐"
            },
            "丙巳": {
                "用神": "壬，癸，庚",
                "描述": "以庚为佐，忌戊制壬。无壬用癸"
            },
            "丙午": {
                "用神": "壬，庚",
                "描述": "壬庚以通根申宫为妙。未月：壬，庚。以庚为佐"
            },
            "丙未": {
                "用神": "壬，庚",
                "描述": "以庚为佐"
            },
            "丙申": {
                "用神": "壬，戊",
                "描述": "壬水通根申宫，壬多必取戊制"
            },
            "丙酉": {
                "用神": "壬，癸",
                "描述": "四柱多丙，一壬高透为奇。无壬用癸"
            },
            "丙戌": {
                "用神": "甲，壬",
                "描述": "忌土晦光，先取甲疏土，次用壬水"
            },
            "丙亥": {
                "用神": "甲，戊，庚，壬",
                "描述": "月垣壬水秉令，水旺用甲木化之，身煞两旺，用戊制之。火旺用壬，木旺宜庚。 "
            },
            "丙子": {
                "用神": "壬，戊，己",
                "描述": "气进二阳，丙火弱中复强，用壬水，用戊制之。无戊用己"
            },
            "丙丑": {
                "用神": "壬，甲",
                "描述": "喜壬为用，土多不可少甲"
            },
            "丁寅": {
                "用神": "甲，庚",
                "描述": "用庚金劈甲引丁"
            },
            "丁卯": {
                "用神": "庚，甲",
                "描述": "以庚去乙，以甲引丁"
            },
            "丁辰": {
                "用神": "甲，庚",
                "描述": "用甲木引丁制土，次看庚金"
            },
            "丁巳": {
                "用神": "甲，庚",
                "描述": "取甲引丁，甲多又取庚为先"
            },
            "丁午": {
                "用神": "壬，庚，癸",
                "描述": "火多以庚壬两透为贵。无壬用癸，为独煞当权"
            },
            "丁未": {
                "用神": "甲，壬，庚",
                "描述": "以甲木化壬引丁为用，用甲不能无庚，取庚为佐"
            },
            "丁申": {
                "用神": "甲，庚，丙，戊",
                "描述": "取庚劈甲，无甲用乙。用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。水旺用戊"
            },
            "丁酉": {
                "用神": "甲，庚，丙，戊",
                "描述": "取庚劈甲，无甲用乙。用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。水旺用戊"
            },
            "丁戌": {
                "用神": "甲，庚，戊",
                "描述": "一派戊土无甲，为伤官伤尽"
            },
            "丁亥": {
                "用神": "甲，庚",
                "描述": "庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用"
            },
            "丁子": {
                "用神": "甲，庚",
                "描述": "庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用"
            },
            "丁丑": {
                "用神": "甲，庚",
                "描述": "庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用"
            },
            "戊寅": {
                "用神": "丙，甲，癸。",
                "描述": "无丙照暖，戊土不生，无甲疏劈，戊土不灵。无癸滋润，万物不长，先丙，次甲，次癸。 "
            },
            "戊卯": {
                "用神": "丙，甲，癸",
                "描述": "无丙照暖，戊土不生，无甲疏劈，戊土不灵。无癸滋润，万物不长，先丙，次甲，次癸。"
            },
            "戊辰": {
                "用神": "甲，丙，癸",
                "描述": "戊土司令，先用甲疏，次丙，次癸"
            },
            "戊巳": {
                "用神": "甲，丙，癸",
                "描述": "戊土建禄，先用甲疏劈，次取丙癸"
            },
            "戊午": {
                "用神": "壬，甲，丙",
                "描述": "调候为急，先用壬水，次取甲木，丙火配用"
            },
            "戊未": {
                "用神": "癸，丙，甲",
                "描述": "调候为急，癸不可缺，丙火配用。土重不能无甲。"
            },
            "戊申": {
                "用神": "丙，癸，甲",
                "描述": "寒气渐增，先用丙火。水多，用甲泄之"
            },
            "戊酉": {
                "用神": "丙，癸",
                "描述": "赖丙照暖，喜水滋润"
            },
            "戊戌": {
                "用神": "甲，丙，癸",
                "描述": "戊土当权，先用甲木，次取丙火。见金，先用癸水，后取丙火。 "
            },
            "戊亥": {
                "用神": "甲，丙",
                "描述": "非甲不灵，非丙不暖"
            },
            "戊子": {
                "用神": "丙，甲",
                "描述": "丙火为尚，甲木为佐"
            },
            "戊丑": {
                "用神": "丙，甲",
                "描述": "丙火为尚，甲木为佐"
            },
            "己寅": {
                "用神": "丙，庚，甲",
                "描述": "取丙解寒，忌见壬水，如水多，须以戊土为佐。土多用甲，甲多用庚。 "
            },
            "己卯": {
                "用神": "甲，癸，丙",
                "描述": "用甲忌与己土合化，次用癸水润之"
            },
            "己辰": {
                "用神": "丙，癸，甲",
                "描述": "先丙后癸，土暖而润，随用甲疏"
            },
            "己巳": {
                "用神": "癸，丙",
                "描述": "调候不能无癸，土润不能无丙"
            },
            "己午": {
                "用神": "癸，丙",
                "描述": "调候不能无癸，土润不能无丙"
            },
            "己未": {
                "用神": "癸，丙",
                "描述": "调候不能无癸，土润不能无丙"
            },
            "己申": {
                "用神": "丙，癸",
                "描述": "丙火温土，癸水润土，七月庚金司权，丙能制金，癸以泄金"
            },
            "己酉": {
                "用神": "丙，癸",
                "描述": "取辛辅癸"
            },
            "己戌": {
                "用神": "甲，丙，癸",
                "描述": "九月土盛，宜甲木疏之，次用丙癸"
            },
            "己亥": {
                "用神": "丙，甲，戊",
                "描述": "三冬己土，非丙暖不生。初冬壬旺，取戊土制之，土多，取甲木疏之。"
            },
            "己子": {
                "用神": "丙，甲，戊",
                "描述": "三冬己土非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。 "
            },
            "己丑": {
                "用神": "丙，甲，戊",
                "描述": "三冬己土非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。  "
            },
            "庚寅": {
                "用神": "戊，甲，壬，丙，丁",
                "描述": "用丙暖庚性，虑土厚埋金，须甲疏泄。火多用土，支成火局用壬。 "
            },
            "庚卯": {
                "用神": "丁，甲，庚，丙",
                "描述": "庚金暗强，专用丁火，借甲引丁，用庚劈甲。无丁用丙"
            },
            "庚辰": {
                "用神": "甲，丁，壬，癸",
                "描述": "顽金宜丁，旺土用甲，不用庚劈。：支火宜癸，干火宜壬。 "
            },
            "庚巳": {
                "用神": "壬，戊，丙，丁",
                "描述": "丙不熔金，惟喜壬制，次取戊土，丙火为佐。支成金局，变弱为强，须用丁火 "
            },
            "庚午": {
                "用神": "壬，癸",
                "描述": "专用壬水，癸次之，须支见庚辛为助。无壬，癸，用戊，己泄火之气。 "
            },
            "庚未": {
                "用神": "丁，甲",
                "描述": "若支会土局，甲先丁后"
            },
            "庚申": {
                "用神": "丁，甲",
                "描述": "专用丁火，甲木引丁"
            },
            "庚酉": {
                "用神": "丁，甲，丙",
                "描述": "用丁甲　金，兼用丙火调候。"
            },
            "庚戌": {
                "用神": "甲，壬",
                "描述": "土厚先用甲疏，次用壬洗"
            },
            "庚亥": {
                "用神": "丁，丙",
                "描述": "水冷金寒爱丙丁，甲木辅丁"
            },
            "庚子": {
                "用神": "丁，甲，丙",
                "描述": "仍取丁甲，次取丙火照暖，一派金水，不入和暖之乡，孤贫。丙丁须临寅巳午未戌支，方为有力"
            },
            "庚丑": {
                "用神": "丙，丁，甲",
                "描述": "仍取丁甲，次取丙火照暖，一派金水，不入和暖之乡，孤贫。丙丁须临寅巳午未戌支，方为有力"
            },

            "辛寅": {
                "用神": "己，壬，庚",
                "描述": "辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人庚为助"
            },
            "辛卯": {
                "用神": "壬，甲",
                "描述": "辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人庚为助。"
            },
            "辛辰": {
                "用神": "壬，甲",
                "描述": "若见丙火合辛，须有癸制丙，支见亥子申，为贵"
            },
            "辛巳": {
                "用神": "壬，甲，癸",
                "描述": "壬水洗淘，兼有调候之用，更有甲木制戊，一清澈底"
            },
            "辛午": {
                "用神": "壬，己，癸",
                "描述": "己无壬不湿，辛无巳不生，故壬，巳并用。无壬用癸。"
            },
            "辛未": {
                "用神": "壬，庚，甲",
                "描述": "先用壬水，取庚为佐，忌戊出，得甲制之，方吉"
            },
            "辛申": {
                "用神": "壬，甲，戊",
                "描述": "壬水为，甲戊酌用。不可用癸水"
            },
            "辛酉": {
                "用神": "壬，甲",
                "描述": "壬水淘洗，如见戊己，须甲制土，支成金局无壬须用丁火"
            },
            "辛戌": {
                "用神": "壬，甲",
                "描述": "月辛金，火土为病，水木为药"
            },
            "辛亥": {
                "用神": "壬",
                "描述": "先壬后丙，名金白水清，馀皆酌用"
            },
            "辛子": {
                "用神": "丙，戊，壬，申",
                "描述": "冬月辛金，不能缺丙火温暖，馀皆酌用。"
            },
            "辛丑": {
                "用神": "丙，壬，戊，己",
                "描述": "冬月辛金，不能缺丙火温暖，馀皆酌用。壬先，戊己次之，总之，丙火不可少也"
            },

            "壬寅": {
                "用神": "庚，丙，戊",
                "描述": "无比劫者，不必用戊，专用庚金，以丙为佐。如比劫多，又宜制之，一戊出，名一将当关，群邪自伏"
            },
            "壬卯": {
                "用神": "戊，辛，庚",
                "描述": "三春壬水绝地，取庚，辛发水之源。水多用戊"
            },
            "壬辰": {
                "用神": "甲，庚",
                "描述": "甲疏季上，次取庚金发水源，金多预丙制之为妙。"
            },
            "壬巳": {
                "用神": "壬，辛，庚，癸",
                "描述": "壬水弱极，取庚，辛为源，壬癸比劫"
            },
            "壬午": {
                "用神": "癸，庚，辛",
                "描述": "取庚为源，取癸为佐。无庚用辛"
            },
            "壬未": {
                "用神": "辛，甲",
                "描述": "以辛金发水源，甲木疏土"
            },
            "壬申": {
                "用神": "戊，丁",
                "描述": "取丁火佐戊制庚，戊土通根辰戌，丁火通根午戌，方可为用"
            },
            "壬酉": {
                "用神": "甲，庚",
                "描述": "无甲，用金发水之源，名独水犯庚辛，体全之义"
            },
            "壬戌": {
                "用神": "甲，丙",
                "描述": "以甲制戌中戊土，丙火为佐"
            },
            "壬亥": {
                "用神": "戊，丙，庚",
                "描述": "如甲出制戊，须以庚金为救。"
            },
            "壬子": {
                "用神": "戊，丙",
                "描述": "水旺宜戊，调候宜丙，丙戊必须兼用"
            },
            "壬丑": {
                "用神": "丙，丁，甲",
                "描述": "上半月专用丙火，下半月用丙，甲木为佐"
            },
            "癸寅": {
                "用神": "辛，丙",
                "描述": "用辛生癸水为源，无辛用庚，丙不可少。 "
            },
            "癸卯": {
                "用神": "庚，辛",
                "描述": "乙木司令，专用庚金，辛金次之"
            },
            "癸辰": {
                "用神": "丙，辛，甲",
                "描述": "上半月专用丙火，下半月虽用丙火，辛甲为佐"
            },
            "癸巳": {
                "用神": "辛",
                "描述": "无辛用庚"
            },
            "癸午": {
                "用神": "庚，辛，壬，癸",
                "描述": "庚辛为生身之本，但丁火司权，金难敌火，宜兼用比劫，方得庚辛之用。"
            },
            "癸未": {
                "用神": "庚，辛，壬，癸",
                "描述": "上半月金神衰弱，火气炎热，宜比劫帮身，同五月。下半月无比劫亦可。"
            },
            "癸申": {
                "用神": "丁",
                "描述": "庚金得禄，必丁火制金为用，丁火以通根午戌未为妙"
            },
            "癸酉": {
                "用神": "辛，丙",
                "描述": "辛金为用，丙火佐之，名水暖金温，须隔位同透为妙。"
            },
            "癸戌": {
                "用神": "辛",
                "描述": "专用辛金，忌戊土，要比劫兹甲制戊方妙。"
            },
            "癸亥": {
                "用神": "庚，辛，戊，丁",
                "描述": "亥中甲木长生，泄散元神，宜用庚辛。水多用戊，金多用丁。"
            },
            "癸子": {
                "用神": "丙，辛",
                "描述": "丙火解冻，辛金滋扶"
            },
            "癸丑": {
                "用神": "丙，庚，辛",
                "描述": "丙火解冻，通根寅巳午未戌方妙。支成金局，要丙透得地。支成火局，又宜用庚辛。"
            }


        };

          ///御定子平规则
          var yudingzipingrizhu = {
            "甲子": [
                "此溪边空心衰败之木也。先看枝柱有土培否，更看左右之根，与未中之库(后)方看金官火食。"
                ,"遇金则为栋梁斧斤，遇火则为木火通明，遇土为殷实笃厚，遇水则为郁苍秀古。"
                ,"或全或毁，或奇或正，或平或扁，始得定其品局。若培植不坚，根基不稳，更有马冲鬼凌，不问而知其夭折；"
                ,"运之乘蹇(穷困,不顺利),独其次而。倘遇比肩重叠，只宜金火相成。"
        ],
            "甲寅": [
                "此硕果品汇之木也。其果可当禄食，先要看有人看守【看守维何？庚辛是也，但辛不如庚耳。大约先喜庚，次喜辛。】，庶免剽窃，克享福寿；再无冲动，加以根芑叶茂，财官并著，否则名利虚花。"
                ,"或有刑冲破禄坏印，则福禄自耗，必至飘零而后已。次看财食印绶，【最忌无官无煞】，而后行比劫刑冲破败之运。"
        ],
            "甲辰": [
                "此郁湿水松之木也。木气郁于湿土之中，根蒂甚固，人领之，多含醇朴，所少者挥霍发扬田耳。最喜露庚露丙，方能发达；否则依阿苟且，田福寿亦偏。若遇比劫重叠，尤宜厚土栽根，不至土疏木败。不怕水局会丛，只怕刑冲劫害，最喜丙丁戊已、寅午戌火土运，忌行申酉亥子丑抑郁运"
            ],
            "甲午": ["工师运斤之木也。其木取之于山，用之于家，必要庚辛透露，庚第一，辛次之，田则利器在手，方成栋梁，而善其事；否则不免枯朽而已。从来甲午逢庚，多为台谏。如柱中有寅，有亥，发福更大。壬癸重叠，非所好也。大抵喜金水，忌木火土运。木遇火而通明，然火多则木焚，故原有火者，不宜复行火运。"]
            ,
            "甲申": ["此砍断入水之木也。木根虽断，精液犹存，每每绝处再生。故一水底，得水浸润，便与金石同坚。是以四柱运中，若逢水局，无人不发；倘一暴十寒，枯朽I立至，所谓“枯木偏宜活水濡”也。喜行金水木湿土运，忌行火土枯燥运。"]
            ,
            "甲戌": ["此窖土松杉之木也。其木土存则存，土散则散，必要培戌，不可冲戌；然后看官煞以去枯蔓，再看雨露以润根荄，则上有一枝挺承，旁无余蔓盗窃，前后左右，一团苞孕，其神气坚固，自应栋梁，若刑冲破败减半矣。喜五行葆运，忌违时冲克运。"]
            ,
            "乙丑": ["此沾土初芽之木也。二阳已长，万象解甲，氤氲元气之中，人必存心仁厚，最宜遵养爱护，不宜轻折摧残；既怕旱，又怕涝，喜雨旸时若，火土温和是其妙境也。从来体用，有戊寅相逢，无人不发。倘旱涝交浸，刑冲迭见，即失中和之道。参观时令，又是吃紧法门。大约喜见乙木、丙火、戊土，得微云细雨之养，忌甲木庚金，大旱大涝，及刑冲克战运"]
            ,
            "乙卯": ["此禾黍秀实，禄品之木也，不惟可以悦目，抑且可以充饥。禄食有余，珍重可爱，加以财官印绶相护，不问而知其宝贵。即参以食伤吐气，亦不问而知其豪杰。最怕酉冲子刑，尤怕甲劫辰害，喜行辛金、乙木、水火土以护之，忌行庚金、甲木、申子酉以伤之。"]
            ,
            "乙巳": ["倒插花瓶之木也。其木喜庚壬相凑，无人不发，发必登科。大抵败后复成之木，必要泥桨深埋，庚壬重衬，庶几安稳易生；若遇丙丁一阳来复，更为易长。最怕刑冲枯燥，牛羊践履，一冲即死，有摇亦枯；不冲不摇，虽无庚壬，但有酉丑相会，亦可以托根延生矣。喜金水温土会巳，怕木火燥土冲巳。"]
            ,
            "乙未": ["此藤萝施架之木也。柔顺蔓延，人生多委靡不振，最喜高架相护，始得挺承雨露。故有架即沾君恩，无架终落尘埃。高架维何？寅亥甲木是也。若四柱无架，行运遇冲，不但名利俱坏，即命亦虑其难全也。喜行甲 乙寅亥火土吐气之运，忌行庚辛己、申午未墓库之运。"]
            ,
            "乙酉": ["此盆花奇香之木也。清新馨秀，可供帝玩。若干有财官印绶，支无刑冲破败，必有鉴赏者矣。但怕行亥午之运，午破酉，亥刑酉，英华一散，焉能有寿？不论秋冬春夏，与水火木金，都不甚关利害。乙酉，为官为利有权煞，生子养子终不好"]
            ,
            "乙亥": ["乙木逢死，此木上寄生之木也。从死处再生，便须依附而行。领此日者，多是移花接木，或晚生庶出。最要甲木劫星安稳，则功名富贵， 自可意外遭逢。若得太阳相照，或丁火温和，皆能享自然之福。如甲萎亥冲，不问而知，其夭折分离矣。喜行生扶及甲乙寅卯未亥相会之运，忌行克剥及酉申巳亥相冲之运。"]
            ,
            "丙子": ["此日浴咸池也。精光隐曜，夜生更得其体，如昼生则减其半矣。夜生者，能会西北申辰亥丑，便为上乘。昼生者，必遇东南寅卯巳年未方为有用。但生此日者，多躭于女色，易乱其性，不可不知所戒。昼喜行木火土运，夜喜行金水运。"]
            ,
            "丙寅": ["此日升旸谷也。太阳升殿，气概可凌万夫。如昼生人会午，更表英雄；夜生人会亥，始葆元气。最怕者，申马冲驰，无端惊动。昼生人喜会刃，夜生人忌冲马。"]
            ,
            "丙辰": ["此日经天罗也。太阳到此，微有淹滞，人领之，有蒙昧瞒旰之象。昼须遇寅巳午，众阳扶起，则不堕天罗，夜要透戊己食伤，支有申子会合，则不碰天罗。倘昼生阴曀而遇壬癸，夜生不见土德，必主少寿，便非好命。此日又名日德，得之者长存厚道。"]
            ,
            "丙午": ["此日丽中天也，羊刃甚烈，威焰逼人。人领之，性主太刚，妻宫亦有刑克。左右支柱，稍得金水，方成既济。若加甲乙丙丁炎燥，难享全福。喜行金水运，忌行火土，并忌羊刃重逢。"]
            ,
            "丙申": ["此日照昆仑也。昆仑之下有岷池，太阳到此，与水相荡，触为红霞。盖哺而将暮，弱而无力，所谓“丙临申位火无烟也。如夜生犹喜恬息，昼生必待生扶，不然多学少成，始勤终怠，更有夭折之患。从来红霞晚照，虽荣不久。人领斯造，其光景亦然。喜行木火土，忌行金水。"]
            ,
            "丙戌": ["此日入地网也。旦昼之浊气未净，暮夜之清气未澄，太阳到此困遮田甚矣。人领之，多晦倦暴燥；昼生者，支柱有寅午，加一番振作；夜生者，支柱有亥子，成一段宁息。若昼无振作之权，夜无宁息之体，恐难出人头地。昼喜木火寅午戌，夜喜金水亥子丑。至于失中，又当再酌。"]
            ,
            "丁丑": ["此钻激之火也。何谓钻？钻燧于木是也，利用甲。何谓激？激，激火于石是也，利用庚。或钻或激，总要火土干地相逢，庶几可遂就燥之性。若投于丑辰未库，落于西北二方，其不渐灭也几希矣。喜行甲木火土燥运，忌行金水阴库潮湿运，丑为金水之库，丁火至此，微甚，再不干燥，必至渐灭，故不宜行金水运。"]
            ,
            "丁卯": ["此木屑香烟也。其火喜壬官粘合，则香气盘桓，可达之于帝座，名曰“正官”，四柱俱喜水土。"
            ,"若逢亥子，亦是生灭迭见，不但功名难成，仍恐相激易败。"
            ,"若既无壬癸，再加火土燥烈，则散漫无统，攸忽易散矣。"
            ,"喜金水潮湿，忌木火土干燥。"
           , "丁用卯中乙木为嫡母，故宜生不宜伤。苟逢枯燥之乡，则木焚而香气失，必用壬来相合。丁壬化木，子能从母，孝子之义也。"]
            ,
            "丁巳": ["此燧珠之火也。触于曦光，则炎光可燎；若逢阴雨，则火气难生。"
            ,"领此者，其功名富贵，都从直中取得，勿向曲里求成。故喜诞乙巳、丙午、丁未三时，则炎燃立见，取功名如拾芥也。"
            ,"若非巳午未时生人，则韬晦无闻；再加亥马冲驰，必是傍人门户，且不能多寿矣。"
            ,"喜行东南木火土开霁之运，忌行西北金水墓库阴瞳田之运。 "]
            ,
            "丁未": ["此灰烬香烟也。火生土，土亦能存火，丁未是也。其火有烟无焰，全赖戊己灰土重埋，则耐久不灭。人领之，多含锋敛锷，功名不显，福寿无涯。昼生不见光彩，利于夜生，早年困迍多端，必至晚景荣耀，老益康宁。只怕丑未冲灭，未免克妻耳。喜行金水木运，忌行火土并冲运。若四柱失中和，又加酌论。"]
            ,
            "丁酉": ["此琉璃光灯也。其火 晶光莹彻，夜生分外辉煌，昼生亦抱光自莹。人领之，聪明伶俐，荣华可知。最喜壬水乙木，最忌癸水甲木。若遇午卯刑冲，便多破耗。喜乙壬火土金运，忌甲丙癸冲破运。"]
            ,
            "丁亥": ["此风前秉烛也。炎光恍惚，第一喜壬水来合，名曰“有罩灯笼”，可以普熙四方，可以持行千里，全然不怕风雨，定有科甲之造。"
            ,"若无壬，亦喜有庚在千，名曰“镇压在手”，可以止浪息风，可以镇守边疆，亦可以不怕风涛，必为武职之造。"
            ,"苟无庚无壬，则悠悠忽忽，难语功名富贵矣。"
            ,"再加刑冲，贫穷夭折，所不免也。喜行壬庚火土，忌行甲癸刑冲。"]
            ,
            "戊子": ["此为蒙山也。山下有水，曰蒙，取其空而能响。人领之，，大约僧道投生，转为武弁，以慈悲之心，为攻伐之手。盖从来武职，多生此日，有滋润胎息，生生不已之妙，所谓“天下原无穷戊子”是也。亦看上下左右，有财官印食，所以扶之者何如。但此日生人，其子息多难，即不难亦当晚得。喜行火土寅午戌生扶，忌行官煞卯申子辰克泄。"]
            ,
            "戊寅": ["此艮山也。止而不行，静而不动，曰“艮”，取其长生趋艮，气聚脉生。人领之，有任重道远之量。再加有食有煞，有刃有财，其富贵福泽寿考，更不可量。若刑冲破耗，或田有申为冲驰，则减半矣。喜财官印绶食伤，舒配得宜；忌刑冲破耗，偏倚失节。"]
            ,
            "戊辰":["此蟹象吐颖之山也。水从山腰而出，津津细流，如蟹颖然，所谓“浅水长流山不枯”是也。盖长为财库，人领之，可以终身不穷。所怕者，戌来冲辰，大失元气，恐有刑伤灾晦。喜行金木申子辰运，忌行火土寅午戌运。亦看强弱衰旺，再加去留酌取。若生三冬，四柱金水太多，又宜行火土运。"]
            ,
            "戊午": ["此火山也。炎炎燥烈，阳刃特达。人领之，性气刚急，多有刑克，不可无煞以制其凶。然太刚方用煞，若单弱不明，宜用刃以帮身，又不可专用煞也。更须用食神以制煞，用印绶以扶刃，酌其强弱，配以生扶，文可巡抚，武奇参镇。喜金水木火土调剂，忌金水木火土偏倚。"]
            ,
            "戊申": ["此石山也。山土载石，曰“崔嵬”，气象巉岩。人领之，中无邪曲，外有仪范，但坐于马上，多动少静。最喜金水木，点缀以成明秀；忌火土燥烈，神色焦枯；尤不喜比肩重叠，埋没金光。亦量盛衰强弱，再加去留舒配。喜行金水木土运，忌行丙午丁未运。"]
            ,
            "戊戌": ["此为魁罡演武之山也。步伐整齐，英雄吐气。人领之，性多慷慨。加以煞刃财食，柤剑相迭—，或遇癸水知音，其名利富贵，未有不显扬者。只怕辰冲，又逢水旺，则为背水败阵。亦须参酌强弱，再加舒配。背水阵，谓土薄水泛，势不能振也。"]
            ,
            "己丑":["足水腴田也。稻途宜于湿地，膏泽极多。最喜丙火露天干，火阳薰炙，其苗易秀而实。人领之，若正印有权，必见文章事业；若有武库冲开，煞印相错，亦易成武榜功名。喜行火土乙运，忌行金水甲运。或过衰过旺，又宜酌取。"]
            ,
            "己卯": ["此体囚失气之土也。其地硗薄，无甚膏泽，且多剥削虚损，所谓“己土化卯。未中年先主灰心”也。人领之，无祖父燕贻，亦无货殖厚积。最喜干露呙丁，支藏丑戌，庶几有救，可享富贵寿考。若干无丙丁资扶，支无丑戌帮衬，又有酉子刑冲，其不伤折也几希矣。喜行甲木丑戌运，忌行乙木甲子卯酉运。最忌己卯，行卯运必死"]
            ,
            "己巳": ["田此岭头稼穑也。黍宜高燥，喜见丙火太阳。人生领此，稼穑不难秀实；只恐怕旱涝，其年月日时，不宜太燥。若能雨旸时若，无不富贵福寿。金水成局，贫天不免矣。苟盛衰太过，又当酌用。一云：喜行金水木，忌火土合燥运。"]
            ,
            "己未": ["此入土之稼穑也。喜高燥，怕污湿；喜培植，怕冲害。盖土培不深，则稼穑不茂，如参药芋薯之类是也。更有外实内虚之象。人领之，忠厚笃信，硁硁田谨守，但不免刑妻。若子穿丑冲，土气便薄。喜行化土培植之运，忌行刑冲穿克剥削运。未为木库，其形土，其中木，木能克土，外实内虚，故宜培也。"]
            ,
            "己酉": ["此筑地稼穑也。虽坐长生，实未腴熟；砌斜为正，筑虚为实，其瘠硗殆甚。最喜于支有丙寅培植，则富贵无涯。若无培植，又多克削，则富贵难望，故去留舒配，其得力者在“丙寅”二字。喜甲木火土，忌乙木金水。  "]
            ,
            "己亥": ["此注地稼穑也。淤泥浸润，多见潮湿，少见阳光。若值三冬，土凝冰结，不无淫泆之患，损耗之忧。唯丙丁常炙，则不劳力而得秀实。设遇阴雨阴木，终妨福寿。喜行甲木火土干燥，忌行乙木金水库湿。"]
            ,
            "庚子": [
                "此倒悬钟磬也。金空则响，喜坐于死绝空地，未穿午冲，遇击则鸣，最忌丑戌相逢。盖此庚金，内虚外实，人领之，聪明内含，声名远播，如鼓钟子宫，声闻于外。倘然财煞空灵，富贵利达。若火土填实，合汶无声。喜金水木火虚灵，忌行火土塞实。此日主最难得好，土填失空灵之体；若略无生扶，又未免虚弱无根。"
        ],
            "庚寅":[
                "此人冶炉锤也。初容之金，必逢木火交集，变质易成。倘食伤一见，跃冶可虞。至于去留舒配，或文或武，加些辰水泥浆，则关涉有趋。人生逢此，喜忌休咎，判然心目。喜木火土干燥，忌金水潮湿。．若火土燥，又宜比劫禄刃印地以全之。"
        ],
            "庚辰": [
                "此水师将运也。须要酉刃相逢，方为勇毅果敢。文可科第巡抚，武可征剿总镇。若无刃而有比劫云集，亦是援兵敌忾；再有戊寅资助，尤为出众英雄。故除刃之外，有劫即为威权。虽不大显，亦可成名行伍。倘既无刃，又无援兵资助，则单弱畏怯，一事无成，名曰“病后金刚”，反为魔伏，何所用之？更不宜行于陆地，谓之“旱海行舟”。未戌刑冲，亦不为吉。"
        ],
            "庚午": [
                "此出冶炉锤也。既炼之金，急要干支有水，方得淬砺成硎，文武俱能成器。若无金水，又加木火，必至过激，顿成夭折。故急于用水，刃又其次耳。喜行金水运，忌行木火土运。"
        ],
            "庚申": [
                "此已成剑戟也。最怕再遇火乡。若生于丙丁寅午戌之时，恐名利无成。如会申子辰水局，又得辛金壬癸相凑，其剑气自冲牛斗，文武可居极品，兼得福寿康宁。喜行金水运，忌木火土运。"
        ],
            "庚戌":[
                "此陆路将军也。人土无光，尘埋自易。亦要阳刃相逢，方能抵敌。若有比劫，亦是援兵敌忾，则膂力方刚，自能建立功名。倘无刃无援，则单弱难以鼓勇。一技壬癸申子辰水，则手足俱疲，不但名利无成，即性命亦难保矣。最忌者辰也，一冲即死。盖陆师入水，勇无所施。喜行金火土运，忌行水库水乡。若水运有劫，则不喜。"
        ],
            "辛丑": [
                "此初孩胎息之金也。泽地萃金，清而不离乎浊，胎而未离乎元，急须爱护保存，勿令摧残伤损。要知此金胎于戊、于寅、于戌，类乎“玉出昆冈”；胎于庚、于子、于辰，类乎“金生丽水”。亦有老蚌生珠，或是晚生庶出。故有庚有戊有子有辰戌寅，则富贵无期；再加无刑冲无破败，则福寿可享。大抵喜护，即为国家奇宝；不善护，则为淤泥弃物。喜行金水沙土生扶运，忌行木火卯未刑冲运。"
        ],
            "辛卯":[
                "此木精之金也。古木精液，触其曦气，凝土结为玳瑁，或金锡追琢，首饰翡翠，有意求为菲薄。是皆坐卯之辛，其质极虚幻脆薄，虽为可爱，实易毁坏。人领之，是孤介决绝之念，必辅以戊子、戊戌、丙戌相扶，庶几有所托而行于世，可获名利、妻子、福寿之报。若无戊子戊戌相扶，即单有丙丁照耀，亦为官贵虚邀，多是僧道现世，或无嗣承祧，或贫寒夭折，或骨肉寡情。喜行金土子戌相扶，忌行一派木火亥卯克泄。如遇水运，看其前后左右，另为酌用。大抵必有印绶，始用食神。不然，吐气反泄气也"
        ],
            "辛巳": [
                "此石中璞玉也。玉藏石中，未雕曰“璞”。雕琢之功，惟水得以表见。所谓玉出昆冈，雨后吐彩也。生此日者，如天干有水则清白可爱，决主富贵利达。即支中藏有水者，次之。如干支俱无水，纵有财官，亦无用矣。遇丙化亦佳，偏喜亥冲为妙。喜行金水，忌行木火。土若盛衰强弱，又当再酌。"
        ],
            "辛未": [
                "此溪土成金也。金从土生，得土即得金。生此日者，先要戊己资助，次要壬癸吐气。但己不如戊、癸不如壬之得力耳。只怕甲乙透出克土，再怕阴时淹滞，难以成炼。如有土有水，一炼成金，即售高价。大约看福寿以土为主，取功名以水为主，二者俱不可伤。"
        ],
            "辛酉": [
                "此珍贵金玉也。辛禄居酉，乃宗庙瑚琏之重器，谁不爱敬？生此日者，有水透出，则光彩百倍，加之无木无火无庚，无暴气纳凿，便为朝家至宝，功名显薯也必矣。喜行金水，忌行木火土，并刑冲破败。"
        ],
            "辛亥":[
                "，此水底珠玉也。淘沙可以见金，生此日者，名利从劳力忧患中来。最喜有寅合亥，名曰“捞金用筛”，文武即登彼岸。如无寅筛而遇土填水落，泥污刑库，则沉沦苦海，终无用矣。喜行寅午戌火土，忌行申子辰水库。"
        ],
            "壬子": ["此波涛洋溢之水也。生此日者，有煞以制刃，则狂澜砥柱，清晏田立俟，为文为武；再加印绶与官煞食伤，互相制伏，其功名富贵，大不可量。否则泛滥无所底止，将要转于沟壑之忧。喜行火土，忌行金水木。 "
        ],
            "壬寅": [
                "此雨落沙堤也。见其人，不见其出，藏蓄于艮山之中，故富者俱多。若云雨并集，趋走东流，则利达无比。有木透出，多是武贵。若上下四旁，火土太燥，是镕冶之辈而已。喜行金水木，忌行火土午戌。  "
        ],
            "壬辰": [
                "此壬骑龙背也。壬坐在辰，名曰“魁罡”。第一要遇亥子通源，则龙可飞天。更喜天干有甲庚，枝下有卯寅，为风云际会，则活泼升腾，潜渊游泳，决应文武科第，富贵利达。盖辰多则贵，寅多则富，惟见戌无情，战野元黄，从来不爽。喜行金水木申子辰亥子丑运，忌行火土巳午未寅午戌运。"
        ],
            "壬午":[
                "此水火既济也。上水下火，胎元生息， 《易》以既济。又为禄马同乡。只看前后孰强孰弱，然后去留舒配，或补水补火，自不难矣。匀停即富贵，失匀停即贫贱。喜忌先看偏正，后酌用舍。"
        ],
            "壬申": [
                "此水满渠成也。生生恬息，清白在躬。再生乎秋，或际乎庚，不问而知富贵。如生乎春夏，则减半矣。再察前后左右，有刃则用煞，无刃则不宜用煞。最忌者甲与戊太狠，以至过颡在山，反失其顺 流 之性。喜行金水 火，忌行木土，亦参酌舒配。"
        ],
            "壬戌": [
                "此骤雨易晴也。壬水坐戌，旋雨旋止。人领之，凡名利妻子，多是遇而不遇。若前后有比肩旺禄帮身，则不遇可转为奇遇。倘有庚辛相助，又为“云露不散”，一见太阳，则化为甘霖，泽及万物矣。喜行金水，忌行木火土"
        ],
            "癸丑": [
                "此秽积丛杂之水也。众水交集，气息多郁。人领之，必为事龌龊。必要上下四旁，有乙干卯支以通气疏息，则斐然成章，定为科名富贵。若有甲寅，亦可乘风破浪，堪成利达。但性气多暴，或作事凶险，有成有败，终不如乙木之安吉耳。倘若甲寅乙卯俱无，则不足取矣。偏喜丑未相冲，不喜子丑相合，喜行金水木，忌行火土库。"
        ],
            "癸卯": [
                "此林中润泉也。癸生在卯，不惟无一点渣滓，且有清风徐来之妙。人领之，其心地坦白慈祥，其情怀潇洒脱落，不当从流俗中观也。文章易成科第，心术可挽末流。只怕前后浊水浊土相混，为不宜耳。喜行金水木，忌行火土。倘过于衰旺，又当酌取。"
        ],
            "癸巳": [
                "此冈阜岑河之水也，名曰“财宫双美，水火既济”。人领之，多自作乾坤，自图名利，未必有祖父燕贻。最喜山林茂盛，云雨阴翳，则潮湿不竭，即成富贵。最忌者支柱有亥相冲，则堤坏而水自枯。三刑六害，犹其次耳。喜行金水木运，忌行火土冲运。"
        ],
            "癸未": [
                "此川泽曲湾之水也。癸坐未库，流有湾曲。人领之，有智谋，有机变。最喜金水透出天干，亥卯会人地支，以成利达之美。若火土重逢，多是遇而不遇。喜行金水木，忌行火土库。"
        ],
            "癸酉": [
                "此石孔流泉也。水生于石，其流极清，人领之，知必簪缨田世家，且有义气担当，清白家风；可爱文章，清俊可取。但前后有木映庚润，则清白不替，易绳祖武，易登科甲。若有庚无木，则减半矣。如概无庚无木，必愧先人矣。喜行金水木，忌行火土运。"
        ],
            "癸亥":[
                "此水天一色也。脉出昆仑，气通乾亥，宛然水与天一色，名曰“运元之水”。人领之，元气葆涵，机械不生。再加有木，清风徐来，自是羲皇以上之人。至于功名富贵，犹其次耳。若左右有巳亥辰酉刑冲相混，再有狂风暴雨之甲壬相杂，便不宜矣。喜行平稳会合运，忌刑冲作浪运。"
        ]
        };

        
         var yudingzipingrigan = {
            "甲": [
                "甲木属阳，乃参天拔地，舒枝抽干之木。一出于地，不可挪移，不论春夏秋冬，亦不论良枯巨细，总要重土厚培，固其根底然后徐寻火金水木，以定贵富贫贱寿夭之局。"
                ,"所谓：欲图长久千年计，须向沙泥万丈埋是也。"
                 ,"若土薄根摇，则无论金克水荡，木劫火焚，固己必遭夭折矣.盖根不深而枝叶茂者未之有也。"
                ,"甲为阳木，乃栋梁之材。生于初春，其质犹嫩；仲春方得旺气；三月水土温和，根株尤实，不得以衰论也。"
                ,"至盛夏之时，其气尽发于外，外虽盛而内实虚。初秋之候，质渐结实；而深秋尤极坚固，盖凋零者其枝叶，贞固者其体干也。"
                ,"至于亥月为长生之地，子丑月则木又得相气。"
                ,"故春日之甲，喜丙火以舒其性，且防金克；夏日之甲，喜水以滋其根，不宜水泛；秋日之甲，喜金以成其用，无火亦不妨；冬日之甲，必得夕(炙火)以解其寒。"
                ,"总之，其栽根植本，不论四时，俱喜见土。故四柱金旺火衰，即以弱论.若土(多)金水少，反以强称也。"
        ],
            "乙": [
                "乙木属阴，乃名花佳卉，稻黍稷麦菽之类。其木婀娜多姿，可以移东就西，须要春培夏荫秋灌冬暄。然后去留舒配，得宜为得用，失宜为失用。"
               , "最怕者甲木逼处为害，尤怕者庚金掣肘不伸。"

        ],
            "丙": ["丙火属阳，乃太阳曦光之火，不可因春夏秋冬而论强弱，但分昼夜，而论生息。如昼生人最要行健，夜生人最要恬静。合而体用两全，离则体用两失。再察太阳，昼生未到辰时，尚不嫌其弱；夜生未到戌时，还要论其强。故卯时生人，虽丙丁姤合而不妨；酉时生人，虽焚膏继晷而亦不害。后论参前论，诚不易之理也",
        ],
            "丁": ["丁火属阴，乃阴柔传灯之火，可亲可炙。或取于树，甲乙，或取于石，庚；或取于引化，壬。"
            ,"总喜就燥，不喜就湿，喜夜不喜昼。易生于干薪，难生于湿木。甲喜其一二，乙喜其全。癸实难堪，壬为最好。"]
            ,
            "戊": ["戊土属阳，乃冈陵山阜之土，博厚高大，最为得体。更喜乔木以壮观瞻，则山有色；流水以结知音，则山有神；峻石以成峭厉，则山有骨，三者备而富贵福泽无穷矣。大抵天下名山，定然山明水秀，不乏峻石乔松。若无火为暗山，无木为童山，无金为媚山，无水为枯山，便非佳境。再考此山，不妨官煞混杂。盖博厚之土，木愈多而山愈秀，何必分梧檟樲棘哉！"]
            ,
            "己": ["己土属阴，乃田园稼墙之土，所谓“茀厥丰草，种之黄茂”，先不可令官煞混杂，须雨旸时若，燥湿得宜，又要春耕喜木，夏耘喜水，秋收喜火，与金冬藏喜土；数者得其机宜，不至失节，则大有之年也。更知向白阳之地，春光先到，己逢丙火，无人不发。即有舒配酌取，不离丙火范围。己土最喜丙火，最验。但生于夏月，值火太燥，又当酌定。"]
            ,
            "庚": [
                "庚金属阳，乃铜铁剑戟之类，堪为大用。须先辨其生熟，然后酌其舒配。大抵寒凝未熟之金，必先木火煅炼，方得成器。若锋锐已成之金，必用金水淬田砺，可吐光芒。若比劫既强，怕财争起，唯身弱者，喜劫帮身。"
        ],
            "辛": [
                "辛金属阴，乃金玉珠宝之类。性地虚灵，气禀晶莹，先要印绶以资其质，更要食伤以吐其秀。阳和沙水，是其妙剂。大约精者不宜粗用，粹者不宜急投，遇春冬喜微火，夏秋喜清水。"

        ],
            "壬": ["壬水属阳，乃天河雨露之水。有云油然，则普润苍生，作福无涯；若无云之雨，即沟浍皆盈，其涸可以立待。故壬水先要密云，方为有用；至用甲乙吐气，又其次耳。及水旺用土，此去留舒配之论，非本体也。其云惟何？庚辛是也。"
        ],
            "癸": [
                "癸水属阴，乃河涧川泽之水。生于卯上，盖取木生水之说。喜林木茂盛，得以溶导源流。故喜乙木吐气，以生斐然之美，所谓“风来水面时”也。人生领此，决定文章科第，仍余清逸佳致。如无乙干卯支，则无文章可许。宁有庚申、辛酉相扶，则源流亦清澈可嘉。最不利者，戊癸化火，反使利令智昏。"
        ]
        };
       
           //十干喜忌诗诀【管见子平】
           var guanjianzipingrigan = {
            "甲": [
                "甲木枝干春向荣，土金火透最为亨。庚辛不忌逢壬癸，戊己何妨见丙丁。官杀印乡多富贵，食伤财地必峥嵘。虎猪蛇鼠生逢时，跨凤乘龙上帝京。"
                ,"甲木属阳，乃枝干之木，生值春月，正当生旺，必假金以剥制，方成栋梁之才。设若无金，必得厚土。如土金俱无，必丙丁火透出，以泄其旺气。此三者，只是太过，宜脱之、剥之之象。不过，取其中和耳，别无他论也。如庚辛申酉，金气多者，见壬癸水为用。戊己，土气厚者，必得丙丁火为用。此杀官喜印、伤食喜财，只要五行所得之意。虎，寅也;猪，亥也;蛇，巳也;鼠，子也;鸡，酉也;龙，辰也。时元值之，上贵之命也。"
        ],
            "乙": [
                "乙为根蒂做天干，不用金剥火是官。"
                ,"曲直体成南去乐，从革局就北来观。"
                ,"财强杀旺名中外，水浅金轻伤肾肝。"
                ,"马猴时遇多荣达，鼠兔加临作贵看。"
                ,"乙木属阴，乃根蒂之木;生于春三月，正当有气;必得金制，方能成功。如无金，必得火透天干，有木火通明之象。赋云：火明木秀，斯人不负经魁。若四柱纯木，以成曲直之体;喜行南运，取贵。若四柱金多而成从革之体;喜行北运，取贵。四柱少水生，而无金剥，多主肾部、肝经不足之病，性多恼怒，盖肝藏气故也。财强杀旺，为之财滋七杀，令名必扬中外也。午申子卯，四时生人，多主富贵。"
        ]
,
            "丙": [
                "丙为阳火号文明，金水相逢极有情。"
                ,"巳午见官终不显，子申遇印始成名(论提纲)"
                ,"贫穷有学谈天地，富贵无缘靠弟兄。"
                ,"用入库乡当退位，休言伐木鸟嘤嘤。"
                ,"丙火属阳，乃文明之象，生于金水提纲，多主富贵，此禄马旺地，故有情也。"
                ,"生巳午提纲，官星无气，又行东南运，其官终不能显。"
                ,"如生子申月令，财官有气之地，但得岁运印绶一生之，其功名必成。"
                ,"生于夏月，财官俱弱;身虽贫贱，有谈天论地之才学;盖丙主礼，又主文明故也。"
                ,"生金水旺时，财官得令;而比肩无力，多不得弟兄辅助;或暗中有生扶，却有贼恩之祸。但怕用神入库，当有退位休官之叹，而无出谷迁乔之理。又当审辨，用之轻重，库之开闭。如原柱中有库，岂可又以库言哉。"
        ],
            "丁": [
                "丁火其形本属阴，阳光许助结同心。"
                ,"藏财(丁酉)坐贵(丁亥)偏宜甲，跨马骑牛最爱壬。"
                ,"财杀旺时名愈重，水金衰处困尤深。"
                ,"二阳产降逢天乙，爕理阴阳妙用金。"
                ,"丁火阴柔，得阳火助之，方美。"
                ,"十段锦云：丁为阴火，喜遇阳壬，见丙兮百年安逸。盖谓丙内藏辛，丙邀辛金，为丁火之偏财，亦助丁火之光;故云结同心也。"
                ,"财星喜藏，贵人宜坐，甲木宜透，此为贵命也。"
                ,"午丑二字，用之扶助;盖午丁火之禄，丑乃丁火财库，二者宜见之为妙。"
                ,"壬水正官，岂不最爱之?如生寅卯提纲，为印绶，喜见壬水为官。如财杀并透，有力者，大富贵之命。"
                ,"但水金衰弱，定主蹇滞。如丁火生于季冬月令，财杀并透，又有天乙贵人辅助，此乃宰相之命也。宜斟酌较之，庶无差忒。"
        ],
            "戊": [
                "戊为阳土即丘陵，坐库藏财贵有恒。"
                ,"甲乙旺时名愈重，财干墓地寿难凭。"
                ,"五行生处为佳兆，三合逢时是福征。"
                ,"印重财轻官杀坏，伤残肢体病难胜。"
                ,"积土为丘;王冢曰陵。皆动而有成之象。戊土属阳，故以此二者喻之。坐下库，谓之有根;藏有财，谓之不燥。合此二者，不但主贵，亦主有恒。盖土主信，体用相宜，乃禀中和之气。日主有气，再得官杀旺相，功名自然显达。如专用财，又行财星墓地，只恐难为寿矣。且财星之墓，此人多患脾胃之病。土能长养万物，故喜生气。土合则厚，必无倾颓之患。三合逢之，自为福利。如四柱印绶太重，又无财星，官杀俱绝，又无食伤，火炎土燥，疾病可知矣。"
        ],
            "己": [
                "己土平平一野场，多金多水亦多光。"
                ,"攀龙附凤声名重，跨马骑牛姓字香。"
                ,"身旺官星原有用，主强七煞应无伤。"
                ,"支干带合根基厚，堪与皇家做栋梁。"
                ,"己土属阴，而主静，为平地野场之土。喜伤食、财星，愈多愈妙。柱得辰酉二字，以益其体。午丑二字，以助其用。如此者，体用相益，自然显达。日主旺相，见官星七杀，则主荣贵。赋云：木疏季土，培成稼穑之禾。岂不宜见乎?凡用土必要见合，则无虚崩之患。如五行带合，不偏不党;财官得所，不重不轻，无混杂之病;得中和之气，岂不为国家栋梁乎?辰丑酉午四字，非柱中见之为吉，岁运逢之亦美。"
        ],
            "庚":[
                "庚金锋锐旺秋天，冬月生人更妙玄。"
                ,"木火绝嫌西与北，水金旺爱走东南。"
                ,"时逢申子财名备，柱带牛羊富贵全。"
                ,"埋没不遭金水旺，管教万里掌兵权。"
                ,"阳金质刚，秋正司权，其体自然锋锐。生于冬月，有金水澄清之象。赋云：金白水清，此辈定登甲第。又云：金兼爱水之相涵，文学堪夸。可见用金要水，有金水相涵之秀，是其妙且玄也。柱中如水火俱绝而无气，忌行西北冷运。如水金乘旺，喜行东南方暖运。如得申巳二时，乃得禄、长生之地，多主富贵，财名并有。丑未，乃庚金贵人、财库之地。富贵双全，更要日干有气，财官旺相，见之者，妙。如日主轻，财官弱，又非也。不遭戊己土埋没，而合金水澄清，再有杀刃帮扶，定掌兵权之贵。"
        ]
,
            "辛": [
                "辛金原自土中生，木火提纲福不轻。"
                ,"时遇虎龙多富贵，提逢亥子更聪明。"
                ,"逆行西北还淹滞，顺历东南定显名。"
                ,"但虑冬前寒太极，虽逢暖地只平平。"
                ,"阴金本无形质，赖土以生;土愈多，而金愈厚矣。木火提纲，时元有助，其福难量，要以轻重较之，方可用寅辰二时，值之者，多主富贵。盖寅时财官生旺，又是天乙贵人之地。辰时内含水土库，正印扶身，水涵秀气。赋云：辛日壬辰贵在申者是也。如值多子提纲，主人聪明秀丽。西北背禄逐马之运，名利多淹滞。东南地暖，财官乘旺之乡，功名自然显达。但忌生于冬至以前，天地之气大寒。虽行东南方和暖之地，亦只平常之命也。"
        ]
,
            "壬": [
                "汪洋壬水旺三冬，最爱干头火土重。"
                ,"秋降勾陈能作吉，春生朱雀岂为凶。"
                ,"三方火局偏宜合，四库提逢不忌冲。"
                ,"龙虎重重时日月，禹门神鲤化蛟龙。"
                ,"水归冬旺，以时而言，必得火土透出，取贵。生于秋月，为印绶提纲，必得官杀透出，始吉。如生寅卯提纲，乃是伤官食神，必得财星，方能取其贵也。三方合成火局，有既济之象。生于四库提纲，必得冲开，方美。如日主、月令、时元，见寅辰二字多者，非壬骑龙背，必六壬趋艮。以神鲤而变蛟龙，乃大贵人之命也。"
        ],
            "癸":[
                "癸水池塘应不流，文含玄武可行舟。"
                ,"申辰格备形如虎，寅午局全气食牛。"
                ,"印重南方偏喜悦，财多北地岂忧愁。"
                ,"坐库身强火土旺，为官必定效伊周。"
                ,"癸水属阴，静而有常，故以池塘而喻之，盖阴主平静。如支下类成水局，上下交感，静极而动，可以通行舟楫矣。如申子辰三合备，天元有气，有大人虎变之象。寅午戌火局全者，水旺逢火，合成既济之名，自有食牛之志。印旺者，喜行财运。财多者，爱入劫乡。不过取中和之气，别无他议也。如坐下丑库，又重重见丑，为丑遥巳格。如无伤破，则有伊尹周公之勋业，乃宰相之命也。"
        ]
        };

           // 十干行运口诀
        var shiganxingyunkoujue = {
            "甲": [
                    "甲运比肩百事强，家内吉昌人口旺；买卖诸谋皆称意，五载亨通福禄祥。",
                    "乙运劫财运逢衰，吉星消除祸星来；谋为进退多不利，谨慎二字可免灾。",
                    "丙运食神也不良，财来财去口舌伤；小心营谋略称意，一兴一衰度时光。",
                    "丁运伤官大不祥，损人失财难保双；若逢四柱有克制，除凶化吉反高强。",
                    "戊运偏财则兴旺，成败二字也难断；虽然赚钱千万贯，只恐有时不周祥。",
                    "己运正财时运来，甲与己合事和谐；东做西就谋皆顺，添人进口又进财。",
                    "甲日庚运七杀乡，甲木用金反吉祥；努力作事百事强，好似西汉刘关张。",
                    "辛运正官大高强，五载亨通百事昌；好似孔明借东风，不怕曹操百万将。",
                    "壬运枭神必见刑，泥尘走马有困顿；草道片云无大雨，须防尺水起波涛。",
                    "癸运正印生身无，甲逢癸水且遭苦；日夜思想千条路，恼恨命运不作主。",
                    "子运印绶虽吉祥，甲木败子也不良；诸事求谋不顺意，一成一败度时光。",
                    "甲日丑运逢正财，谋为称意事和谐；纵有小厄无大害，吉星临门福禄来。",
                    "寅运禄堂大不良，不见孝服有刑伤；须防一牛生两尾，伯夷叔齐谏武王。",
                    "卯运劫财不为高，财来财去空白劳；灾祸口舌是非有，曹操错走华容道。",
                    "辰运天罗大不祥，人命遇此难保双；莫说此运全无事，要防浅水起波浪。",
                    "巳运食神偏官财，甲木病巳且有灾；略施小计谋称意，恐怕不防伤害来。",
                    "甲日午运遇死运，人财两耗不须问；纵无难关之大阻，要防叩马小灾侵。",
                    "未运墓库犹带财，此运财来祸也来；五载之中三年利，贵星驾临可免灾。",
                    "申运无事平平过，须防刑冲小灾祸；甲木用金可成材，百事顺遂人欢乐。",
                    "酉运辛金正官位，丰衣足食五年利；丰年响粟无忧虑，白莲池内生香气。",
                    "戌运行来未为奇，不见刑伤无利益；赚得千文去一贯，破害难免强支持。",
                    "亥运本来坐长生，甲木何必要印星；是非灾厄朝朝见，家不安宁事不成。",

           ],
            "乙"
            :[   
                "乙日甲运劫财乡，人财耗散口舌伤；虽然五年无大害，慎防溪水起波浪。",
                "乙运比肩命运高，顺水行船人欢笑；财喜两旺多吉庆，好比石崇且富豪。",
                "丙运伤官也不妨，太阳普照反为良；五年发达财喜旺，春来秋去不花香。",
                "丁运食神且不然，好比岩前走马险；任君用尽千般计，年终还是光串现。",
                "戊运正财时运来，春天花开事和谐；枯木逢春有生气，月到十五花正开。",
                "己运偏财何须愁，时来财来祸也有；小心谨慎无大害，马遇猛虎且有忧。",
                "庚运正官时运福，芙蓉夹岸得人扶；日晴夜雨诸事顺，无忧无虑且无阻。",
                "辛运七杀逢大凶，乙木遇之有刑冲；钱财进退犹小可，吕布夫妇见关公。",
                "壬运正印生身复，五年享福无劳碌；四柱水弱大吉利，水旺逢此则有阻。",
                "乙日癸运是枭神，人不宅宁事不成；不见灾厄跌打伤，恐见车祸分肢身。",
                "子运枭神又逢病，蒙糊饭后听钟声；人财两耗大不利，转眼不觉二天星。",
                "丑运逢衰而果衰，不损人口恐失财；莫言此运容易过，孔圣常厄在陈蔡。",
                "寅运行来大吉昌，拨开云雾见太阳；且有五年逍遥福，太公渭水见文王。",
                "卯运禄堂且不妨，饥人得禄有主张；若是饱人遇此地，不见素马鼓盆狂。",
                "辰运天罗反为良，财禄渐进喜气扬；五年之中三年利，寒仔萧条不久长。",
                "巳运败地时不济，求财作事无利息；伸手想要天边月，脚下无能步云梯。",
                "乙日午运坐长生，百事亨通都顺心；洽似坦途骑骏马，月到中秋分外明。",
                "未运五年不为奇，内藏食神有蹊跷；休言此运无大害，也防乌云下大雨。",
                "乙日申运大亨通，船到江心遇顺风；家内平安财禄旺，三月桃花遍地红。",
                "酉运七杀绝地乡，韩信功劳不久长；若能跳过潭溪处，广积阴德家运畅。",
                "戌运墓库且不祥，首阳山下叩武王；刑伤破害都见过，中秋月圆喜气扬。",
                "亥运推来是阴位，不冲提纲不见亏；吉人自有天保佑，北河射燕遇仁贵。",
                ]
            ,
            "丙": [
                "丙日甲运是枭神，披麻失财小人侵；五年虽然无大害，阴多晴少不安宁。",
                "丙日乙运是印绶，太阳见木反为仇；莫言此运全无事，求得马来人难周。",
                "丙运比肩大吉祥，好似子牙遇文王；凡事作为皆称意，家事顺风人丁旺。",
                "丙日丁运是劫财，丙夺丁火且无灾；出入求谋只管去，逢凶化吉福禄来。",
                "戊运食神则无妨，身旺逢此不见伤；但言五年大吉利，兴隆无败度时光。",
                "丙逢己字伤官运，东去西来事无成；虽然谋财见其利，春草下塘枉费心。",
                "庚运偏财且顺遂，谨慎作事方如意；五年进财恐跌跤，艳花无子又无益。",
                "辛运正财运渐高，添人进口家富豪；任君谋为皆称意，船遇顺风说运好。",
                "丙日壬运是七杀，太旭峥水不须夸；不妨五载无灾祸，财如湧泉雨復花。",
                "丙日见癸好运程，何劳辛勤费精神；推来万般都是命，只是由命不由人。",
                "子运正官事事强，家宅清洁人安康；商艺求财多如意，蛇变蛟龙福禄旺。",
                "丙日丑运是正财，内藏己土有小灾；非为谨慎换吉利，无心插柳柳成荫。",
                "丙日寅运是长生，身弱逢此两相因；叵道五年全无事，须防小灾敬神灵。",
                "卯运逢败大不祥，不损财来人口伤；任你用尽千般计，独兔遇狼灾难防。",
                "辰运虽然是天罗，不逢辰冲无灾祸；诸事求谋皆如意，蛟龙得水泳川河。",
                "巳运禄堂偏财乡，人不安宁入虎狼；饥人得禄不犹吉，韩信当初遇张良。",
                "午运阳刃伤官地，不见失财有灾至；好比春茑出山谷，解救之人是故知。",
                "未运是库又逢泉，吉星不见灾星来；小心谨慎平平过，不然恐有不预灾。",
                "申运偏财七杀程，丙火遇水长精神；五年滔滔大顺遂，天赐福禄喜临门。",
                "酉运正财此程豪，丙火死酉也不高；出人钱财要小心，莫与光棍小人好。",
                "戌运墓库地纲运，求谋各项事难成；三寸金条且说小，八幅绳子恨水深。",
                "丙日亥运是绝地，愁眉不展又何疑；好似旧镜生尘土，谨慎行事待来时",
            ],
            "丁": [
                "甲运正印时运来，好似秋天菊花开；求财谋利皆遂意，添人进口财丰泰。",
                "乙运枭神且不利，人财两耗不须疑；浮萍遇雨行无定，凡事谨慎不宜西。",
                "丙运劫财且辛苦，灾厄刑伤犬遇虎；日想夜思千条路，命该此运事有阻。",
                "丁运比肩两相宜，求谋犹如步云梯；枯木逢春有生机，福禄荣华世稀奇。",
                "戊运伤官必见伤，花正开时遇风狂；小心作为略称意，只恐家宅见乐昌。",
                "己运食神也不好，纵然无事有烦恼；赚得千文用一贯，船行上水难撑篙。",
                "庚运正财好运程，家宅清泰喜盈门；晚秋黄菊五十富，风平浪静任舟行。",
                "辛运偏财不为高，只怕小人两面刀；人在明处防暗伤，上山不怕虎蛇咬。",
                "壬运正官反不成，丁火遇水必伤刑；马行无力皆因瘦，人不风流只为贫。",
                "癸运七杀无利益，不损人口有祸事；龙游浅水遭虾戏，虎落平原被犬欺。",
                "子运七杀绝地乡，韩信追赶楚霸王；如若跳过马家渡，寥莪咏鼠诵子壮。",
                "丑运墓库难保全，灾厄刑伤小人陷；提防一牛加一画，雪拥能关马不前。",
                "寅运又是不好行，丁逢死寅有灾星；五年休说无利益，只怕渡马不渡人。",
                "卯运枭神逢病地，虽无刑伤无利益；五年寂寐愁眉过，欲得好景待后期。",
                "辰运天罗欠亨通，钱财进退恐有凶；有缘千里来相会，无缘对面无动中。",
                "丁日巳运且不该，不见孝服有祸灾；若言此处无利益，天街走马防失财。",
                "午运禄堂也无妨，关公辅助刘备皇；根稳何怕风摆动，饿马得粮又还阳。",
                "未运虽佳又不好，财喜旺相有烦恼；神灵保得家财利，贵人赐福显英豪。",
                "申运败地命相逢，百计徒劳总有空；屋漏更遭连夜雨，破船又遇顶头风。",
                "丁日酉运是长生，五年顺利长精神；添人进财百事吉，拨开云雾见天星。",
                "戌运推来诸谋顺，只管营谋无愁心；五年出入财称意，惟恐身旺天转阴。",
                "亥运虽好而不美，五年之中多进退；纵有小厄无大害，孔圣也要遇桓魅。",
            ],
            "戊": [
                "戊日甲运七杀乡，纵有灾祸也无妨；五载欣荣容易过，只恐小人舌不良。",
                "乙运正官也不强，戊土城墙见木伤；此处啾唧躲不免，淮阴当初遇霸王。",
                "丙运枭神事不成，灾厄终寝或破镜；难免五载全无事，须防失财小灾侵。",
                "戊日丁运是印绶，身弱遇此且解忧；顺水行船滔滔过，不用计谋事圆优。",
                "戊运比肩好运程，家宅平安百事成；进出利禄皆称意，钱财丰盈福满门。",
                "戊日己运是劫财，五年难保全无害；不见麻衣及灾祸，好比残花遇雨来。",
                "庚运食神财不妨，谋为称心人口旺；五年之中三吉祥，两年有此小灾殃。",
                "辛运伤官不为良，财难无易见刑伤；此运莫说无大害，恐防溪水起波浪。",
                "壬运偏财有来头，钱财来时喜也有；纵有拨渣且无碍，逢凶化吉不须愁。",
                "癸运正财且顺时，五年何劳苦操持；东成西就人口利，正是久晴得甘露。",
                "子运正财得高强，洞里鸣琴无祸端；百行事业皆如意，家中人口常安康。",
                "丑运伤官劫财乡，五年旺衰混不良；旷屋安眠平无虑，不然切恐见灾殃。",
                "戊日寅运坐长生，内藏甲丙不安宁；虽然人说好美景，实是阴多又少晴。",
                "卯运行来是正官，戊日败卯事多端；五年莫说运好过，有马无鞍骑不安。",
                "戊日辰运是天罗，何必劳禄苦蹉跎；内藏正财生福贵，蛟龙得水游江河。",
                "巳运禄位不算良，灾厄刑伤不吉祥；不祥凶兆牛二尾，劬劳衰泳鼓湓涨。",
                "午运劫财不须防，韩信巧会贤子房；困龙自有凌云时，三请卧龙诸葛亮。",
                "未运逢衰有忧愁，劳碌风霜苦强求；此运虽然无大害，小灾小难且也有。",
                "申运偏财与比肩，求谋称意百事全；亨通顺昌安然过，可算人间一乐仙。",
                "酉运行来是死地，人财有损不须疑；惊鱼浴沼有险难，翁里春风且有时。",
                "戌运本是墓库运，行走不宁坐不宁；五年针毡过熬前，转眼不觉二天星。",
                "亥运偏财七杀乡，命限逢绝实不祥；一成一败忍耐过，只怕又是雪上雪。",
            ],
            "己": [
                "甲运正官好运程，百事求谋且称心；恰如平地骑骏马，风调雨顺好收成。",
                "乙运七杀有跷蹊，出入不利有何益；莫说五载无凶险，花园雨树少人知。",
                "丙运正印则顺心，苏秦时来见卫君；兴家立业从此起，月到十五分外明。",
                "己日丁运是枭神，人不安宁事不成；灾厄刑伤疾苦多，家内犹恐雁失群。",
                "戊运败财且有愁，去路又大来路小；挣得钱财难肥己，危楼望月后有忧。",
                "己运比肩最高强，太公渭水遇文王；时来勃惊腾王阁，春来花开鲜艳旺。",
                "庚运伤官盗气来，不损人口恐失财；犯煞犯邪须送出，不及神鬼见下台。",
                "辛运食神不为良，内外是非多刑伤；牡丹纵好空入目，菊花虽艳也不香。",
                "壬运正财人说佳，石崇富贵锦上花；目下就得东风力，十五月影上窗斜。",
                "癸运推来是偏财，财来财去无祸灾；敬信神灵方称意，吉人天赐福禄来。",
                "子运绝地逢偏财，灾也有而财也来；一进一退平平过，不遇刑冲无大害。",
                "丑运墓库行来差，事多淆杂乱如麻；男女不信神杀侵，切恐刑伤两交加。",
                "寅运五载三年利，龙落田中被人欺；若无难关太阳滞，也防叩马小灾厄。",
                "卯运七杀也遭苦，口舌刑伤见病符；任你思想千条路，命中注定事有阻。",
                "辰运逢衰也不周，命中遇此不自由；世上难逢百岁人，何必苦怀千载忧。",
                "己日巳运好美景，四柱无刑两相因；近水楼台先见月，向阳花木早逢春。",
                "午运禄堂又不成，恐见堂奠损镜文；人财两失不吉利，饥人得禄反占因。",
                "未运推来倒不妨，财禄旺相喜气扬；五年之中三年音，两年有些小灾殃。",
                "申是败运不逢时，辛有救星无大虑；莫讲五年全无事，须防内里有跷蹊。",
                "酉运长生运渐佳，四柱无冲二月花；东成西就百事顺，月下凉风无拨渣。",
                "戌运推来不中用，幼年切忌不可逢；老来遇此多不利，人事闲气一场空。",
                "己日亥运则顺畅，甲与己合有商量；五年运气家门利，仁贵征东救大唐。",

                         ],
            "庚":[
                "庚日甲运偏财是，财禄渐来喜渐至；只要借得东风力，不怕险恶大阵势。",
                "乙运正财百事强，人增财湧大吉昌；锦绣绿柳花吐芳，风吹稻田谷沙响。",
                "丙运七杀命较好，火炼庚金有功劳；五年财利算顺遂，要防小人口舌咬。",
                "丁运正官事端祥，火功炼丹贵非常；家泰人安诸事顺，船行江中风助航。",
                "戊运枭神确不良，不见灵荐有刑伤；倘无破支守孤灯，只恐信侯追项王。",
                "己运正印身有助，身弱遇印反成福；斯人逢着好运境，五年钱粮满仓库。",
                "庚运比肩是顺程，各项事业两相因；财喜同来好佳境，高楼望月事业兴，",
                "辛运劫财不为高，披星力持事多劳；损伤二字则难说，谨防人心两面刀。",
                "庚日壬运食神位，五年平过不见亏；休言此运容易过，要防不测小灾厄。",
                "癸运伤官事不成，不伤人口财有损；熬熬煎煎过五载，马奔山前且难行。",
                "子运行到马家地，夕阳桥下水东流；人财两凶大不利，彭祖八百也回首。",
                "丑运墓库又不强，失财呕气最难挡；五年之中二年利，淮阴受难遇子房。",
                "庚日寅运逢绝地，幸有德星小灾厄；华容道上走好人，却是云长放操归。",
                "卯运推来正财乡，财顺添丁双和祥；东西挣得财喜旺，春来无处不花香。",
                "辰运养地且无妨，财来财去无灾殃；好似群莺扑蝴蝶，才子守困何久长。",
                "巳运五载大亨通，财来顺遂喜相逢；灵臣五十官豪富，广积钱粮胜石崇。",
                "午运正官正印裁，庚金午败不为坏；此运莫言全无害，小心慎防凶灾来。",
                "庚日未运行来顺，百事亨通喜丰盈；壮士坦途骑骏马，刘备上山请孔明。",
                "申运禄位平常运，辛苦劳碌勤为顺；推来万般都是命，确是天命不由人。",
                "酉运是个劫财乡，财多遇劫也无妨；谨慎积德无灾害，不然切恐见损伤。",
                "戌运逢衰且无妨，火制良金无祸殃；甘罗十二岁为相，太公八十遇文王。",
                "亥运食神偏财运，庚金病亥事难成；财来财去运不吉，提防灾厄小人侵。",
             ]
            ,
            "辛": [
                "辛日甲是正财运，财禄渐进喜在眉；穷人闹市无人问，富在深山有远情。",
"乙运偏财不为奇，财来财去且无益；何必用尽千般计，灾煞远送安泰自。",
"丙运正官强精神，太阳高照却有情；春景老梅多茂盛，时来运转得黄金。",
"丁运七杀多驳杂，蛟龙无水难腾达；五年刑伤且难保，积德行善后运佳。",
"辛日戊运是印绶，不必过劳财禄有；财来家和大顺遂，十年难逢金满斗。",
"己运枭神不相因，输财呕气有刑损；任你计谋件件灵，只是徒劳枉费心。",
"辛日庚运劫财乡，磨房受苦李三娘；五年拨渣说不尽，风刮乱丝无头状。",
"辛运比肩两相宜，财进财出有喜气；黄河尚有澄清日，那有人无得运时。",
"壬运伤官不好行，只怪昔日出采薪；灾厄病苦多刑害，神煞消除等吉运。",
"癸运推来是食神，疾苦贫穷都是命；那个不想运境好，只是由命不由人。",
"子运长生地好行，不用计谋百事顺；有心栽花花不开，无意插柳柳成阴。",
"辛日丑运三月景，春风送暖喜气新；五年之中三年吉，两年有阻查分明。",
"寅运顺遂喜洋洋，荷花出来满池塘；花艳眼前人人爱，孟子曾见梁惠王。",
"卯运偏财又逢绝，虽无祸殃有刑克；彭祖寿高八百岁，有话不对妻儿说。",
"辰运墓库是天罗，不损内子见蓼莪；百般谋为不遂意，牛郎织女恨天河。",
"巳运死地不为良，颜回三十二岁上；不嗟赵五壮子事，只恐反己大灾殃。",
"辛日午运大不强，伯夷叔齐在首阳；人财两失须要见，惟虑薜刚来反磨。",
"未运虽衰而不衰，好比韩信拜将台；五年小心多吉利，天赐荣华降福来。",
"申运伤官反有情，出入谨慎两相因；流水下滩非有意，白云出岫本无心。",
"酉运禄堂且欢彩，饿人得禄反为美；饱人遇此须防灾，云龙凤虎有阻碍。",
"戌运七杀比肩乡，五载之中两年强；好似松柏岁日寒，云龙遇会前程良。",
"亥运败地和正财，财喜有而祸也来；小心出入略称意，不然切恐见伤灾。", ]
            ,
            "壬": [
                "甲运食神无多利，虽不刑冲也呕气；一夜思想千般计，恼恨命运不遇时。",
                "乙运伤官逢大凶，不损钱财见刑冲；五年床上如荆棘，此运十齐九度空。",
                "丙运偏财喜气扬，百事顺遂大吉昌；好似雪里一青松，秦琼卖马遇单郎。",
                "壬日丁运正财乡，鲤鱼化龙诸事祥；点铁成金财运旺，年年四季有花香。",
                "戊运推来是七杀，是非口舌不须夸；五载财源无进退，事多混杂乱如麻。",
                "己运行来正官位，水多遇土反为贵；财旺生官多瑞祥，身弱遇此有刑厄。",
                "庚运推来是枭神，恐见车白萎乾坤；忽言易度五光阴，陈蔡葬泣厄圣人。",
                "壬日辛运是印绶，辛忌生旺反为仇；若遇身弱多吉利，凡谋皆如顺水舟。",
                "壬运比肩好运来，百事称意则和谐；鱼游春水性活泼，出入常得贵人抬。",
                "癸运劫财不相逢，财来财去有刑冲；花开鲜艳谁不爱，秋来无子一场空。",
                "壬日子运劫财乡，财旺逢劫也不乡；小心度日平安过，不然恐怕见灾殃。",
                "丑运正官正印裁，虽然逢衰也不坏；雨过青山多秀丽，春天到处百花开。",
                "寅运逢春不为良，失财呕气有刑伤；纵然五年无大害，雁飞秋水须防降。",
                "卯运死地大凶险，口舌是非小人牵；人财两损一孤雁，岩头绮马足难前。",
                "壬日辰运墓库同，蝴蝶见花眼前风；莫说五年无利害，雨里花开后便空。",
                "巳运绝地逢枭神，偏财七杀两难近；道傍野季谁知苦，心上无梅感酸芬。",
                "午运胎地好美景，钱财广招喜临门；好似月明梅花开，高楼吹笛乐称心。",
                "未运正财正官位，虽有小灾不见亏；任君求谋皆称意，自有风云大显威。",
                "壬日申运是长生，身弱遇此两相因；泥路步行这五年，余财呕气见跌倾。",
                "酉运败地逢印绶，壬水败酉反为仇；春园蝴蝶见花开，久来不舍则有忧。",
                "戌运正财临官地，财喜两旺不须疑；时来风送腾王阁，黄鹤楼中吹玉笛。",
                "亥运禄堂也不妨，求谋顺遂百事祥；秋雁晨翼飞腾乐，枯木逢春老吉昌。", ],
            "癸":[
                "癸日甲运是伤官，不免混杂事多端；送走煞星则吉利，蜜蜂贪花遇芝兰。",
                "乙运食神多古怪，彦贵挑水街前卖；人财两耗大不利，五娘也存怒百谐。",
                "丙运交来则亨通，云开见日佳境逢；家门清洁人丁旺，四月荷花映水红。",
                "癸日丁运是偏财，谋事称意且和谐；钱财顺畅喜也旺，敬神积德无伤灾。",
                "戊运正官虽劳碌，海月秋蝉事无阻；若是身弱有刑害，推车靠崖行窄路。",
                "己运七杀命运低，刑伤破害苦中求；早晨挣钱千万贯，晚间荷包似水洗。",
                "癸日庚运是印绶，身弱遇印有来头；今朝有酒今朝醉，明日愁来明日忧。",
                "辛运枭神不为祥，五龙二虎玉彦章；纵然保得残生过，犹恐薤露衰盆旺。",
                "壬运行到劫财乡，人命遇此不为良；好似败柳又逢霜，柳州城里杨文广。",
                "癸运比肩时运来，财喜两旺步金阶；风吹杨柳好美景，犹恐春来花不开。",
                "子运禄堂不吉祥，饥人得食则为良；饱人得食防有殃，苏秦运衰遇秦王。",
                "癸日丑运不为高，内藏辛金刑难熬；扁舟过海事难成，花圆排宴不为豪。",
                "癸日寅运正官逢，百事谋为尽亨通；五年之中三年吉，两年有些小灾冲。",
                "卯运长生是好运，谁知此处反遭因；身弱遇之多吉利，恰似枯木又逢春。",
                "辰运推来时运通，不遇刑冲则无凶；花逢春开多称意，财源滚滚喜事逢。",
                "癸日巳运最高强，麝过山头草木香；弄璋弄瓦多吉利，周朝创业周武王。",
                "午运偏财逢七杀，纵然绝地君何怕；人生兴衰自古来，拨开云雾见开崖。",
                "未运行来多快乐，鱼水同欢且蹉跎；财喜兴旺人口顺，蛟龙得水归川河。",
                "申运又是不良运，灾厄刑伤小人侵；洛阳桥上花如锦，待我来时不还春。",
                "酉运枭神运不高，虽不损伤有烦恼；凡事作主要谨慎，瞽人疾马过独桥。",
                "戌运逢衰而不衰，逢凶化吉反招财；翁里牡丹难得吉，贵星驾临可免灾。",
                "亥运败财伤官连，人命遇此多不闲；昔日螳螂去捕蝉，谁知黄雀在后边。", ]
        };
          //十干体象
           var shigantixiang = {
            "甲":"甲木天干作首排，原無枝葉與根荄。欲存天地千年久，直向泥沙萬丈埋。斷就棟梁金得用，化成灰炭火爲災。蠢然塊物無機事，一任春秋自往來。",
            "乙": "乙木根荄種得深，只宜陽地不宜陰。漂浮最怕多逢水，刻斫何須苦用金。南去火炎災不淺，西行土重禍猶侵。棟梁不是連根木，辨別工夫好用心。",
            "丙": "丙火明明一太陽，原從正大立綱常。洪光不獨窺千里，巨焰猶能遍八荒。出世肯爲浮木子，傳生不作濕泥娘。江湖死水安能剋，惟怕成林木作殃。",
            "丁": "丁火其形一燭燈，太陽相見奪光明。得時能化千斤鐵，失令難熔一寸金。雖少乾柴尤可引，縱多濕木不能生。其間衰旺當分曉，旺比一爐衰一檠。",
            "戊": "戊土城牆堤岸同，鎮江河海要根重，柱中帶合形還壯，日下乘虛勢必崩。力薄不勝金漏泄，功成安用木疏通。平生最愛東南健，身旺東南健失中。",
            "己":  "己土田園屬四維，坤深能爲萬物基。水金旺處身還弱，火土功成局最奇。",
            "庚": "庚金頑鈍性偏剛，火制功成怕水鄉。夏産東南過鍛煉，秋生西北亦光芒。水深反見他相剋，木旺能令我自傷。戊己干支重遇土，不逢衝破即埋藏。",
            "辛": "辛金珠玉性通靈，最愛陽和沙水清。成就不勞炎火煆，滋扶偏愛濕泥生。木多火旺宜西北，水冷金寒要丙丁。坐祿通根身旺地，何愁厚土沒其形。",
            "壬":"壬水汪洋並百川，漫流天下總無邊。干支多聚成漂蕩，火土重逢涸本源。養性結胎須未午，長生歸祿屬乾坤。身強原自無財祿，西北行程厄少年。",
            "癸": "癸水應非雨露麽，根通亥子即江河。柱無坤坎身還弱，局有財官不尚多。申子辰全成上格，午寅戌備要中和。假饒火土生深夏，西北行程豈太過。"
        };
        //滴天髓
        var ditiansuirigan = {
            "甲": "甲木参天，脱胎要火。春不容金，秋不容土。火炽乘龙，水宕骑虎。地润天和，植立千古。",
            "乙": "乙木虽柔，刲羊解牛。怀丁抱丙，跨凤乘猴。虚湿之地，骑马亦忧。藤萝系甲，可春可秋。刲(kuī)割取",
            "丙": "丙火猛烈，欺霜侮雪。能锻庚金，逢辛反怯。土众成慈，水猖显节。虎马犬乡，甲木若来，必当焚灭（一本作虎马犬乡，甲来成灭）。",
            "丁": "丁火柔中，内性昭融。抱乙而孝，合壬而忠。旺而不烈，衰而不穷，如有嫡母，可秋可冬。",
            "戊": "戊土固重，既中且正。静翕动辟，万物司命。水润物生，火燥物病。若在艮坤，怕冲宜静。",
            "己": "己土卑湿，中正蓄藏。不愁木盛，不畏水狂。火少火晦，金多金光。若要物旺，宜助宜帮。",
            "庚": "庚金带煞，刚健为最。得水而清，得火而锐。土润则生，土干则脆。能赢甲兄，输于乙妹。",
            "辛": "辛金软弱，温润而清。畏土之叠，乐水之盈。能扶社稷，能救生灵。热则喜母，寒则喜丁。",
            "壬": "壬水通河，能泄金气，刚中之德，周流不滞。通根透癸，冲天奔地。化则有情，从则相济。",
            "癸": "癸水至弱，达于天津。得龙而运，功化斯神。不愁火土，不论庚辛。合戊见火，化象斯真。"
        };

        //十干喜忌总纲
        var shiganxijizonggang = {
            "甲": [
                "喜用：庚丁"
                ,"十干所喜歌-岁运四柱皆喜用神一理而推：甲木挺生无根叶，庚金造作栋梁材，更爱丁火来吐秀，木火通明贵自来；"
                ,"十干所忌歌-岁运用神一理共推：甲木从来不怕金，支成金局有忧心，不怕土埋共火化，独愁壬水泛其身；"
        ],
            "乙":[
                "喜用：丙癸"
                ,"十干所喜歌-岁运四柱皆喜用神一理而推：乙乃花木爱丙荣，向阳花木易逢春，癸水雨露滋根本，芝叶禾稼尽相生；"
                ,"十干所忌歌-岁运用神一理共推：乙木微弱忌丁焚，不怕辛金只愁庚，贪合庚夫凶藏吉，运逢金库死无生；"
        ],
            "丙": [
                "喜用：壬甲"
                ,"十干所喜歌-岁运四柱皆喜用神一理而推：丙乃天边一太阳，甲乙之木焉能光，日逢湖海乾坤亮，专欣壬水辅阳生；"
                ,"十干所忌歌-岁运用神一理共推：丙火太阳出自天，却愁雨露水来掩，逢辛成合化成水，运逢辛酉落西方；"
        ],
            "丁": [
                "喜用：甲庚"
                ,"十干所喜歌-岁运四柱皆喜用神一理而推：丁火灯烛无他爱，专取甲木接引光，次取庚辛来劈甲，得令逢之焰亦长；"
                ,"十干所忌歌-岁运用神一理共推：丁火灯焰怕风雨，相逢癸水一场凶，湿乙不生无焰火，逢壬化木却有功；"
        ],
            "戊": [
                "喜用：甲丙"
                ,"十干所喜歌-岁运四柱皆喜用神一理而推：戊乃太山至不灵，用甲来劈有精神"
                ,"十干所忌歌-岁运用神一理共推：戊土高山洁且清，忌己湿泥沾其身，又忌乙木多搜破，逢癸化火反成禛； "
        ],
            "己": [
                "喜用：丙癸"
                ,"十干所喜歌-岁运四柱皆喜用神一理而推：己乃田园爱丙暖，逢癸可作美田称；"
                ,"十干所忌歌-岁运用神一理共推：己土田园本爱水，无癸却作旱田推，只怕壬水兴波浪，生茅淹死作沙泥；"
        ],
            "庚": [
                "喜用：丁甲"
                ,"十干所喜歌-岁运四柱皆喜用神一理而推：庚金顽钝可制熔，或用丙丁暖其身，更爱壬水来伤泄，土厚埋金甲有情；"
                ,"十干所忌歌-岁运用神一理共推：庚金从来不怕丙，丙火在天岂熔金，只怕壬水来寒滞，土厚埋金一场刑；"
        ],
            "辛": [
                "喜用：壬丙"
                ,"十干所喜歌-岁运四柱皆喜用神一理而推：辛金珠玉喜壬淘，土厚还须用甲高，冬乐丙火来解冻，己土湿泥酌用瘳（音chou ,意 “损害”）；"
                ,"十干所忌歌-岁运用神一理共推：辛金珠玉清必贵，只愁己土蔽金光，三冬雨露渄金爱，冻金困丙实堪伤；"
        ],
            "壬": [
                "喜用：辛戊"
                ,"十干所喜歌-岁运四柱皆喜用神一理而推：壬乐戊土为堤岸，又喜庚金发水源，甲丙两般皆酌用，当分衰旺理亦玄；"
                ,"十干所忌歌-岁运用神一理共推：壬水不愁太山土，水旺用为堤岸防，江湖死水须澄洁，却愁己土浊沧浪；"
        ],
            "癸": [
                "喜用：庚辛"
                ,"十干所喜歌-岁运四柱皆喜用神一理而推：癸快庚辛无别取，辛金清秀又为隆，若逢水冷金寒候，丙火解冻有奇功。"
                ,"十干所忌歌-岁运用神一理共推：癸水怕丙熬干性，又愁戊土塞根源，土厚无甲来疏劈，纵有庚金也不然。"
        ]
        };

        //女命十干诗诀流口
        var nvmingshiganjue = {
            "甲": ["甲夫巳午及寅宫， 遇丙合辛被火熔。 身旺食神家富足， 独眠孤枕怨春风。",
                "甲乙秋生夫正时，煞官若混细分之，舒配去留成格吉，丁丙引强困又离。",
                "注：甲乙用金为夫星，庚辛秋令得时，若官杀重见，分配去留不相混杀，聪明富贵。见丁丙重，时引强地，则又伤金为害。"]
            , "乙": ["乙庚夏月金正疲， 运向西方夫得时。 丙子（字）不来金水好， 东方遇乙贵分之。",
                "甲乙秋生夫正时，煞官若混细分之，舒配去留成格吉，丁丙引强困又离。",
                "注：甲乙用金为夫星，庚辛秋令得时，若官杀重见，分配去留不相混杀，聪明富贵。见丁丙重，时引强地，则又伤金为害。"]
            , "丙": ["丙夫夏癸月藏伤， 若遇庚辛酉地祥。 木火透干能泄水， 夫财虽旺难发长。",
                "丙丁冬月与秋同，独遇为奇乱则空，煞正官清居富贵，不堪混杂日临凶。",
                "注：水冬旺秋相，丙丁生秋冬夫星得地，官杀皆美。见官只论官，见杀只论杀，不宜混杂。清者富贵，乱者浊淫。"]
            , "丁": ["【缺】丁夫冬月与秋同， 独遇为吉乱则煞。 煞正官清居富贵， 不堪混杂日临凶。",
                "丙丁冬月与秋同，独遇为奇乱则空，煞正官清居富贵，不堪混杂日临凶。", "注：水冬旺秋相，丙丁生秋冬夫星得地，官杀皆美。见官只论官，见杀只论杀，不宜混杂。清者富贵，乱者浊淫。"]
            , "戊": ["【缺】戊夫春生木正青， 官杀多处见多情。 干支遇和方成吉， 会水会金又一评。", "戊己春生木正青，煞官多处便为情，支干遇合方成吉，会水会金又一评。", ""]
            , "己": ["己夫秋甲暗伤支， 乙见干头两佳期。  除是东方逢木旺， 击伤金木又交持。", "戊己春生木正青，煞官多处便为情，支干遇合方成吉，会水会金又一评。", "", ""]
            , "庚": ["庚夫金（冬）水月逢丁， 壬丙干头两见争。 富贵春风衾枕冶， 伤官支上怕分情。", "庚辛夏月丙丁藏，不透干头便是良，只恐杀官交互见，非惟不吉也争强。", "注：庚辛巳未月，或寅卯戌月，俱有财官，不宜丙丁多透，杀官混杂相伤。二丙一辛争合，俱为不吉。盖金生春夏，已失之柔，再透则太过故也。", ""]
            , "辛": ["辛官金（冬）水月夫轻， 再遇辛刃两度新。 行运木火难胜福， 不伤自己也伤人", "庚辛夏月丙丁藏，不透干头便是良，只恐杀官交互见，非惟不吉也争强。", "注：庚辛巳未月，或寅卯戌月，俱有财官，不宜丙丁多透，杀官混杂相伤。二丙一辛争合，俱为不吉。盖金生春夏，已失之柔，再透则太过故也。", ""]
            , "壬": ["【缺】壬夫(癸)如生季月中， 夏间土旺亦论同。 寅甲相连相重见， 重犯坐伤夫无功。",
                "注：壬癸生辰戌丑未月及夏中伏，夫星得时最吉，但不宜太过。若寅甲并见，食神重犯作伤官论，单见甲或寅则吉。一命庚辰癸未癸酉戊午，嫁富贵俊雅之夫，生四子受封。",
                "壬辰壬戌坐中夫，庚戌庚寅亦自殊；壬午甲申戊寅日，妇人得此福偏俱。", "注：此数日坐下夫星，只宜一位为福，此以日言也。\n" +
            "一命：庚申己丑庚寅庚辰，大富、八子、寿五十余。"]
            , "癸": ["【缺】癸夫生於寅卯中，合戊经行南地宜。 只恐干中明见甲， 自怜衾枕与谁依。",
                "壬癸如生季月中，夏间土旺亦论同，不宜寅甲连相见，重犯作伤反无功。",
                "注：壬癸生辰戌丑未月及夏中伏，夫星得时最吉，但不宜太过。若寅甲并见，食神重犯作伤官论，单见甲或寅则吉。一命庚辰癸未癸酉戊午，嫁富贵俊雅之夫，生四子受封。",
                "壬辰壬戌坐中夫，庚戌庚寅亦自殊；壬午甲申戊寅日，妇人得此福偏俱。",
                "注：此数日坐下夫星，只宜一位为福，此以日言也。一命：庚申己丑庚寅庚辰，大富、八子、寿五十余。", ""]
        };

        //孤鸾煞
        var guluansha={
            "乙巳":"木火蛇无婿,木火逢蛇大不祥",
            "丁巳":"木火蛇无婿,木火逢蛇大不祥",
            "辛亥":"金猪岂有郎,金豬何必強猖狂",
            "戊申":"土猴常独卧,土猴木虎夫何在",
            "甲寅":"木虎定居孀,土猴木虎夫何在",
            "丙午":"赤黄马独卧",
            "戊午":"赤黄马独卧",
            "壬子":"黑鼠守空房",
            "壬寅":"水虎定居孀",
        };

        //天年杀子人见亥，亥人见子。戍人见丑，丑人见戍
        var tianiansha={
            "子": "亥",
            "丑": "戌",
            "寅": "酉",
            "卯": "申",
            "辰": "未",
            "巳": "午",
            "午": "巳",
            "未": "辰",
            "申": "卯",
            "酉": "寅",
            "戌": "丑",
            "亥": "子"
        };


        /**
         *    用法：
         *    流年为原点 与日柱组合
         *    时柱为原点 与年柱组合
         *  六法冲克-细批终身详解 P616 论“大凶”
         *  “六法冲克”断生死关口 http://blog.sina.com.cn/s/blog_49d801fd0102dsp3.html
         *   纳音相克：纳音相克之中，是以地支隔一位者为重。 后退一位

         墓鬼相克：辰戌丑未地支相同，纳音相克。

         空亡相克：如甲子见庚申。

         夹拱生克：如辛未逢丙午，而见申、卯、午支。

         井栏互克：如甲戌见甲子。

         死生同途：如甲子见己亥、癸未。
         庄案：

         六法冲克是梁师根据《三命通会》卷十《看命口诀》归纳整理成六法冲克表，便利后学检索。
         唯此表错误极多，引用需谨慎。有一定基础者可据《看命口诀》予以修订。
         凡命怕同类相破，如己未见甲辰、甲辰见己丑、己丑见甲戌、甲戌见己未。凡在四冲之地，纳音同类，逐两位逆数之，寅申巳亥、子午卯酉亦以此取，主平生不足，多不成器道。《经》云：“井栏互破，无药可医，遇空亡庶几，岁运亦忌之。”
         原文甲戌见己未，梁师表中误为甲戌见甲子。余可类推。
         * [2017-08-03 add by longzhiyou]
         */

        //60甲子模板
        var jiazimoban = {
            "甲子": [""],
            "乙丑": [""],
            "丙寅": [""],
            "丁卯": [""],
            "戊辰": [""],
            "己巳": [""],
            "庚午": [""],
            "辛未": [""],
            "壬申": [""],
            "癸酉": [""],
            "甲戌": [""],
            "乙亥": [""],
            "丙子": [""],
            "丁丑": [""],
            "戊寅": [""],
            "己卯": [""],
            "庚辰": [""],
            "辛巳": [""],
            "壬午": [""],
            "癸未": [""],
            "甲申": [""],
            "乙酉": [""],
            "丙戌": [""],
            "丁亥": [""],
            "戊子": [""],
            "己丑": [""],
            "庚寅": [""],
            "辛卯": [""],
            "壬辰": [""],
            "癸巳": [""],
            "甲午": [""],
            "乙未": [""],
            "丙申": [""],
            "丁酉": [""],
            "戊戌": [""],
            "己亥": [""],
            "庚子": [""],
            "辛丑": [""],
            "壬寅": [""],
            "癸卯": [""],
            "甲辰": [""],
            "乙巳": [""],
            "丙午": [""],
            "丁未": [""],
            "戊申": [""],
            "己酉": [""],
            "庚戌": [""],
            "辛亥": [""],
            "壬子": [""],
            "癸丑": [""],
            "甲寅": [""],
            "乙卯": [""],
            "丙辰": [""],
            "丁巳": [""],
            "戊午": [""],
            "己未": [""],
            "庚申": [""],
            "辛酉": [""],
            "壬戌": [""],
            "癸亥": [""]
        };



        //纳音同类破，



        /**
         * 三命通会
         *  凡命，最怕鬼克，而
         *  窠鬼最毒。如丙子水见庚子土，丁丑水见辛丑土之类。窠中就位相克，所以最毒。
         *  有墓中鬼，如壬辰水见丙辰土，丙辰土见戊辰木之类
         *  有隔壁鬼，如庚子土见癸丑木之类
         *  有空亡鬼，如甲戌见甲申乙酉之类，皆主为害
         *  墓鬼轻于窠鬼，壁鬼轻于墓鬼，空鬼轻于壁鬼，
         *
         *  若鬼中有鬼，谓之鬼啸如土命人生木月、金日时之类，以木克土，金克木，根基劣弱则凶，主本强健不忌
         *
         *  若木命人得火月、金日时之类，有火克金，金不得伤木，是御鬼也，鬼不为害。
         *  如水命人，四柱有火土，土克水，火又生土，是助鬼也，其鬼尤凶。
         *  干支通用纳音最紧，御鬼则立身于艰难，助鬼则骨肉多生乎破斗。
         *
         *  五行精纪
         *  【鬼论】
         窠中鬼者，如丙子见庚子、丁丑见辛丑之类是也。
         隔壁鬼者，如庚子见癸丑之类是也。
         墓中鬼者，如水人见丙辰，土人见戊辰之类是也。
         空亡鬼者，如甲戌见甲申乙酉之类是也。（天元变化书）
         * [2018-07-19 add by longzhiyou]
         */

        /**
         *   用法：
         *   1. 日柱是key 流年是value
         * [2018-07-19 add by longzhiyou]
         */
        //窠中鬼
        var jiazinayinmuban = {
            "甲子": '海中金',
            "乙丑": "海中金",
            "丙寅": "炉中火",
            "丁卯": "炉中火",
            "戊辰": "大林木",
            "己巳": "大林木",
            "庚午": "路旁土",
            "辛未": "路旁土",
            "壬申": "剑锋金",
            "癸酉": "剑锋金",
            "甲戌": "山头火",
            "乙亥": "山头火",
            "丙子": "涧下水",
            "丁丑": "涧下水",
            "戊寅": "城头土",
            "己卯": "城头土",
            "庚辰": "白蜡金",
            "辛巳": "白蜡金",
            "壬午": "杨柳木",
            "癸未": "杨柳木",
            "甲申": "泉中水",
            "乙酉": "泉中水",
            "丙戌": "屋上土",
            "丁亥": "屋上土",
            "戊子": "霹雳火",
            "己丑": "霹雳火",
            "庚寅": "松柏木",
            "辛卯": "松柏木",
            "壬辰": "长流水",
            "癸巳": "长流水",
            "甲午": "沙中金",
            "乙未": "沙中金",
            "丙申": "山下火",
            "丁酉": "山下火",
            "戊戌": "平地木",
            "己亥": "平地木",
            "庚子": "壁上土",
            "辛丑": "壁上土",
            "壬寅": "金箔金",
            "癸卯": "金箔金",
            "甲辰": "复灯火",
            "乙巳": "复灯火",
            "丙午": "天河水",
            "丁未": "天河水",
            "戊申": "大驿土",
            "己酉": "大驿土",
            "庚戌": "钗钏金",
            "辛亥": "钗钏金",
            "壬子": "桑拓木",
            "癸丑": "桑拓木",
            "甲寅": "大溪水",
            "乙卯": "大溪水",
            "丙辰": "沙中土",
            "丁巳": "沙中土",
            "戊午": "天上火",
            "己未": "天上火",
            "庚申": "石榴木",
            "辛酉": "石榴木",
            "壬戌": "大海水",
            "癸亥": "大海水"
        };

        var chaozhonggui = {
            "甲子": ["戊子"],
            "乙丑": ["己丑"],
            "丙寅": ["甲寅"],
            "丁卯": ["乙卯"],
            "戊辰": ["庚辰"],
            "己巳": ["辛巳"],
            "庚午": ["壬午"],
            "辛未": ["癸未"],
            "壬申": ["丙申"],
            "癸酉": ["丁酉"],
            "甲戌": [""],
            "乙亥": [""],
            "丙子": ["庚子"],
            "丁丑": ["辛丑"],
            "戊寅": ["庚寅"],
            "己卯": ["辛卯"],
            "庚辰": ["甲辰"],
            "辛巳": ["乙巳"],
            "壬午": ["甲午"],
            "癸未": ["乙未"],
            "甲申": ["戊申"],
            "乙酉": ["己酉"],
            "丙戌": [""],
            "丁亥": [""],
            "戊子": ["丙子"],
            "己丑": ["丁丑"],
            "庚寅": ["壬寅"],
            "辛卯": ["癸卯"],
            "壬辰": ["丙辰"],
            "癸巳": ["丁巳"],
            "甲午": ["戊午"],
            "乙未": ["己未"],
            "丙申": ["甲申"],
            "丁酉": ["乙酉"],
            "戊戌": [""],
            "己亥": [""],
            "庚子": ["壬子"],
            "辛丑": ["癸丑"],
            "壬寅": ["丙寅"],
            "癸卯": ["丁卯"],
            "甲辰": ["壬辰"],
            "乙巳": ["癸巳"],
            "丙午": ["庚午"],
            "丁未": ["辛未"],
            "戊申": ["庚申"],
            "己酉": ["辛酉"],
            "庚戌": [""],
            "辛亥": [""],
            "壬子": ["甲子"],
            "癸丑": ["乙丑"],
            "甲寅": ["戊寅"],
            "乙卯": ["己卯"],
            "丙辰": ["戊辰"],
            "丁巳": ["己巳"],
            "戊午": ["丙午"],
            "己未": ["丁未"],
            "庚申": ["壬申"],
            "辛酉": ["癸酉"],
            "壬戌": [""],
            "癸亥": [""]
        };


        var jinbuhuan = {
            "甲子": ["甲日子提为印绶，顺行不似逆行高。官多杀盛东为美，午未相逢总徒劳。"],
            "甲丑": ["阳木天元值丑提，分明大运喜东西。发财发福多荣达，午未之中亦不宜。"],
            "甲寅": ["甲木生东值孟春，财多杀重定超群。顺行火地多难显，逆走终为富贵人。"],
            "甲卯": ["阳木春生值卯提，柱中有杀最为奇。不拘逆顺东南地，申酉相逢反不宜。"],
            "甲辰": ["甲木辰提喜有官，逆行东地弗为欢。顺行南地多颠倒，除是根深富贵看。"],
            "甲巳": ["阳木根深在巳月，柱中财杀喜相逢。逆行早岁声名显，顺行须防夭寿终。"],
            "甲午": ["甲木日干居午月，伤官木火喜生财。顺行怕入西方运，东北行来更妙哉。"],
            "甲未": ["阳木有根生六月，财官有气福非常。逆行最喜东方运，惟恐初生寿不长。"],
            "甲申": ["甲木无根值孟秋，财多杀旺恨身柔。运行顺地迟方好，逆运须防夭更休。"],
            "甲酉": ["甲木酉提用正官，顺行坎地必成欢。逆转南离官被制，须知禄尽见阎王。"],
            "甲戌": ["甲木戌提用财官，顺运东南福更宽。若得柱中逢亥未，逆行名姓达金鸾。"],
            "甲亥": ["甲木生元值亥提，柱中有杀更为奇。中年最喜东方运，午未之中数不齐。"],

            "乙子": ["乙木生居子月中，更无官煞喜匆匆。逆行大运非常美，无杀无官逆运通。"],
            "乙丑": ["乙木提纲值丑官，南方第一次西东。纵然名不登金榜，豪富终须比石崇。"],
            "乙寅": ["乙生寅月木伤官，财杀相逢更有欢。顺运连行多福禄，无财无杀亦贫寒。"],
            "乙卯": ["乙木提纲值仲春，财官有气亦超群。火金大运皆为美，白手兴家迈等伦。"],
            "乙辰": ["乙木辰提为杂气，西方大运亦为高。若行戌运多颠倒，刑并入财寿不牢。"],
            "乙巳": ["乙木相逢孟夏时，运行东北始为奇。柱中更值无根裔，顺运终防寿不齐。"],
            "乙午": ["乙木如逢午月天，食神有气怕身轻。柱中若是根基薄，大运提防喜逆行。"],
            "乙未": ["未月生逢乙日干，柱中官杀亦为欢。顺行西北伤元寿，逆走东南福更宽。"],
            "乙申": ["乙木生来值孟秋，财官印绶忌身柔。中年不许行西北，顺运无如逆运通。"],
            "乙酉": ["乙木酉月杀多强，大运功名佐庙廊。若是有根尤更妙，南行火运贵非常。"],
            "乙戌": ["乙生戌月多财杀，惟恐初年疾病生。若到中年多发达，不拘顺逆总宜行。"],
            "乙亥": ["乙木居亥印生身，逆走西南富贵真。有杀有官犹喜顺，到头大限怕逢辰。"],

            "丙子": ["丙火冬生值子纲，有印生身大吉昌。运入东南多发达，逆行难保寿年长。"],
            "丙丑": ["丙火如逢丑月看，土多格局作伤官。印多运入西方美，根浅东南福不全。"],
            "丙寅": ["丙多官杀值寅提，运入南方分外奇。若是官轻尤喜北，总然大运要行西。"],
            "丙卯": ["丙火日干卯提纲，干弱如逢喜火乡。若是无官尤不利，却行身旺亦平常。"],
            "丙辰": ["丙火辰提戊己多，伤官火土更如何。逢财逢印多通达，南北相逢总不过。"],
            "丙巳": ["丙火建禄日干强，官杀相逢大吉昌。顺逆运行多发达，若行戌运有灾殃。"],
            "丙午": ["丙火午月作伤官，有杀当为贵命看。金水运行多吉利，如行水地不为欢。"],
            "丙未": ["丙逢未月伤官显，官杀相逢未足奇。如得独官为贵气，运行西北利名驰。"],
            "丙申": ["丙火申提日主柔，得从得化始为优。若从水位伤元寿，逆去东南福禄周。"],
            "丙酉": ["丙逢酉月火衰微，比劫扶身寿不奇。逆去东南为背禄，顺行水地始为奇。"],
            "丙戌": ["丙逢戌月土重重，有杀无官回不同。大运顺行多富贵，若逢官杀亦中中。"],
            "丙亥": ["丙火亥提为杀印，分明大运喜东南。中年富贵非常美，运若西方寿不齐。"],


            "丁子": ["丁火如逢子月提，柱中有杀更无亏。平生最喜东方运，若到西方福不齐。"],
            "丁丑": ["丁火丑月事如何，四柱分明怕土多。运入东方俱发达，南方火地不相宜。"],
            "丁寅": ["丁火逢寅印绶明，柱中有水喜南行。运行北地尤通达，西方财乡祸患生。"],
            "丁卯": ["丁逢卯月有印星，南北应多遂利名。独杀若无官混杂，金章紫绶至公卿。"],
            "丁辰": ["丁逢辰月本伤官，顺入南方福更宽。逆运初年多蹇剥，更逢戌亥寿相干。"],
            "丁巳": ["丁逢巳月本刚强，大运何愁入水乡。运入顺行初不利，中年最喜入西方。"],
            "丁午": ["丁逢建禄本身强，无水须防寿不全。若得运中逢七杀，姓名远达九重天。"],
            "丁未": ["未月逢丁要见财，无财到底命多乖。若逢财杀方为美，西方大运更奇哉。"],
            "丁申": ["丁逢申月日干强，大运南方喜逆行。若是根深尤喜顺，中年发达更峥嵘。"],
            "丁酉": ["丁逢酉月用偏财，官杀相逢更妙哉。大运逆行多顺遂，功名两字称心怀。"],
            "丁戌": ["丁逢戌月伤官旺，官杀虽多却不防。南与东方多顺遂，荣华富贵福无疆。"],
            "丁亥": ["丁生亥月用官星，顺逆东南福不轻。若是煞星多混杂，寿年尤恐半凋零。"],

            "戊子": ["戊土日干生子月，坐支辰戌最为奇。支虚更值财神位，运怕东兮又怕西。"],
            "戊丑": ["戊土丑月日干坚，更有财官福寿全。逆顺运行俱得地，若无财杀亦徒然。"],
            "戊寅": ["戊土寅月日干轻，杀印相生格局明。运入火乡尤发达，逆行水地总平平。"],
            "戊卯": ["戊土卯月用官星，有印相生格局清。南运发财强北运，如逢酉地寿元倾。"],
            "戊辰": ["戊土辰月日干强，更有财星福禄昌。顺运西南应发达，财官轻处亦非良。"],
            "戊巳": ["戊土巳提为建禄，柱中财杀更为奇。逆行大运宜东北，顺走西南事不齐。"],
            "戊午": ["戊土五月印当权，大运分明喜杀官。官杀重时宜顺运，官轻逆运妙无端。"],
            "戊未": ["戊土生来季夏天，若无财煞未周全。逆行更喜东方运，顺逆财多亦不然。"],
            "戊申": ["戊土生申用食神，有财有煞贵堪伦。逆行火地必通达，火地行来反受屯。"],
            "戊酉": ["戊土生来值酉提，怕行坎水喜火离。除非四柱元辰旺，卯运相逢最不宜。"],
            "戊戌": ["戊土戌月日干强，财杀重逢更吉祥。运气不拘行顺逆，若无财杀亦平常。"],
            "戊亥": ["戊土亥提财杀真，身强有火更超群。逆行早岁须防酉，顺运中年忌卯辰。"],

            "己子": ["己土子月用财星,有杀无官格局清,大怕柱中身太弱,顺行寅卯早凋零."],
            "己丑": ["己土丑月日干坚,四柱分明忌比肩,若有财官并有杀,逆行大运福无边."],
            "己寅": ["己土寅月值身柔,若是身柔命不周,身旺更行南运美,逆行运气寿休囚."],
            "己卯": ["己土卯月杀当权,逆运须知寿不坚,顺逆火乡无极妙,官星相会不周全."],
            "己辰": ["己土辰提杂气真,财官有气定超群,顺行运气尤当妙,逆运行时不十分."],
            "己巳": ["己土巳月身尤旺,印绶伤官格局清,身旺最宜财运遇,无财逆运亦相应."],
            "己午": ["己土午月本身强,建禄分明理更长,官杀轻时宜顺运,官轻逆行亦荣昌."],
            "己未": ["己土未月欣逢杀,刃煞相伤更妙哉,运气中年多发达,不拘顺逆称心怀."],
            "己申": ["己土申月用伤官,若是身轻必不安,所喜须宜行逆运,怕逢寅卯杀相干."],
            "己酉": ["己土八月辛金旺,若是身轻命不牢,旺喜顺行衰喜逆,无财无杀不为高."],
            "己戌": ["己土如逢九月天,财官两旺福无边,运行顺逆俱平稳,发达之时在壮年."],
            "己亥": ["亥提己土用财官,身旺财官总是欢,若是身柔喜顺运,东方难决一平安."],

            "庚子": ["子月如逢庚日干,有财有杀始平安,西方不似东方运,午运如逢寿数完."],
            "庚丑": ["庚金丑月有财官,格局分明杂气看,木火柱无终不美,东南运气遇为欢."],
            "庚寅": ["庚金寅月日干微,土透天干命愈奇,逆运初年嫌子丑,顺行大运怕逢离."],
            "庚卯": ["庚金生值仲春时,官煞如逢命始奇,但嫌四柱元神弱,顺运三旬恐殒危."],
            "庚辰": ["庚金三月土重重,更有财官福禄丰,逆运固知强顺运,中逢子地有灾凶."],
            "庚巳": ["庚金四月杀星强,有制方知杀伏降,若是无根又无制,其人多有少年亡."],
            "庚午": ["五月庚金喜有根,有根有水贵堪言,逆行大运宜东地,子字相逢总不然."],
            "庚未": ["庚金未月土旺地,戊己土重命无过,若是土轻行逆运,康宁福寿沐恩波."],
            "庚申": ["七月庚金金大刚,坐支若是亦平常,财官两处宜行顺,财杀轻时逆运强."],
            "庚酉": ["八月庚金用两星,柱中有杀最相应,有财无煞纯金局,从革尤当显姓名."],
            "庚戌": ["庚金九月喜逢财,杀透天干亦妙哉,顺命初年兼子地,逆行离巽有凶灾."],
            "庚亥": ["庚金十月日干衰,有土相逢亦妙哉,顺运必然强逆运,中年唯恐有灾危."],

            "辛子": ["子月辛金喜丙丁,若然无火亦平平,运行木火多通达,财杀多时喜逆行."],
            "辛丑": ["辛金丑月宜丁火,戊己重重亦不妨,无火土多防夭寿,纵然不夭也平常."],
            "辛寅": ["辛金寅月财官旺,大运不须喜逆行,若是无财行顺运,中年唯恐丧残生."],
            "辛卯": ["卯月辛金如有杀,坐支有土更为奇,顺行逆转名多显,若到西方反不齐."],
            "辛辰": ["辛金生於辰月中,有财有杀更和同,顺行逆运多通达,富贵荣华福寿崇."],
            "辛巳": ["辛金巳月官星旺,伤食全无亦不过,逆运但防官字否,顺行一路总蹉跎."],
            "辛午": ["辛金午月杀当权,四柱根深逆顺坚,若是无根堪弃命,如行西运大无恙."],
            "辛未": ["未月辛金杀印全,印多尤似有亏偏,逆行水运多通达,顺运初年略不然."],
            "辛申": ["申月辛金金水清,伤官有杀最相应,坐支无酉方为妙,运入东南显姓名."],
            "辛酉": ["辛金酉月日干强,财杀相逢更异常,逆运到头多发达,顺行水地未为良."],
            "辛戌": ["戌月辛金煞印全,柱中有制福无边,逆行顺去俱无阻,巳地相逢总不然."],
            "辛亥": ["辛金亥月若无官,水冷应知金大寒,若有官星尤有杀,定应名姓到金銮."],

            "壬子": ["壬水生逢子月天,无财无杀未周全,终身困苦多流落,纵到财乡亦枉然."],
            "壬丑": ["壬水丑月喜逢财,财旺身强更妙哉,运气顺行经水火,堪为万事称君怀."],
            "壬寅": ["壬水如逢寅月生,食神相左亦相应,南方运气增财帛,有杀终当播姓名."],
            "壬卯": ["壬逢卯月伤官格,逆运无如顺运高,杀透更加身旺处,功名富贵寿称高."],
            "壬辰": ["壬水辰月杀星强,甲乙相逢杀伏降,更得财星并印绶,不拘顺逆亦相当."],
            "壬巳": ["壬水生逢夏月天,财星官杀旺堂前,无根只怕初年失,若到中年福愈坚."],
            "壬午": ["壬生午月财星旺,亥水相逢更异常,若是无根多弃命,平生白手置田庄."],
            "壬未": ["壬水生逢季夏时,分明杂气异为奇,顺行逆转多通达,卯地相逢总不宜."],
            "壬申": ["壬水生申为杀印,有财有用亦相当,运行南地强如壮,卯地相逢命不长."],
            "壬酉": ["壬水相逢八月天,分明印绶格当权,无官怕入财乡运,有杀须应福愈坚."],
            "壬戌": ["壬水生来值季秋,财多杀旺身忌柔,财居火地俱通达,并木之乡返不周."],
            "壬亥": ["壬水亥提为建禄,柱中有土运之东,南方运气俱为美,若是无财亦不通."],

            "癸子": ["癸水冬生值子提,财官重见最为奇,顺行喜到东南运,逆走南方亦不宜."],
            "癸丑": ["癸水丑提为杂气,无财无印不堪推,顺行木火俱为妙,逆运西南寿不齐."],
            "癸寅": ["癸水寅月木伤官,官杀重逢祸百端,北运不如南运好,若到申宫寿有干."],
            "癸卯": ["癸水生来卯月中,无官无杀喜和同,顺行南地多清贵,恐入西方寿早终."],
            "癸辰": ["癸水辰月喜逢财,杂气分明格美哉,若是无根身太弱,顺行南运必多灾."],
            "癸巳": ["癸水巳提财更旺,官多不与杀相同,有根逆运多财足,顺入西方早见凶."],
            "癸午": ["癸水生逢午月中,分明财杀格相同,无根运不行申地,弃水从财反有功."],
            "癸未": ["癸水未月杀星强,有刃无官禄位昌,运入东方经制伏,定看名姓列朝堂."],
            "癸申": ["癸水生来值孟秋,有财终不忌身柔,顺行北运尤为妙,若是无财反不周."],
            "癸酉": ["癸水酉月印生身,有杀方为格局真,逆运须知强顺运,功名富贵又超群."],
            "癸戌": ["戌月如逢癸日干,分明杂气用财官,运行木火多财禄,逆运初年寿有干."],
            "癸亥": ["癸日生来亥月中,伤官水木总相同,逆行最妙南方运,顺走须知忌卯凶."],
        };

        //天禄贵神
        var tianluguishen = {
            "甲": ["辛酉", "辛亥"],
            "己": ["辛丑", "辛未"],

            "乙": ["壬子", "壬申"],
            "庚": ["乙丑", "乙未", "己丑", "己未"],

            "丙": ["癸巳", "癸卯"],
            "辛": ["丁酉", "丁亥"],

            "丁": ["辛酉", "辛亥"],
            "壬": ["丙寅", "丙午"],

            "戊": ["癸酉", "癸亥"],
            "癸": ["乙丑", "乙未", "己丑", "己未"]
        };


        vm.jiaziinfo = "甲子";
        vm.getJiaziShuxing = function () {
            vm.resultJiazi = jiazishuxinglist[vm.jiaziinfo];
        };

        function getJiaZiIndex(jiazi) {
            for (var i = 0; i < 60; i++) {
                if (sixtyJiaZi[i] === jiazi) {
                    return i;
                }
            }
            return 0;
        }

        function xingnianPase(zhu) {
            vm.xingnianzhu = zhu;
            vm.xingniangan = zhu[0];
            vm.xingnianzhi = zhu[1];
            vm.xingniannayin = jiazinayin[zhu];

        }

        function dayunPase(zhu) {

            vm.dayunzhu = zhu;
            vm.dayungan = zhu[0];
            vm.dayunzhi = zhu[1];
            vm.dayunnayin = jiazinayin[zhu];

        }

        function liunianPase(zhu) {

            vm.liunianzhu = zhu;
            vm.liuniangan = zhu[0];
            vm.liunianzhi = zhu[1];
            vm.liuniannayin = jiazinayin[zhu];

        }


        //计算行年
        function calculateXingNian() {
            //传统算法 男-丙寅顺行 女-壬申逆行
            //丙寅索引 2 壬申索引 8
            var birthYear = parseInt(vm.birth.substr(0, 4));

            var begin = vm.countYear - birthYear;
            if (vm.genderSelected.title === "男") {


                xingnianPase(sixtyJiaZi[(begin + 2) % 60]);
            } else {
                var index = (8 - begin) % 60;
                if (index < 0) {
                    index = 60 + index;
                }

                xingnianPase(sixtyJiaZi[index]);

            }

        }

        function calculateXingNianShiZhu() {
            //获取时柱
            var startIndex = sixtyJiaZi.indexOf(vm.shizhu);
            var birthYear = parseInt(vm.birth.substr(0, 4));

            var begin = vm.countYear - birthYear;

            var gender = vm.genderSelected.title;
            //时柱 阳男阴女-顺行 阴男阳女-逆行

            if ((gender === "男" && isYangGan(vm.niangan)) || (gender === "女" && !isYangGan(vm.niangan))) {
                xingnianPase(sixtyJiaZi[(begin + startIndex + 1) % 60]);

            } else {
                var index = (startIndex - begin - 1) % 60;
                if (index < 0) {
                    index = 60 + index;
                }

                xingnianPase(sixtyJiaZi[index]);

            }


        }

        vm.setXingnian = function () {
            xingnianPase(vm.countYear);
        };




        vm.match = function () {

            var filter = {
                gender: vm.genderSelected.value,
                bazi: vm.strBaZi
            };
            Restangular.one("bazis", "analyze").get(filter).then(function (result) {
                vm.matchResult = result;

            }, function (error) {
                promptService.failure(setting.getDataError);

            });

        };

        vm.back = back;

        function back() {
            $state.go('customers.index');
        }

        vm.dayunSet = dayunSet;

        function dayunSet(item) {
            dayunPase(item.title);

        }
        vm.liunianSet = liunianSet;

        function liunianSet(item) {
            liunianPase(item.title);

        }

        function pasebazi(strBaZi) {
            var sizhu = [];
            for (var i = 0; i < strBaZi.length; i++) {
                var s = strBaZi[i];
                var b = false;
                if (tiangan.indexOf(s) >= 0) {
                    b = true;
                } else if (dizhi.indexOf(s) >= 0) {
                    b = true;
                }

                if (b) {
                    sizhu.push(s);
                }

            }
            if (sizhu.length > 7) {
                vm.niangan = sizhu[0];
                vm.nianzhi = sizhu[1];
                vm.nianzhu = vm.niangan + vm.nianzhi;
                vm.niannayin = jiazinayin[vm.nianzhu];

                vm.yuegan = sizhu[2];
                vm.yuezhi = sizhu[3];
                vm.yuezhu = vm.yuegan + vm.yuezhi;
                vm.yuenayin = jiazinayin[vm.yuezhu];

                vm.rigan = sizhu[4];
                vm.rizhi = sizhu[5];
                vm.rizhu = vm.rigan + vm.rizhi;
                vm.rinayin = jiazinayin[vm.rizhu];

                vm.shigan = sizhu[6];
                vm.shizhi = sizhu[7];
                vm.shizhu = vm.shigan + vm.shizhi;
                vm.shinayin = jiazinayin[vm.shizhu];
            }
        }
        vm.analyze = analyze;

        var jianfengsha = ["寅甲",
            "卯乙",
            "辰戊",
            "巳丙",
            "午丁",
            "未己",
            "申庚",
            "酉辛",
            "戌戊",
            "亥壬",
            "子癸",
            "丑己"
        ];

        var posha = ["卯午", "丑辰", "子酉", "未戌"];

        var tianxingsha = ["子乙", "丑乙", "寅庚", "卯辛", "辰辛", "巳壬", "午癸", "未癸", "申丙", "酉丁", "戌丁", "亥戊"];



        var leitingsha = {
            "寅": "子",
            "申": "子",
            "卯": "寅",
            "酉": "寅",

            "辰": "辰",
            "戌": "辰",

            "巳": "午",
            "亥": "子",

            "午": "申",
            "子": "申",
            "未": "戍",
            "丑": "戍"
        };


        var bingfu = {
            "子": "亥",
            "丑": "子",
            "寅": "丑",
            "卯": "寅",
            "辰": "卯",
            "巳": "辰",
            "午": "巳",
            "未": "午",
            "申": "未",
            "酉": "申",
            "戌": "酉",
            "亥": "戌"
        };

        var jialuxiang = {
            "甲": "卯、丑",
            "乙": "寅、辰",
            "丙": "辰、午",
            "丁": "巳、未",
            "戊": "辰、午",
            "己": "巳、未",
            "庚": "未、酉",
            "辛": "申、戌",
            "壬": "戌、子",
            "癸": "亥、丑",
        };

        var jialuchao = [
            "丁庚而得未",
            "己庚而得未",
            "丙乙而得辰",
            "戊乙而得辰",
            "辛壬而得戍",
            "癸甲而得丑",

        ];
        var qiandingshu_bak = {
            "甲甲": {
                "子":"天贵星 甲子 快风快雨 （解）命运亨通，并得贵人相助。","寅":"甲寅 天贵星 披风对月 （解）先逆后顺，老来渐入佳境。",
                "辰":"金鹤星 甲辰 丛林采新 （解）生长富贵之家，结果平平。","午":"金鹤星 甲午 牛眠荒芜 （解）才大力大，惜乎孤立无助。 ",
                "申":"金鸾星 甲申 石皂遇雨 （解）立志坚定，终久不致穷困。","戌":"金鸾星 甲戌 月出楼台 （解）清高自在，一生无忧无虑。 ",
                "断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",
            },
            "甲乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "甲丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "甲丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "甲戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "甲己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "甲庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "甲辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "甲壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "甲癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "乙甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "乙乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "乙丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "乙丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "乙戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "乙己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "乙庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "乙辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "乙壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "乙癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "丙甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "丁甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "戊甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "己甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "庚甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "辛甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "壬甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "癸甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":"","基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
        };

        var qiandingshu = {
            "甲甲": {
                "子":"天贵星 甲子 快风快雨 （解）命运亨通，并得贵人相助。","寅":"甲寅 天贵星 披风对月 （解）先逆后顺，老来渐入佳境。",
                "辰":"金鹤星 甲辰 丛林采新 （解）生长富贵之家，结果平平。","午":"金鹤星 甲午 牛眠荒芜 （解）才大力大，惜乎孤立无助。 ",
                "申":"金鸾星 甲申 石皂遇雨 （解）立志坚定，终久不致穷困。","戌":"金鸾星 甲戌 月出楼台 （解）清高自在，一生无忧无虑。 ",
                "断":"此命为人聪明，立志孤高，多学少成，博闻强记，中年自嫌孤独，四旬之后，却喜得遇\n" +
                "贵人有贵人酒食，无贵人财帛，大事化小，小事化无，作事疑虑，相识易疏，爱恬淡乐\n" +
                "清虚，只因立性不定，几番进退超趑，不骄不吝，不傲不谄，志气豪逸，心性难拘，儿\n" +
                "女不得力，尽是一埸空，吁嗟乎，半俗之命。",
                "格":{"远震雷霆格":"长空远响雷霆震，遍野风生凛烈威；云散鸳鸯芳草渡，风飘烟雨落花枝；\n" +
                    "　　 身行吴越南经北，家住潇湘东复西；借问百年收结果，一条节竹引孩儿。\n" +
                    "　　衣食重新换亲情，沙里金紫衣人助力有祸不相侵。",
                    "雷霆远震格":"长天忽震雷霆响，凛凛帷中独有威，惊散雁鸿飞塞远，狂风飘散落花枝。\n" +
                    "　　山南山北乡关阔，家住潇湘东复西，借问百年堪结子，一条球棒引孩儿。",},
                "基业":"性似电光明察快，声如雷响震瑶台，乡门休欢家南北，万里江山到几回。 ",
                "兄弟":"三雁分飞向吴越，楚天风月自凄凉，潇湘遥送孤鸿远，棠棣花开忆异乡。","行藏":"人持重箭弓方举，射鹿还归富贵家，终久满堂金玉盛，逢龙见虎好生涯。",
                "婚姻":"用意调琴与自饶，又添风景好萧条，多栽桃李蕃枝叶，丹桂堂前有异苗。","子息":"春花正发日迟迟，夜半风狂叶亦稀，幸有一枝红杏在，后园桃李并芳菲。",
                "收成":"若遇辛壬休举用，只宜安静听弹琴，洒边鸡唱方为梦，流水落花后有心。",
                "此星照命":"此星照命，风霜早历，奔驰度量，高胸次远。手段大，机谋深，心慕高人，见事敢做。\n" +
                "亲君子，远小人，退神重重，多奸疑，多思虑，不骄傲。恬淡只因立志不一，性乱难拘所作于人。\n" +
                "不足头女末男，便是这个五行所注。初年未称意，末限方成。述云：过水自有人相接，提我登云别有梯。",
            },
            "甲乙": {"丑":"紫气星 乙丑 杨花化萍（解）根基虽薄，幸有好人相逢。",
                "卯":"紫气星 己卯 病龙行雨（解）久处厄境，终有升腾之日。",
                "巳":"龙高星 乙巳 缘木求鱼（解）虽劳，一无所获。","未":"龙高星 乙未 披沙取金（解）一生辛苦，所得甚微。 ","酉":"天破星 乙酉 破扇摇秋，作事无恒动辄被人轻弃。",
                "亥":"天破星 乙亥 金畔堆石，屡仆屡兴到底不致破家。",
                "断":"性格恬淡胆气英豪，凡事不能深思远虑，几番进退有始无终，被人相讥改变重重，凶处不凶，美处不美，初年壮健精神焕发，中年无心心灰意懒，好事多磨，灭危淹滞，巧中成拙是处成非，纵使一天成家立业，不免离别妻子儿女，有贵人时有酒有缘，无贵人时财帛纷分，只认造化半空半谷。",
                "格":{"流水鸳鸯格":"一双鸿雁两西东，雨打鸳鸯各自飞；每怪洞深日出晚，应嫌海阔浪来迟；\n" +
                    "　　 才逢鬼宿双绳断，落到龙门一跳追；叶谢花残根木在，更深秋月始扬辉。\n" +
                    "　　 寿木松柏齐天龄，不待时鳌鱼游浅；水平步上云梯。",
                    "泊水鸳鸯格":"群群雁过远离塞，雨打鸳鸯各自飞，纵有海风吹不断，也须相守自相宜。\n" +
                    "　　满树花残留一叶，好逢前发马头时，若见子宫须发禄，牛首牵弓必射之，\n" +
                    "　　寿命齐松柏，天龄不待时，鳌鱼游水远，平步上云梯。 ",},
                "基业":"绿杨冉冉绕重城，飞絮飘摇逐燕轻，\n" +
                "　　 纵有狂风吹不散，营家虽破破还成。",
                "兄弟":" 风吹四雁高飞远，回首沙汀一只孤；\n" +
                "　　 来看江山千万里，归还依旧下平芜。",
                "行藏":"寅尾卯头君方发，牛羊运至问隹名，\n" +
                "　　 虽然涉危桑榆下，引领群仙入花城。",
                "婚姻":"经雨鸳鸯慵困倦，也应春意不栖和，\n" +
                "　　 莲池草绿容鸥鹭，惊起鸟飞白项多。",
                "子息":"天桃花发何时艳，马首方知两鬼成，\n" +
                "　　 凰阁龙楼知有份，腰金衣紫上官京。",
                "收成":"天龄永命齐松柏，四季苍苍风月闲，\n" +
                "　　人道鳌鱼今透海，南柯一梦再惊还。",
                "此星照命":"此命造化，性格恬淡，气宇风骚，胸襟磊落，言语刚强。放荡所为，不会深思远虑。从前吃误两三番，方才省觉：滋润处，不滋润；安闲处，不安闲。广孝不记，心力不足。初年件件爱好，中年事事懒惰，凡事要一番做两番。头子难招，妻宜两硬，交友水炭，多成多败。述云：一番风雨足，方始见生涯。",},
            "甲丙": {"子":"天滞星 丙子 鱼鳞出沼，抱有大志，惜乎不得其所。","寅":"天滞星 丙寅 蜂入花林，人极尖利，须防误入歧途。",
                "辰":"天恍星 丙辰 鸾凰栖梧，有高亲可配而不得其力。","午":"天恍星 丙午 石上金花，徒有虚名毫无实际。",
                "申":"天嚣星 丙申 浅水行船，作事辛苦难望速效。","戌":"天嚣星 丙戍 衣锦骑驴，得利还乡晚景逍遥。",
                "断":"艺业工巧学术精明，孤不为孤凶不为凶，成立之处福不成福，患难之处凶亦不凶， 高人钦敬，小人妒嫌，能立纪纲，会审法度，自在之处难寻自在，欢喜之处反成空愁， 兄有若无，亲戚无终，件件亲手，样样自造，皆是造化莫怨人神。",
                "格":{"马过山川格":"高风千里起风涛，一片天机胆气高，\n" +
                    "云汉雁鸿双翼徒，霜寒松柏一枝翘；\n" +
                    "营求多利多成败，培种春花转寂寥；\n" +
                    "借问前程荣达事，夕阳影里采仙桃。",
                    "马瘦长川格":"遥遥千里见波涛，独有心机志气高，故国岂无根叶在，争名图利自萧条。\n" +
                    "青山雁侣双双远，岁寒松柏枝枝青，君今莫问荣枯事，晚景终为富贵豪。\n" +
                    "生涯未遇平生志，总使身闲心未闲，酉进辰年龙在水，无忧人在水归山。",},
                "基业":"逍遥台上观明月，独步云间日上山，生来不遂平生志，终是心闲性不闲。",
                "兄弟":"棠棣花开风雨时，西墙翠竹自依依，雁行皆不东西去。一个孤鸿独自飞。",
                "行藏":"回首江山千万里，乡关万里路迢迢，休嗟荣辱平身事，晚景风流气象高。 ",
                "婚姻":"休提凤鸾新盛事，岂期风景好潇条，丹桂堂前长异苗，重栽桃李生松子。",
                "子息":"后院好花犹未实，槛前花蕊尚翩翩，逢羊遇虎多荣幸，日暮桑榆果子鲜。",
                "收成":"有意辰年龙在水，无心寅上好归山，清风明月伴幽独，猿鹤相依不等闲。",
                "此星照命":"此星照命，技艺工巧之星，学术多能之士。清闲秀丽，险处无虑，凶中反吉，临危有救。见善不欺，君子成持，小人欺罔。为人性快，使人欺，能有纲纪自在中。寻出不自在，要好处，乐得一场愁。雁行有侣有妻，妾各难老。凡事虑心，且宜戒酒。述云：孤中孤不尽，一世见凶危。",},
            "甲丁": {"丑":"天滞星 丁丑 浮萍雨露，得失无定好事不长。","卯":"天滞星 丁卯 残菊经霜，晚年多难幸而力尚能支。",
                "巳":"天蛊星 丁巳 金瓶牡丹，目前宝贝不足为凭。","未":"天蛊星 丁未 瓮里鸣蛙，志气虽大惜无发展之地。",
                "酉":"天恍星 丁酉 空岫寻云，毫无依傍劳而无功。","亥":"天恍星 丁亥 池沼 纳凉所谋，虽成到底难免失败。",
                "断":"此命眉清目秀，性格轩昂，随机知变，知高识低，分尊卑，别贵贱，只缘心高志大，因\n" +
                "此踪迹不宁，大宽小急，紧慢不匀，忘前失后，会施为，能妆饰，历风霜，却得凶中变\n" +
                "吉，目下恶星将出限，福临财至尽无疑。 ",
                "格":{"春暖莺啼格":"祖业成时大也下绿杨，影里子规啼山空水冷；\n" +
                    "猿声切林下风高雀倦，飞鸿雁云边断续鸳鸯；\n" +
                    "雨打两分离个中生意，红尘外争奈身涉是非；\n" +
                    "根基两现成，世事两相萦，无限风光好，梅花雪里春。",
                    "春暖鹃啼格":"祖计纷纷东又西，绿杨深处子规啼，山空雾润猿声切，涧远林深鸟倦飞。\n" +
                    "雁宿野花岩岁月，鸳鸯雨打不分离，终知意在逍遥外，争奈尘心染是非。\n" +
                    "积岁多迍蹇，如今渐渐通；年老春色好，花枝一丛丛。 ",},
                "基业":"祖业纷纷复东西，绿柳枝上子规啼，\n" +
                "今君若问荣枯事，只恐天年寿不长。",
                "兄弟":"孤鸿始夺芦花白，一雁孤飞远浦中，\n" +
                "回首暮运千万里，半江流水一帆风。",
                "行藏":"休嗟积岁为屯蹇，若遇空中渐避凶，意在逍遥尘世外，知龙奋发在岩中。",
                "婚姻":"鸳鸯惊散奔莲池，指笑杨花舞落时，虎穴龙泉自快发，不须鸡犬在蕃蓠。",
                "子息":"风吹一枝桃花发，高抗难留三果鲜，祥凤雏鸡依竹下，待成羽翼向天边。 ",
                "收成":"逢蛇休问瑶台路，遇虎提防见鼠鸡，高高人家欢喜笑，夜深月落子规啼。",
                "此星照命":"",},
            "甲戊": {
                "子":"天晦星　戊子  盘车折足，有才能但不能发展。","寅":"天晦星　戊寅  旱井逢霖，困屯已久终有人扶助。",
                "辰":"天淹星　戊辰  衣锦夜行，根基虽好不得其时。","午":"天淹星　戊午  石上栽松，作事无根不能持久。",
                "申":"天贵星　戊申  十月梅花，早年发达不喜迎合他人。","戌":"天贵星　戊戍  路入平坡，一生尽处顺境好命。",
                "断":"此命慵懒之宿，暗昧之星，作事重重退悔，行坐步步踌躇，不能俯仰人，不会妆饰事，\n" +
                "衣食自有只宜改变，守祖则六亲无分，静坐则四肢生病，只宜过房立赘，离祖立身，性\n" +
                "情紧慢不调，事业成败不一，从来险阻曾经过，幸得凶中有救神。",
                "格":{"渔父收论格":"渔父收论一棹轻，旌旗队仗出天城，将军塞外思朝国，游子心中过浪萍。 \n" +
                    "生计必从他处立，运谋应是少年营，天边孤雁高飞去，花落檐前月满庭。",
                    "渔父收纶格 ":"渔父归庄利禄名，旗横随后诏宣城，年来塞外思乡国，游水中心逐浪平。生计必从前定立，运时应待百年荣，天边孤雁高飞处，花落岩前月满庭。带禄牵牛归路时，马猴消息应天时，庭前早有文书至，何必自心尽皱眉。",},
                "基业":"人生居乐思为乐，岂为身高志欲低，若遇虎头人奋发，桑榆人遇虎生威。 ",
                "兄弟":"春风两雁离群队，春日莺调金缕衣，独上吴江风月冷，两重门户可相依。",
                "行藏":"过继传名禄位高，一生忠直任逍遥，边庭佐享将军福，若还守旧定萧条。 ",
                "婚姻":"求调琴瑟不须忧，才上兰舟风打头，若问凤凰鸳侣辈，晚来鸥鹭尽优游。",
                "子息":"多是萱堂阴陟佑，龙楼凤阁集其名，有分传名必有禄，若问优游享福亨。",
                "收成":"花正开时争艳冶，连霄风雨又离披，丁壬年上多惆怅，休与人间作梦时。",
                "此星照命":"此星照命，乃慵懒暗昧之宿。作事退晦，行坐踌躇，不会俯仰人，不会拘束人。衣禄自然丰厚，大利改更不静。在祖宅难为六亲、兄弟冰炭，只宜离祖过房、行赘远方。求财不利家，为人无私曲，情性宽紧不调，从来凶险多经历，只得凶中有救。述云：子午才来时应泰，龙蛇地上必深财。",},
            "甲己": {"丑":"天章星 己丑 霜月云飞，青云得路步步高升。","卯":"天章星 己卯 渴马饮泉，患难已过佳景即在眼下。",
                "巳":"天曜星 己巳 涉水求鱼，壬癸之年营谋有获。","未":"天曜星 己未 尘剑埋光，胆气顺豪惟恐怀才不遇。",
                "酉":"天徵星 己酉 披云寻月，宜出远门可遇知音之人。","亥":"天徵星 己亥 衰草逢春，晚景颇佳大可发展。",
                "断":"福度之宿瑞祥之星，安静不安尴尬，有救巧中成拙是处生非，亲戚陌路他处知音夫妇浑如瓜皮柳树，兄弟正似铜盆铁帚，难为儿女独力担当，到头得来良好结果。",
                "格":{"凤宿梧桐格":"凤凰城上钓神鳌，胆气曾经逐浪高，\n" +
                    "　　 雁过碧天离古寨，鸥游绿水长新毛。\n" +
                    "　　 天开雨打枝头损，果结风吹子不牢；\n" +
                    "　　 北畔是家南畔立，碧桃春暖遇顺豪。\n" +
                    "　　 遇犬功名立，逢牛志气高，限随斗马岁，身在碧云霄。",
                "凤宿春林格":"凤凰池上钓连鳌，风卷长沙逐浪涛，雁过碧天群失队，违亲背祖奋身高。\n" +
                "　　花开雨打枝头损，果结风吹实不牢，北畔是家南畔立，晚年须遇贵人豪。\n" +
                "　　遇犬边添翼，逢牛角畔刀，限随羊马发，身上碧云霄。 ",},
                "基业":" 生平怀志斗灵鳌，时值长江起怒涛，\n" +
                "　　 身在北家南面立，梅青松茂偃逢蒿。",
                "兄弟":"孤鸿飞下长江去，过向潇湘伴侣无，\n" +
                "　　 愁向棠棣花下饮，有时长欢向京都。",
                "行藏":" 平生立志施奇策，历遍江山万里程，\n" +
                "　　 金马玉堂人共语，龙楼凤格也知名。",
                "婚姻":"一雁飞来乔木下，松筠茂处鹤声清，\n" +
                "　　 梧桐枝上楼身稳，鸥鹭纷纷皆共盟。",
                "子息":"蝉噪柳枝斜日暮，云飞空白映霞红，\n" +
                "　　 一行鸥鹭草塘畔，红蓼白萍来好风。",
                "收成":"勒马回头春色景，天山三箭出凡尘，\n" +
                "　　 九嶷云霭惊残梦，相唤一声催去频。",
                "此星照命":"此星照命，吉利之星，祥瑞之宿，静办处反成啾唧，尴尬处却有救神。一生巧中成拙，是处成非。此命是非多惹，才得自然，朋辈如同亲眷，骨肉恰似路人。妻是瓜皮搭李树，李树搭皮儿。兄弟不和合，子息不能全，目下啾唧有贵人举目。述云：贵人来举目，何愁不称心。",},
            "甲庚": {"子":" 云甫星 庚子 云头望月，顺境将过逆境来临。",
                "寅":"云甫星 庚寅 雨里花开，好景不长过眼便空","辰":" 天嚣星 庚辰 积土成丘，可望小康不能大富。",
                "午":"天嚣星 庚午 葫芦溪水，气量狭小难成大事。","申":"天机星 庚申 雪天渔歌，处境清贫逍遥快乐。",
                "戌":"天机星 庚戍 径中走马，未脱险境作事小心。",
                "断":" 作事刚柔处心度量，劳心见早发福来迟，要通未通要迟未迟，立心不一有始无终， 外观不足六亲无分，子息宜迟不然便是，庶出偏生螟蛉作赘，事事踌躇百般思忖， 若谋经营有名无实也" +
                "难成功。",
                "格":{"花遇残春格":"女嫁男婚寡与鳏，心灰志巧性尤闲，\n" +
                    "　　 一行鸿雁云霄外，百岁功名醉梦间。\n" +
                    "　　 结子不如花开慢，偷香枉学蝶回还，\n" +
                    "　　 若逢千里知音客，千里开尊笑破颜。",
                    " 花 遇 残 愁 格":"女嫁男婚寡与鳏，心灵机巧性居闲，江边雁伴飞南北，百岁荣华醉梦间。\n" +
                    "　　远树落花存果少，可怜香径蝶蜂还，路遥千里知音绝，限遇猴狼必称颜。\n" +
                    "　　逆水行舟体不安，好于舟内把鱼竿，庚辛自应身危险，壬癸相逢始好看。",},
                "基业":"休论女嫁男婚事，长爱幽幽出南山，\n" +
                "　　 快乐百年天赋分，高名隐显在人间。",
                "兄弟":"独雁飞向长江去，遇却潇湘伴侣无，\n" +
                "　　 独坐棣棠花下酌，传杯劝饮倒冰壶。",
                "行藏":" 大号遇犬添新翼，鸡唱逢牛各带刀，\n" +
                "　　 得禄水边遭贵客，提携相挈向江皋。",
                "婚姻":" 孤孀鳏寡天然定，几许清名不等闲，\n" +
                "　　 犹有柳花扬舞絮，飞随猿鹤过重山。",
                "子息":" 雨骤花开两堤树，自然果蒂不为牢，\n" +
                "　　 若见牛羊人与合，螽斯衍庆节应高。",
                "收成":"庚辛自虑身危险，壬癸儿童更好看，\n" +
                "　　 人在秋闲明月下，一声渔笛伴幽闲。",
                "此星照命":"此星照命，作事刚柔，所为平品。凡事劳心未达，要高未高，要显未显，立志不一，外观有余。内看不足，弄巧成拙；近处无缘，远处钦慕；骨肉无分，子息见迟；螟蛉庶出，赘婿之类。眼前一件事，心下万般量，只是虚名薄利未到。风光寅申运气裹，好事立成。述云：目下心不足，后有贵人成。",},
            "甲辛": {"丑":" 金凤星 辛丑 鱼游春水，得意须防失意时。",
                "卯":"金凤星 辛卯 旱苗枯树，到处尽是逆境。","巳":"玉带星 辛巳 路傍秋，菊老境颇佳不必有人提携。",
                "未":"玉带星 辛未 炎天种粟，目前劳苦可望日后好收。","酉":"金厥星 辛酉 狐假虎威，得有依傍作事顺手。",
                "亥":"金厥星 辛亥 掘藏逢金，有偏财进门。",
                "断":"此命正如，雀巢生风，蚌腹剖珠，先难后易，只宜离祖，迁居可发，或是过房，赘婿妻家，不宜守祖，正如待兔，眷属生疏，为人之性，心直口快，于人不足，大宽小急， 只是心忙，初限偏枯，晚年发迹。",
                "格":{"月隐云霞格":"玉蟾明处浮云黑，风入长江浪未怠，\n" +
                    "　　 生涯准备成中年，会合提防双鲤只，\n" +
                    "　　 电光风烛灭还明，安得身时心未宁，\n" +
                    "　　 借问夕阳何景色，花黄三径晚清香，\n" +
                    "　　 费力巴时莫怨巴，得逢标处不须夸，\n" +
                    "　　 八九年间方起算，满庭春月照梨花。",
                    "月远云霄格":"金乌明处蟾蜍黑，高山险处不须行，雁过长江波浪急，平生活计破中成。\n" +
                    "　　好似电光风裹烛，花开花落不堪论，晚景到来须享福，百年喜气一身盈。\n" +
                    "　　思虑不曾闲，身闲心不闲，饶君多计较，虽有也忧煎。 ",},
                "基业":" 金钟出冶方成器，石上芝兰根脚异，\n" +
                "　　 凤阁龙楼去有因，前程自有人依庇。",
                "兄弟":"一个征鸿天外去，夜深独自宿芦花，\n" +
                "　　 优游四海成同志，晚景桑榆又起家。",
                "行藏":"人与鼠随牛背后，腾身直到凤凰池，\n" +
                "　　 总然不是王宁禄，也是刘郎得意时。",
                "婚姻":" 闺中宝瑟尘多积，再被南风也未清，\n" +
                "　　 鸥鹭满塘风雨恶，也疑惊散不同林。",
                "子息":"树头花谢飘零尽，落得枝头一果成，\n" +
                "　　 终久运逢羊犬吉，也凭阴骘保全成。",
                "收成":"逢羊得犬承天佑，再见壬丁便可行，\n" +
                "　　 万里江山收揽尽，一帆风送急归程。",
                "此星照命":"此星照命，如鹊巢生凤，似蚌长明珠。作事先难后易，只宜别祖离宗，过房异姓，入赘迁居。克陷六亲，兄弟不睦，机深志远，作事刚柔，口直心慈，不受触，不藏事，口伤人招人相怪。大宽小急，作事猖狂。妻命两敌免克，可保到头。述云：七九年来收算子，纵横好用自家风。",},
            "甲壬": {"子":"",
                "寅":"","辰":"",
                "午":"","申":"",
                "戌":"",
                "断":"",
                "格":{"":"","":"",},
                "基业":"",
                "兄弟":"",
                "行藏":"",
                "婚姻":"",
                "子息":"",
                "收成":"",
                "此星照命":"",},
            "甲癸": {"丑":"",
                "卯":"","巳":"",
                "未":"","酉":"",
                "亥":"",
                "断":"",
                "格":{"":"","":"",},
                "基业":"",
                "兄弟":"",
                "行藏":"",
                "婚姻":"",
                "子息":"",
                "收成":"",
                "此星照命":"",},

            "乙甲": {"子":"","寅":"",
                "辰":"","午":"",
                "申":"","戌":"",
                "断":"",
                "格":{"":"","":"",},
                "基业":"",
                "兄弟":"",
                "行藏":"",
                "婚姻":"",
                "子息":"",
                "收成":"",
                "此星照命":"",},
            "乙乙": {"丑":"","卯":"",
                "巳":"","未":"",
                "酉":"","亥":"",
                "断":"",
                "格":{"":"","":"",},
                "基业":"",
                "兄弟":"",
                "行藏":"",
                "婚姻":"",
                "子息":"",
                "收成":"",
                "此星照命":"",},
            "乙丙": {"子":"","寅":"",
                "辰":"","午":"",
                "申":"","戌":"",
                "断":"",
                "格":{"":"","":"",},
                "基业":"",
                "兄弟":"",
                "行藏":"",
                "婚姻":"",
                "子息":"",
                "收成":"",
                "此星照命":"",},
            "乙丁": {"丑":"","卯":"",
                "巳":"","未":"",
                "酉":"","亥":"",
                "断":"",
                "格":{"":"","":"",},
                "基业":"",
                "兄弟":"",
                "行藏":"",
                "婚姻":"",
                "子息":"",
                "收成":"",
                "此星照命":"",},
            "乙戊": {"子":"","寅":"",
                "辰":"","午":"",
                "申":"","戌":"",
                "断":"",
                "格":{"":"","":"",},
                "基业":"",
                "兄弟":"",
                "行藏":"",
                "婚姻":"",
                "子息":"",
                "收成":"",
                "此星照命":"",},
            "乙己": {"丑":"","卯":"",
                "巳":"","未":"",
                "酉":"","亥":"",
                "断":"",
                "格":{"":"","":"",},
                "基业":"",
                "兄弟":"",
                "行藏":"",
                "婚姻":"",
                "子息":"",
                "收成":"",
                "此星照命":"",},
            "乙庚": {"子":"","寅":"",
                "辰":"","午":"",
                "申":"","戌":"",
                "断":"",
                "格":{"":"","":"",},
                "基业":"",
                "兄弟":"",
                "行藏":"",
                "婚姻":"",
                "子息":"",
                "收成":"",
                "此星照命":"",},
            "乙辛": {"丑":"","卯":"",
                "巳":"","未":"",
                "酉":"","亥":"",
                "断":"",
                "格":{"":"","":"",},
                "基业":"",
                "兄弟":"",
                "行藏":"",
                "婚姻":"",
                "子息":"",
                "收成":"",
                "此星照命":"",},
            "乙壬": {"子":"","寅":"",
                "辰":"","午":"",
                "申":"","戌":"",
                "断":"",
                "格":{"":"","":"",},
                "基业":"",
                "兄弟":"",
                "行藏":"",
                "婚姻":"",
                "子息":"",
                "收成":"",
                "此星照命":"",},
            "乙癸": {"丑":"","卯":"",
                "巳":"","未":"",
                "酉":"","亥":"",
                "断":"",
                "格":{"":"","":"",},
                "基业":"",
                "兄弟":"",
                "行藏":"",
                "婚姻":"",
                "子息":"",
                "收成":"",
                "此星照命":"",},

            "丙甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丙癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "丁甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "丁癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "戊甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "戊癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "己甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "己癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "庚甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "庚癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "辛甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "辛癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "壬甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "壬癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},

            "癸甲": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸乙": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸丙": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸丁": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸戊": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸己": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸庚": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸辛": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸壬": {"子":"","寅":"","辰":"","午":"","申":"","戌":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
            "癸癸": {"丑":"","卯":"","巳":"","未":"","酉":"","亥":"","断":"","格":{"":"","":"",},"基业":"","兄弟":"","行藏":"","婚姻":"","子息":"","收成":"","此星照命":"",},
        };
        // 鬼谷子分定经
        function getLiangTouQian(nian,shigan,shizhi){

            var ret =  qiandingshu[nian+shigan];

            return {
                "星":ret[shizhi],
                "断":ret["断"],
                "格":ret["格"],
                "基业":ret["基业"],
                "兄弟":ret["兄弟"],
                "行藏":ret["行藏（仕途官运）"],
                "婚姻":ret["婚姻"],
                "子息":ret["子息"],
                "收成":ret["收成"],
                "此星照命":ret["此星照命"]
            }

        };

        vm.getLiuJiaKongWang=getLiuJiaKongWang;
        function getLiuJiaKongWang(jiazi) {
            vm.countLiuJiaKongWang = getXunKongWang(jiazi);
        }
        function analyze() {
            pasebazi(vm.strBaZi);

            dayunSet(vm.dayunSelect);
            liunianSet(vm.liunianSelect);
            vm.calculateXingNian();

            vm.match();

            var result = {};
            var suiyun = {};

            result["整体"] = {
                "【干支四字全】": ["四字全者，取十干十二支合而言之。凡年月日时并胎月五位中，若有甲有乙，其生月日时遇寅卯两位者是也。有丙有丁\n" +
                    "             遇巳午（戊己准此），有庚有辛遇申酉，有壬有癸遇亥子，土随水源行，戊己有亥有子，亦主富贵，更须要诸位上支干相\n" +
                    "             扶助也。（三命提要）"
                ],
                "": [""],
                "": [""],
                "": [""],
                "": [""],
                "": [""],
                "": [""],
            };

            result["年柱"] = {


                "四贵，四忌，四平": [
                    "凡看命，取【胎生旺库】为四贵，【死绝病败】为四忌，余为四平。",
                    "以【太岁干为主，配于五行】，取四贵、四平、四忌之位而分贵贱，遇贵多则贵，遇贱多则贱。",
                    "四贵主贵，亦有上下。生旺库为上，胎为次",
                    "四忌主贱，亦有轻重。死败绝为重，病为轻。",
                    "若胎月日时遇三贵上，皆有辅者（【禄有四辅】，正财正官正印合神辅也），三公之命也。",
                    "若三贵上带正天乙、本家禄（诗云：甲遇寅为常，寅遇甲为强，余仿此）、福会（甲生丙，丙生戊）或天乙贵神,合四三重者，亦三公之命也",
                    "三贵上,带上下合，或一官一印，即一正天乙或一位本家禄，三两位天乙贵人合者，宰辅之命也。",
                    "或日时上遇两贵，而带上件者，亦然",
                    "以上若一位上遇灾杀亡神劫杀地杀羊刃者，兼主兵权，枢府节钺之贵。",
                    "若胎月生月与日时上遇两贵或只时上遇胎库一贵，却带正天乙上下合，天乙贵神合，本家禄正官正印本禄余位，",
                ],
                "通会纳音取象":tonghuinayin[vm.nianzhu],
                "天乙贵人": {
                    "贵人": gettianyi(vm.niangan),
                    "夹贵印": jiaguiyin[vm.niangan],
                    "正天乙-要全": [getzhitianyi(vm.nianzhi), "若丑未人甲戊庚中，惟得两字。子申人得乙己全。酉亥人得丙丁全之类", "更与太岁干禄为正官正印者，其福加倍也。如 甲寅 见辛 ", "若在太岁本干四贵华盖之上，遇两天乙者，台辅之命也 如 甲寅 见辛亥 亥是甲长生", "若在四平之位，遇两天乙者，亦为侍从清华 之命。", "若在四忌上，遇两天乙者，常调之官也。"]

                        ,
                    "[天乙贵神相还格-交互见贵]": ["此格有三,干合为上，支合次之，无合者又次之。", "《寸珠尺璧》云：凡月日时互换见贵，太岁不带者不贵。", "《紫虚局》云：贵人交互人多贵，旺气相乘馆殿资。切莫五行伤着主，令人闲地冷清虚。", "若无死绝冲破空亡，更有福神佐之，当极一品之贵达，有死绝为鄙吝杀故也。如有死绝冲破空亡之类，只做正郎员郎，然多难无福耳。"

                    ],
                    "【干夹贵神格】": "如甲戊庚年生人，得丑日或未，时上却带甲戊庚中一字主显异。",
                    "[贵合] ": ["有贵合则官位穹崇，所作契合.有贵合则官多称意", "如甲戊庚贵在丑未，甲得己丑己未，戊得癸丑癸未，庚得乙丑乙未；", "乙己贵在申子，乙得庚子庚申，己得甲子甲申", "丙丁贵在亥酉，丙得辛酉辛亥，丁得壬寅壬辰"

                    ],
                    "[贵食] 食神坐自己的贵人": ["有贵食，则财禄丰足，所成遇望", "阴阳不匹配则选择贵人地支六合", "甲得丙寅 丙辰", "乙得丁酉 丁亥", "庚得壬申 壬戌", "辛得癸卯 癸巳"],
                    "象": [
                        "天乙贵人者，三命中最吉之神也，若人遇之，主荣名早达，官禄易近，若更三命皆乘旺气，终登将相公卿之位，大小运行年至此，亦主迁官进财，一切加临至此，皆为吉兆。（三命指掌）", "宜以纳音互换推寻，须比和则其贵为福，若丙寅火得酉，则火至此死，焉足为贵哉。（广录）。", "若与禄马同窠，不犯交退伏神,支干相合者，定须官高职清，若无德，更值空亡交退伏神，五行无气，至老不贵。紧要在月日时支干相合，则为吉，不然乃庸常流也。（同金书命诀）", "与【劫杀】倂，则貌厚有威，多谋足计，与【官符】倂则文翰飘逸，高谈雄辩，与建录倂则文翰纯实，济惠广施也。（烛神经）", {
                            "贵人福力厚薄": ["甲尤喜未，庚尤喜丑，各归其库也。", "戊子戊寅戊午喜丑，丑者火人胎养之乡；", "戊辰戊申戊戌喜未，未者木人入库，土人生旺之位也。", "然乙尤喜申者，木之绝乡也；己尤喜申，申者坤之正位也。", "丙丁属火，火墓在戌", "然乙尤喜申者，木之绝乡也；己尤喜申，申者坤之正位也。"

                            ]
                        }, "李虚中云：本家贵人全者，如甲人有戊、有庚、有丑、有未是也，大贵。", "紫虚格有贵人入庙格歌云：甲戊须寻癸未时，戊庚乙丑细穷推，丙丁丁酉乙亥是，壬癸乙卯癸巳奇，乙得戊申并庚子，己居丙子甲申时，辛遇丙寅兼戊午，遇者重金挂紫绯。 ", "有贵人入庙格，取五虎元遁之贵人本位上，见所遁之干者是也"

                    ],
                    "[天乙扶身格］": ["假令壬寅人得甲寅日时，壬贵在卯，甲贵在丑是也.丙申人得戊申，准此"]
                },
                "禄": {
                    "干禄": getlu(vm.niangan),
                    "本家禄": getzhilu(vm.nianzhi),
                    "【天禄贵神】": [
                        tianluguishen[vm.niangan], "太岁本干不见禄，取五虎元遁，至禄上看得何干，真干见天乙贵神，而贵人所坐之干，复得贵于禄上者是也。", "假令六【丁】人禄在午，至午上得丙字，丙贵在酉亥，而得【辛酉】或【辛亥】，则辛贵复见于午也，此为入格。", "又如六【壬】人至禄上得辛，而见【丙寅】者是也", "如更入格，贵极一品，常格得之，不下三品。（玉霄宝鉴）"
                    ],
                    "禄气专位": ["甲寅、乙卯、丙辰、丁巳、丙午、己未、庚申、辛酉、戊戌、癸亥、壬子癸丑，十干在十二辰上，如五位中得之多或得之全"],
                    "【禄气相亲】": ["本是甲寅，得乙卯为帝坐；本是庚申，得辛酉为帝坐，谓之顺禄入凤池。", "本是辛酉，得庚申为帝坐；本是乙卯，得甲寅为帝坐，谓之逆禄入凤池。", "甲寅、乙卯、庚申、辛酉之命，与日上或时上干支同者，谓之本禄入凤池，更遇天乙、天官、食神、驿马居其上，有气而不犯空亡者，文贵命也。", "丙寅得辛巳，戊寅得癸巳，丁人得壬午，己人得甲午，壬人得丁亥，癸人得戊子，在于帝坐，谓之合禄入凤池。"


                    ],
                    "夹禄乡-次之": [jialuxiang[vm.niangan]],
                    "夹禄窠-为上": jialuchao,
                    "": ""
                },
                "马": getma(vm.nianzhi),
                "官神": {
                    "[真官]": ["己丑得甲寅，辛丑得丙寅，如此之类，谓之真官，不贵即富。命前一辰是也"],
                    "【暗官】": ["谓如庚辛用丙丁为官，不见丙丁而见寅午戌，则为暗官，得火局也。（广录）"],
                    "【生成官】": [
                        "水土同宫",
                        "甲乙人得辛巳庚申辛酉",
                        "丙丁人得壬申癸亥壬子",
                        "戊己人得乙亥甲寅乙卯",
                        "庚辛人得丙寅丁巳丙午",
                        "壬癸人得戊申己亥戊子",
                        "若资驿马学堂贵人助之，无不发越。（李虚中书）"
                    ],
                    "【正官禄】五虎遁官禄位": [
                        zhengguanlu[vm.niangan],
                        "犯者胜带正官，正禄见带前后神亦佳。（太一经）"
                    ],
                    "【交互官格】大贵": ["甲申见乙酉  丙午见壬子  乙卯见戊申 庚午见壬午  丁巳见辛亥   癸亥见丁巳"],
                    "【六合官星格】": ["阴干合官，两柱在一旬", "官是六合少人知，贵在旬中始是奇，生日生时如直入，太师太傅佩旌旗。"],
                    "【上下官印】": ["正财生官", "甲己辛、乙戊庚、丙辛癸、丁庚壬、戊癸乙 己壬甲  庚乙丁  辛甲丙  壬丁己  癸丙戊",
                        "以上又名十样锦，主甲科官近禁地，常人亦不至艰辛。"
                    ],
                    "[官下有印］": ["如甲人见辛月，丙日时之类是也。主官职崇高，名位清峻。"],
                    "[官下有食有合]": ["月干是官", "如甲人见辛为官，辛食癸，丙与辛合，在月日时上是也。主为官有贴职，常人有兼艺。"],
                    "[官会杀］": ["甲乙人见辛丑  丙丁人见壬辰  戊己人见乙未 庚辛人见丙戌  壬癸人见戊辰",
                        "如辛金克甲乙木，金墓在丑。余仿此。君子主甲科，武人战功，常人艺业出俗。"
                    ]

                },
                "财": {
                    "偏财": piancai[vm.niangan],
                    "正财": zhengcai[vm.niangan]
                },
                "食神": shishen[vm.niangan],

                "五行正印": getwuxingzhengyin(getnayinwuxing(vm.nianzhu)),
                "空亡": {"常规":getXunKongWang(vm.nianzhu),
                    "精纪":["每旬管两空亡，分前后五辰，各有所属。假令甲子旬中无戌亥，自甲子至戊辰，以戌为空亡；自己巳至癸酉，以亥为空",
                        liujiaxunkongwang[vm.nianzhu]]
                },
                "劫杀": jiesha[vm.nianzhi],
                "亡神": wangshen[vm.nianzhi],
                "元辰": [
                    "元辰大耗者，阳男阴女，在冲前一位支辰，阴男阳女，在冲后一辰",
                    "主人形狈古朴，声音沉浊，生旺落魄，大度不别是非。死绝则寒薄狈猥，不识羞辱，一生无成，贪饮好情",

                ],
                "三刑": [
                    "",


                ],
                "六害": [
                    liuhai[vm.nianzhi],
                    "【年支为起例】",
                    "因昼夜阴阳之气感而六合。因六合而生六害，因六害而忌昼夜阴阳之气。六害者，十二支凌战之辰也。",
                    "凡六害入命，大率主妨害孤独，骨肉参商，财帛淡泊，女命尤忌",
                    "注意【六甲移位】，时为原点，甲子时，阳男阴女用克入（乙未），阴男阳女用克出",
                    "子未相害者，谓未以旺土害子旺水，此势【家】相害也。故子人见未则为害，未人见子不为害也。",
                    "神白经云：若干神有鬼，其害甚重。",
                    "李虚中云：寅害巳，阳男阴女尤忌。",


                ],
                "论华盖": [
                    "寅午戌人在戌。巳酉丑人在丑。申子辰人在辰。亥卯未人在未",
                    "李虚中云：寅害巳，阳男阴女尤忌。",
                    "",

                ],
                "金杀": [
                    "金神大杀者，至凶之神，与人为灾，而不为福。又主丧服哭泣之事。",
                    "古人云：寅、申、巳、亥，鸡头粉粹，四支生人，金神在酉。",
                    "子、午、卯、酉，蛇头开口。四支生人，金神在巳。",
                    "辰、戍、丑、未，牛头大忌。四支生人，金神在丑。",
                    "丑人金杀在本命，若生月生日时又在丑上，带鬼尅身，则有不测之祸。",
                    "以巳酉丑金之位，故金神居于上，所值金神，下更带金火，则为灾，又大而迟。（三命提要）",
                    "一杀而有三名，一曰吟呻杀，二曰破碎杀，三曰白衣杀。",
                    "在巳曰吟呻，巳中临官之火，火者，金之官也。金气临尅，主官府杖楚、刑狱呻吟之灾。故曰吟呻。",
                    "在酉曰破碎，酉者金旺之地，杀物当时，又有辛金相助，万物当之，无不破碎，主支离破碎，流血之灾。故曰破碎。",
                    "在丑曰白衣，乃金库墓也，居四季而临鬼门，主妨害，丧服，哭泣之事。故曰白衣。",
                    "其神常主横事。与官符併，则横来官灾；与劫杀併，则横来死丧；与白虎羊刄併，则流血伤残，与贵人建禄併，则稍慢，五行旺相不须用也。",
                    "金杀者伤害之辰，男子犯之，多有刑伤，兵刃之灾。妇人有产厄，行年至此亦然。",
                    "子午卯酉人见巳金生处，主大风瘫缓之疾，",
                    "寅申巳亥人见酉金旺处，主水痼毒药之病",
                    "辰戌丑未人见丑金墓处，主克妻害子，恶死之忧。",
                    "若带三刑德贵，主有高官握兵权。（金书命诀）",

                ],

                "纳音长生诀": getnayinchangshengjue(getnayinwuxing(vm.nianzhu)),
                "天干五行长生诀": getwuxingchangshengje(getganwuxing(vm.niangan)),
                "五虎遁": wuhudun[vm.niangan],

                "【贫贱所成】": {
                    "刑聚败极": ["【死处遇克，绝处遇刑】", "甲申得丁巳、己卯、己巳之类。"],
                    "四柱不收": ["甲子得丙寅、丁巳、辛亥、壬申之类"],
                    "五行未备": [""],
                    "数无取用": [""],
                    "一方前后": ["如木命人得巳丑之类。"],
                    "柱多隔角": ["如辛丑得辛卯，甲子得甲戊"],
                    "真者失时": [""],
                    "假音殃克": "五行克纳音，本轻却多逢克制。",
                    "主本倒乱": "火年水日，更先逢生旺，继逢死绝。",
                    "父子乖违": "日克年，时克年。",
                    "黎庶之命": " 忽若干支错乱，阴阳偏枯，八字无格以扶持，九命有刑而驳杂，忽作间巷之辈，忽为市井之徒。岂独不利不名，又且多穷多窘。",

                },

                "凶杀": {
                    "[诸杀伤]": [
                        "五鬼怕夜生，空亡怕六害，三刑怕金，自刑怕火，羊刃怕金。咸池怕水，劫杀怕金，华盖怕金木，返吟怕鬼。（《三命纂局》",
                        "褚刑殺，須看納音與當生年,相尅者為災重，見生者輕，刑殺受旺氣者，為災重，刑殺返遭刑尅衝害破者輕，刑殺上帶祿馬貴人者，必主有大權勢也。（李中虛書）",
                        "", "", "", "", "",
                    ],
                    "戟锋煞-月支取": [jianfengsha[vm.yuezhi], "命主后天意外伤害而伤残，大运流年忌讳【忌干】旺支。刑合之期"],
                    "天刑煞-年支时干组合": [tianxingsha[vm.yuezhi], "体弱多病，一生多有疾病。常与医生交往，医药费比较高，但也年年过"],
                    "截路空亡": [jielukongwang[vm.niangan],
                        "甲己申酉以为仇，乙庚午未不须游，丙辛辰巳门外立，丁壬寅卯一场空，戊癸子丑高堂坐，时值空亡不可求。",
                        "若月值，初限不安，日值，中限不泰，时值，末限不快，若受胎月、日值者，一生不快。",
                        "八字金书云：凡值此一重不妨，二三重主早亡，不然主遭刑，如甲己生人，申酉日时，定不好，纵干纳吉，只作寻常命，运到此亦凶。",
                    ],
                    "【沐浴杀】": ["沐浴名休败，卖田还宿债，业尽损妻儿，作事何【曾】快，如金人逢午是，余傚此。",
                        "酒色，不然耽赌博。寸珠尺璧云：凡男女命，忌沐浴，主淫乱。",
                        "壶中子云：沐浴临年，伯夷有首阳之饿。注云：见生值沐浴曰祼刑，行年值沐浴曰穷杀，故曰伯夷有首阳之饿。",
                    ],
                    "【阴阳杀】": ["女命得戊午，男命得丙子，是也。",
                        "若日上逢之，男娶美丽妇人，女适端正之夫。男得丙子平生多得美妇人也。女得戊午，平生多逢美男也。",
                        "大忌元辰、咸池同宫，不以男女皆淫荡。",
                        "如男得戊午多妇人相爱，女得丙子，多男子挑诱。更看有无贵贱格局，消息用之。（并烛神经）",
                    ],
                    "【死气杀】": ["取命前四辰，如子人在辰是也，主夭折或刑狱之厄。（三命指掌）"],
                    "【官符杀】": ["取太岁前五辰是【对冲后一辰】，日时遇之平生多官灾，更并羊刃乃徒行之命。从太岁数起，至第五辰是。古诗云：五官六死十二病，三丧十一客来临。"],
                    "【病符杀】": ["取太岁后一辰是，犯者多疾病，行年遇之亦然。（宰公要诀）"],
                    "【死符杀】": ["取病符对冲是，月日时犯之，无贵神救，凶恶短折。"],
                    "【血光杀】": ["子日戌时丑日卯时辰日午时未日酉时以上是隔角杀，君子主痈疽致命，庶人血光致死，日时上主妻子损克，胎年克父母。（并广信集）"],
                    "【又血光杀】": ["子人戌，戌人子，丑人卯，卯人丑，辰人午，午人辰，巳人未，未人巳，申人戌，戌人申，酉人亥，亥人酉，日时犯者平生多血灾。"],
                    "丧门": [sangmen[vm.nianzhi], "命前两位为丧门"],
                    "吊客": [diaoke[vm.nianzhi], "命后两位为吊客"],
                    "勾绞": [
                        gou[vm.nianzhi],
                        jiao[vm.nianzhi],
                        "阳命人前三辰为勾，后三辰为绞，阴命人前三辰为绞，后三辰为勾",
                        "假令甲子阳命人二月为绞，八月为勾，乙丑阴命人三月为勾，九月为绞，余准此。",
                        "凡人遇之，身若克杀，多掌刑法之任。或为将帅，专行诛戮。杀若克身，主非命而终。",
                        "玉门关集云：勾绞主非命）小人逢之，皆为飞横灾祸。行年至此，亦主口舌刑狱之事。（三命钤）",
                        "勾绞二杀至凶之神，二杀与人为灾，而不为福，值勾绞两位全者，灾重，一位者灾轻。",
                        "又云：以上杀有鬼则灾重，无鬼则灾轻。（三命提要）",

                        "若带三刑德贵，主有高官握兵权。（金书命诀）",

                    ],

                    "雷霆煞-月支对时支": [
                        leitingsha[vm.yuezhi],
                        "忽然遇难,祸起萧墙。如游泳淹死，登山失足坠山，驾驶昏睡出车祸。",
                    ],

                    "孤辰": "",
                    "寡宿": "",

                },

                "鬼论": {
                    "绝中遇鬼多贫贱": ["如木命见壬申，如生年纳音值绝，更逢纳音鬼多，主贫贱。",
                        "或多吉杀扶持，先须贫，后方富也。",
                        "有人是戊午年，壬戌月，癸亥日，戊寅时，其人先贫，盖壬戌癸亥乃是绝中逢鬼。后戊寅土与癸亥、君臣庆会，土能制水，寅午戌三合为炎上局，故主后大富也。（沈芝《源髓》）",
                    ],
                    "窠中鬼者": "如丙子见庚子、丁丑见辛丑之类是也",
                    "隔壁鬼者": "如庚子见癸丑之类是也",
                    "墓中鬼者": "如水人见丙辰，土人见戊辰之类是也",
                    "空亡鬼者": "如甲戌见甲申乙酉之类是也",
                    "真鬼刑疾": [
                        "年干真五行被日时两干六合真五行克",
                        "玉霄寶鑑云：假令甲己人不見丁壬全，而見壬寅或丁亥、丁卯、丁未者，亦是真鬼，若於福繁之地及貴人祿馬上見者，謂之變鬼為官，反為福，主凶中有吉。 ",
                        "大抵凶杀所居,干神不宜带真鬼。虽见真官，尚变为鬼，况见真鬼？则为灾祸明矣。（《玉霄宝鉴》）",
                        "又若己酉己卯人見丁壬，壬子壬午人見乙庚，雖納音見真五行克為官，奈本干同受克，故不作真官，而作真鬼斷之，大小運太歲逢之，災尤重。",
                        "神白经云：未为旺土来害子水，故子人见未，更有真鬼，其害尤重。",
                        "神白经云：申亥均为六害，更纳音相克尤甚。",


                    ],

                },
                "同类破": "如己未见甲辰、甲辰见己丑、己丑见甲戌、甲戌见己未。凡在四冲之地，纳音同类，逐两位逆数之，寅申巳亥、子午卯酉亦以此取，主平生不足，多不成器道。《经》云：“井栏互破，无药可医，遇空亡庶几，岁运亦忌之。",


            };
            result["日月"] = {
                "调侯用神": tiaohou[vm.rigan + vm.yuezhi],
                "拦江网": lanjiangwang[vm.rigan + vm.yuezhi],
                "定格局诀": dinggeju[vm.rigan + vm.yuezhi],
                "子平真诠": zipingzhenquan[dingge[vm.rigan + vm.yuezhi]],
                "管见子平": guanjianziping[dingge[vm.rigan + vm.yuezhi]],
            };


            result["日柱"] = {
                "御定子平": {"日干":yudingzipingrigan[vm.rigan],"日柱":yudingzipingrizhu[vm.rizhu]},
                "管见子平日干": guanjianzipingrigan[vm.rigan],
                "十干喜忌总纲": shiganxijizonggang[vm.rigan],
                "十干体相": shigantixiang[vm.rigan],
                "滴天髓十干":ditiansuirigan[vm.rigan],
            };

            if (vm.genderSelected.title==="女") {
                result["女命"] = {
                    "十干诗诀流口":nvmingshiganjue[vm.rigan],

                    "五行缺一":[
                        "四柱无夫，不偏房定为续室。女命缺官杀，并不是指没有异性对象，只是说没有白头偕老的理想婚姻",
                        "女命缺食伤，恒常是生育不利。",
                        "女命缺财，则视为无意之中，带来灾祸给丈夫或者男友，因为财绝不能生官杀。",
                        "五行缺财，即使入财运，也是虚名虚利，这句话是说给中产听的。高命是看调侯的。至于贫贱、普通人而言，五行缺财不是大祸。",
                        "",
                        "",
                        "",
                        "",
                    ],
                    "徐伟刚": {
                        "最忌的就是命中[伤官过旺]则克夫":[
                            "最轻者婚迟",
                            "次轻者与老男人结婚",
                            "稍重者，夫不肖或无能或离异",
                            "最重者（中年）夫病或早死",
                            "伤官克损正官、正官受伤，夫主必多灾多难；",
                        ],
                        "倒食过旺则克子":[
                            "最轻者不想要孩子",
                            "稍轻者子迟得",
                            "次轻者子劣不好养育",
                            "稍重者孩子多灾多难",
                            "最重者（老来）损成家立业之子",
                            "偏印克损食神，食神受伤，子必难产难养多病多灾：",
                        ],
                        "杂论":[
                            "正财偏财以其能生养官星使官星兴旺发达，故为女命 旺夫 之物；柱中最喜相见，",
                            "阳刃比劫以其能劫财争官夺我夫星(情敌)，夫星用情不专有外遇之象，是以柱中亦忌相会。 且阳刃凶暴易生不测，不惟性刚且多产厄更为忌讳。",
                            "大忌柱中官杀混杂合多有情犯桃花，必主外遇或婚变。",
                            "大忌女命日干是阳干还特别有力旺相，这种女命都不是省油的灯，自我意识个性极强，身主极旺的女命，都是不安份的主,不成格者或八字中凶神恶煞太多，都是破家害夫折腾完家业的“主”。",
                            "不成格者或八字中凶神恶煞太多，都是破家害夫折",
                            "",
                            "",
                            "",
                        ]

                    },
                    "广录":[

                         "女命在月柱绝对不要通根成格，比如甲寅，月上是壬子 癸亥 如果是甲乙木日主婚姻非常明显。如果问离婚是否还有老公，看时上是否有官",


                        {
                            "用正印而逢枭，兰堦夜冷":["壬子月 甲日 癸亥月 乙日 丁巳 丙午 月等 一辈子没有 男人了，"],
                            "用枭神而遇印，玉树春荣":["月偏印，时正印则好，以上 正印格带偏印不吉，偏印带正印，有男人.壬子 乙日 癸亥月 甲日 丁巳 丙午 月等"],
                            "金清水冷，日锁鸾台":[
                                "冷漠 冷冰冰 冰山美人。好命也就是有钱。日锁鸾台-在嫁不出去"
                                ,"（一定是庚日主。庚申 子月 辰年-》金冷水寒 大格局一定要丙丁    庚子  申月  辰年  -》金白水清，可以成大格局。"
                                ,"大格局一定要丙丁"
                                ,"好命也就是有钱。日锁鸾台-在嫁不出去"
                            ],
                            "土燥火炎，夜寒衾帐":"火土局，无论男女，一般无用，火烧土变成灰",
                            "【重官重印，绿鬓孤眠】":[
                                "正官坐正官，没有婚姻，夫坐夫重叠，嫁给你还想原来的男友"
                                ,"正官坐七杀，前面的没搞明白后面又来了"
                                ,"正印座正印，太清高，有洁癖"
                                ,"正印坐偏印，言清行浊"
                                ,"绿鬓孤眠-》年纪轻轻,就没老公了.一再强调，不能在月柱通根成格"
                            ],
                            "三刑带鬼，始终克子伤夫":"（ 巳 庚寅 甲申日，45年。 如果巳在时上。一辈子。同理，男命正财坐三刑，老婆也有几个。劝客户 老公没什么的，自己多存一些钱）",
                            "姊妹刚强，乃作填房之妇":["比肩劫财根重者，恐怕当小三","刚强：根旺，不要坐禄，只要通根就很厉害了。",
                                "比肩，劫财在天干，性情不定，不大会理财。",
                                "填房：老婆死了，又重新娶。",
                                "比肩 劫财 根旺 ，现代就是小三 情人。老公有外遇。比肩在天干，不大会理财。男命客气。败财有理由的。如做生意赔本。女命败财，花钱很厉害。男人有多少钱够你花？有钱的都是有家室的人啊。",
                                "比劫 任性 刚强，如果有钱人则乖，男人没钱则性格显示刚强。人生格言：宁在宝马车上哭，给钱就可以。郭美美）",],
                            "三合带三刑，伤夫败业":"（申年 巳 寅  亥。外行解释，31岁后就解除。正确是把老公钱败光，如打麻将。败夫一般不离婚）",
                        },
                        "日月双合 婚姻没有。只要日主带入双合，没有婚姻，不是没有 男人，而是二婚之命。如果月日地支，大运流年逢合 凶。",
                        "【一财得所，红颜失配】（专位临官 丙 申月，自己30有一定的钱，有能力。容易看不上老公。官杀混杂是道德问题，夫星坐绝，老公不能养你。）",
                        "【干头戊己土重重,心内玲陇无发越,脾气倔强心玲珑】",
                        "夫临墓绝，老困娇娘(命很硬。你的命是娘娘命，男人配不上你。在多了解一些。墓一定是阴干\n" +
                        "丙 巳午月 夫临绝，30岁左右，明显的，墓不能见人，辰月。几乎占三分之一)",
                        "【年上伤官，主带疾生产】",
                        "","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",
                    ],
                    "五行精纪":
                        {
                            "婚姻":[
                                "【凡女命以克我者为夫，如纳音金命火为夫】",
                                "凡女命生年生日同一位者，主克夫。嫁同音同年者庶几（年日伏吟）在实践预测中，这一点很灵验。如果一个女人的八字年与日同，夫妻又不同年，日支再逢冲战，甚至会夫死再嫁。至于二次婚姻，几乎可以铁口直断。",
                                "凡女命是子午卯酉日生，合嫁子午卯酉命夫，四孟四季者亦同，若嫁日干合或支神三合六合者【与夫的年柱匹配】，俱不偕老。",
                                "四柱无克我者，名曰【局中无夫】，更日落空亡，带旺气刑杀者，克夫、下贱之甚也。\n" +
                                "寸珠尺璧云：纳音金命火为夫，重重临寡又临孤，戌亥二宫夫葬绝，徒然出嫁是场虚。",
                                "凡女命不可带六甲,日犯者名曰带甲夫，月与时俱带者亦然，主克夫守寡，如甲午生妇人，十有九克夫，【甲午日可知也，谓之金神带甲，此例尤紧。】" ,
                                "凡女命，日不宜带旺气，带者名曰承旺，夫若不下贱，则多主克夫。见丙子【水旺】、庚子【土旺】、戊午、癸酉【金旺】、辛卯日是也。戊午多贵，癸酉、辛卯\n" +
                                " 次之，丙子、庚子下贱也。又云：戊午、癸酉、辛卯，大美小疵。" +
                                "又云：凡女命大忌禄衰身旺，日为身，凡女命大忌日在冠带、临官、帝旺，主淫恶或屡嫁夫，若男命生日上见之，主妻美丽不廉。\n",
                                " 凡女命生日在官鬼死墓绝上，主克夫，若官鬼落空亡，或日落空亡，又生日无气者，主无夫，纵有如无也。\n" +
                                "             古诗云：五行夫位落空亡，更值身低岂有郎，不是风尘须婢妾，纵有卑夫身亦娼。",
                                "",
                                "",
                                "",
                            ],
                            "子女":[
                                " 凡女命大宜纳音上生下，主人有殊福，不宜下克上，主欺诈僭越。若年之纳音克时之纳音，不宜子。又云：若年克战刑破生时纳音，少子多女。",
                                "",
                                "",
                                "",
                                "",
                                "",
                            ],
                        },

                };

                if(guluansha[vm.rizhu]){
                    result["女命"]["孤鸾煞"] = [
                        guluansha[vm.rizhu],
                        "孤鸾煞主克夫，主再嫁，主守寡，若不离婚，夫必先亡。官星受伤，或日支逢冲，丈夫则会早死。"
                    ]

                }
            }

            result ["梁湘润"]={
                "子平教材讲义，第二级次":[
                    "实务提要",
                    "生、旺、库、罗网，合会期",
                    "三合，三会，【格】与【局】重点",
                    "拱夹，应验特质",
                    "三见，二见、混杂",
                    "刑冲合会【运】之桥梁",
                    "五行缺一【调候、日主、六亲】喜忌",
                    "大运，顺逆喜忌",
                    "神煞",
                ],
                "四角方阵":{
                    "六甲移位":[
                        "原理：天干连珠，地支六害。阳男阴女顺行",
                        "大运起例，查看流年，此年凶，阻滞一年",
                        "时柱起例，查看大运，流年。",
                        "",
                        "",
                        "",
                        "",
                        "",
                        "",
                    ],
                },


            };

            /**
             *论寿夭

             凡天干生旺不损克者，寿。天干不败死有救助者，尤寿。天干败死相贼者，夭。天干生旺中有破克者，尤夭。（广录）


             凡寿以生月定之，生月居支干纳音旺处，及五音相生不逆，及日、时，并胎，并皆得数，不相刑克，上寿也。（玉门关集）

             【天寿朝元格】
             纳音居死绝之地，而有真五行与纳音比合，居于生旺之位者，是也。假令乙酉人，其纳音水，自败，若得辛亥、丙申，
             则丙辛真水，复生于申，此类享眉寿也。如乙亥人，得癸亥、戊寅之类亦是。（玉霄宝鉴）

             【建命须知寿命长】
             建命者，如子人见子，丑人见丑之类，如遇滋助，无刑克，多长寿。（沈芝源髓）

             凡命中带长生多者，定有寿，须本家纳音旺者，谓之长生见克制，则夭矣。（李虚中书）

             凡禄马贵人，往来在生旺之地，无死绝之气者，虽早发亦早死，然须在乘旺之地者，方为福，余且徒然，若时得力，则
             晚发，而寿长。

             要知天算得遐长，五行生旺最高强，旺鬼克身为短命，禄财无气亦为殃。（理愚歌）


             * [2018-08-16 add by longzhiyou]
             */

            result["论寿夭"]={
                "五行精纪":{
                    "年柱纳音生旺死绝":["常以月管一岁至三十岁，日管三十一岁至四十五岁，时管四十五岁至百岁-三限.或生旺，或死绝，逐限详之。",
                        "夫人寿夭修短之数，大抵生旺为寿长，死绝则为夭折",
                        "凡命皆要逢生旺，则为有寿，如日月上逢生旺，时上虽有死气，不妨。盖气之生旺故也。",
                        "如月上死绝，日时上虽生旺,气不甚雄，盖生承死绝故也。于三十岁前，须有几死之灾。",
                        "如月生旺，日时上死绝，人寿不过四十五岁。",
                        "月日时死绝者，死在三十岁前也。更有凶杀五行凌犯，必为殇子。未成年而死者，短命的人。",
                        "遇二运太岁会集在死绝衰败之乡，更太岁刑克与灾限相应者，定死也。各发在身无气月日时上也。",
                        "【此处应该是年干五行】凡旺运中死，或禄上死者，是称意中卒也。",
                        "命中是亡神、大耗重叠，死须破尸也",
                        "","","","","","",],
                    "冲":["【年月冲，日时冲 同时】生日对时人短命，生年对月亦复是，此乃人间短命法，人生值此少年纪。\n 如寅年、申月、午日、子时，是也。又日与时对，更被时克者，是也。",
                        "生日对时人促寿，日时相冲寿不长，天罡空亡难保守，定知恶死路头亡。",
                        "【年时同时双冲日柱】生日对年须可叹，生时对日亦堪伤，那看生处时同岁，二入风流寿不长。如甲寅年、丁酉月、戊申日、甲寅时，不出周岁死，生年对月亦然。（鬼谷要诀）",
                        "","","","","","",],
                    "【急脚杀】":["甲乙申酉见阎王，丙丁亥子切须防，庚辛巳午如风烛，戊己寅卯亦重伤，壬癸辰戌加丑未，永别浮生入鬼乡。（并三命篡局）",
                        "此以干支相克，只如甲乙属木、申酉属金，金克木也。",
                        "广信集作天鬼截路杀，若甲人见申，乙人见酉，生时带着，支干皆有者，定夭。如甲人见庚申,是支干皆有也。【太岁与大运逢之】，主多【孝服】，更与小运并，主死。",
                        "金书命诀云：行年二位临斯位，自察前程有盛衰。",
                        "",],
                    "【又急脚杀】":"金人沐浴(午)火(子)木(酉)胎，土死(卯)水墓(辰)四季裁，命有限逢为再犯(岁运在遇)，阎王急脚送书来。（金书命诀）",
                    "【截命杀】":"若子生人见丑，各于本命前一辰是人命归前次一支，子生须与丑为期，【三逢】必定遭凶死，【两见】须忧血渍衣。",
                    "【夭寿杀】":"木为身命，未申子全；金为身命，丑寅午全；火为身命，戌亥卯全；水土为身命，辰巳酉全，在【墓绝败】位。（广录）",
                    "【人过鬼门，气度消关。】":["火忌申酉亥（甲申、乙酉、癸亥；消关者，病、死、绝）",
                        "金嫌亥子寅，水土寅卯巳（水忌戊寅、己卯、丁巳，土忌庚寅、辛卯、己巳）","木怕巳午申（辛巳、甲午、壬申）","更若逢阴鬼，寿算永不停，艰辛尤住世，发即祸来寻，若人逢此地，不请怨天文。","","",],
                    "【四大空亡】":["颜回夭折，只因四大空亡。","甲子、甲午之旬，纳音无水。甲申、甲寅之旬，纳音无金。",
                        "甲子、甲午之旬，纳音无水。甲申、甲寅之旬，纳音无金。",
                        "生于甲子甲午旬之人，命内有三字水者，夭。","生于甲申甲寅旬之人，命内有三字金者，夭。","若见生只有两字，流年、大运更遇一重圆之，亦夭。（并壶中子）"],
                    "【短命杀-天年杀】":[
                        tianiansha[vm.nianzhi],
                        "主寿命不长，多遇丧祸，若【身能克杀】，则可免。",
                        "子人见亥，亥人见子。戍人见丑，丑人见戍，各两位依次数之",
                        "猪鼠无良犬战牛，鸡声催促夜行虎，龙羊猴兔不相入，巳午无人到白头"],
                    "【气短法】":"鬼限生来有所忧，欲知人死向斯求，金哥出去休骑马，火弟归来莫跨牛，木遇鼠蛇须远走，水逢鸡子也堪愁，土人切更防猪兔，难保年光到白头。（即小兄例中鬼关杀）",
                    "【推命杀-病符杀】":["若子生人见亥，各于本命后一辰是 命后一辰宜见两，重重见者涉疑猜，三重在外中年夭，五十年前祸必来。"],

                }

            };
            vm.sizhuAnalyze = result;

            vm.suiyunAnalyze["大运"] = {
                "虚一待用": ["发于沉滞之中，有非常之庆，起于贫贱之间，有不次之用，当在岁运相遇也。 ", "谓金、木、水、火而无土", "或乙、辛、丁而无癸", "或甲、丙、庚而无壬", "或辰、戌、丑而无未", "或卯、酉、午而无子", "或寅、申、亥而无巳", "有天乙而无天官", "有官印而无食神", "有甲戊而无庚，有丙丁而虚乙", "至于六合、四库、三合，交互见贵，见禄之类，待其岁运，补其不足，则气数备。"],
                "十干败亡": "只要日主四柱地支没有临官、帝旺根,轻则败落，重则死伤-法源是急脚杀",
                "墓库": "五年不吉祥",
                "冲": ["" +
                "双冲","岁运并临冲提大运：大凶", "岁运并临双冲四柱任一柱：大凶", "岁运不同冲：停滞一年", "岁运拱地支冲任何一柱：凶"
                    , "冲中带刑：凶"
                ],
                "生旺库罗网会齐": {
                    "四生": ["大胆闯祸，敢作敢为 没有则相反，大意轻敌而引祸", "巳亥为两极之地，地天斡旋；寅申为三停之方，邮递往来，如人遇之，多不执一"],
                    "四旺": ["是非", "令人往来不定", "私生活不佳"],
                    "四库": ["潜伏 隐蔽。不显山不漏水", "吉也凶", "丑未迟迟，辰戌速速，遇之令人执方，性不通变。辰戌有气，却能建立大事。"]
                },
                "方局混": ["四柱已经有三合或者半三合，柱、运、岁不能见三会，反之也是","如 四柱有 【亥、卯，卯、未，柱、运、岁见卯辰】"
                    ,"大忌流年或者大运天干有反制【三合之五行】或【日主五行】，此为【天干无反复】任铁樵擅长"
                    ,"大凶"
                    ,"女命详解117"
                ],
                "四角刑会": ["三合，三刑，三会，中多带一支","如 运，岁，柱会【亥、卯，未、未】"
                    ,"徐乐吾擅长，生死关键使用"
                    ,"女命详解118"
                ],
                "方阵四角刑": ["生、库中每一组带冲，另一组地支重复","如 【巳亥带寅寅或申申】【辰戌带丑丑或未未]】"
                    ,"大凶"
                    ,"刑冲会合透解32"
                ],

                "换甲": ["凡行运有逆行换甲入癸者，有顺行换癸入甲者，名曰换甲运。古语云：伤寒换阳，行运换甲，换得过是人，换不过是鬼。老人大忌之，后生差慢。（并广信集）",
                    "运到换甲为灾运，皆以生年太岁纳音推之【大运纳音克年优先】",
                    "1.必须是出生入死，才可算是，否则不为换甲之灾。换甲必须是经历长生运，再历死墓鬼，方是真换甲，正是，生金畏死火，生水畏死土，生土为死木。。。。。以此类推，遇到真鬼也。",
                    "经历长生，谓之生,实在死墓谓之死。假如纳音是木，木为身，运过癸亥长生处，交到甲子金，是换甲逢死鬼也。谓金死在子，墓在丑，故一金皆为死鬼也，其人必死。余准此。",
                    "换甲伏吟，换甲反吟，换甲刑冲，换甲穿害，换甲空亡。",
                    "1流年太岁与大运伏吟\n" +
                    "2流年太岁与大运对冲\n" +
                    "3流年太岁刑穿大运\n" +
                    "4大运正逢空亡，而流年刑冲穿",
                    "若命合贵而未贵，合有厚禄而未受，幼年或少年经换甲者，可以过也，只多病患孝服。（三命提要）",
                    "凡换甲者，谓六甲旬中，至换甲处，被纳音所克，换甲无气也。\n" +
                    "假令甲子金人，二月建丁卯，是金胎处生，男命顺行，大运经巳为金长生，此人大运到酉戌即死，缘甲子至癸酉，是十干气止处，换得甲午纳音属火，到酉为死，到戌为墓，\n" +
                    "所谓生金畏死火，此为换甲无气也。",
                    "凡纳音不经长生至换甲处，纳音不在死墓，即不为换甲也。假令丁卯人，正月中气\n" +
                    "日生，作五岁气运算，正月建壬寅，男命逆行即平生不换甲也。缘逆行过去之月，谓五岁以前在壬寅，七十五岁大运方\n" +
                    "到甲午，纳音已属金，故不为换甲也。",
                    "换甲所畏者，谓生金畏死火，生火畏死水，生水畏死土，生土畏死木，生木畏死金，生金畏生火，生火畏生水，生水畏生土，生土畏生木，生木畏生金。\n" +
                    "凡五行曾经历长生处，即为之生，五行在死墓处，即谓之死。（三命钤）",
                ],

                "金不换": jinbuhuan[vm.rigan + vm.yuezhi],
                "调候大运": tiaohoudayun[vm.rigan + vm.yuezhi],
                "十干行运口诀": shiganxingyunkoujue[vm.rigan],
 
                "亲属引死绝": ""


            };

            vm.suiyunAnalyze["二运"] = {
                "喜会(年干五行论)": [
                    "（一）谓大运至禄旺，小运至驿马。假令癸丑人，大运至子，小运至亥，是也。",
                    "（二）谓大运至驿马，小运至建禄。假令癸丑生人，大运至亥，小运至子，是也。",
                    "（三）谓大运至驿马，小运至马合。假令癸丑生人，大运至亥，小运至寅，是也。",
                    "（四）谓大运至驿马合，小运至驿马。假令癸丑生人，大运至寅，小运至亥，是也。",
                    "（五）谓大运至禄库，小运至禄库合。假令癸丑生人，大运至辰，小运至酉，是也。",
                    "（六）谓大运至禄财长生，或命财长生，小运至合。假令癸丑生人，寅为禄财长生，寅与亥合，申为命财长生，巳与申合，是也。",
                    "（七）谓大运至禄长生，小运至建禄。假令癸巳生人，大运至申，小运至子，是也。",
                    "（八）谓大运至身旺，小运与本命合。假令癸丑生人，大运至卯，小运至子，是也。",
                    "（九）谓大运小运至禄命旺相之乡。假令癸丑生人，至亥子是也。"

                ],
                "厄会": [
                    "（一）谓大运至禄命绝，小运至败，假令癸丑生人，大运至巳，小运至酉，是也。",
                    "（二）谓大小二运併在禄命无气之乡，假令癸丑生人，巳为绝，酉为败，丑为衰，寅为病，卯为死，辰为墓，是也。",
                    "（三）谓大运小运相冲，假令癸丑生人，大运至卯，小运至酉，或大运至酉，小运至卯，又卯酉为死败之乡，是也。",
                    "（四）谓大运在本命，小运又冲破，假令癸丑生人，大运至丑，小运至未，是也。",
                    "（五）谓大运至生月，小运至胎月，假令癸丑三月生，大运至辰，小运至未，是也。",
                    "（六）谓大小二运併在三刑、六害、元辰之位。假令癸丑生人，六害、元辰在午，三刑在未，是也。",
                    "（七）谓大小二运至灾劫二杀之位，假令癸丑生人，劫杀在寅，灾杀在卯，是也。",
                    "（八）谓大小二运落空亡，假令癸丑人，是甲辰旬中寅卯为空亡，是也。",
                    "（九）谓大小二运至男女正天罗地网，假令戌生男，遇亥，亥生女，遇戌，为正天罗。辰生男，遇巳，巳生女，遇辰，为正地网是也。",
                ]


            };


            vm.suiyunAnalyze["六法冲克"] = {
                "用法":"流年为原点 与日柱组合,时柱为原点 与年柱组合",
                "纳音相克":["纳音相克之中，是以地支隔一位者为重。 后退一位"],
                "墓鬼相克":"辰戌丑未地支相同，纳音相克",
                "空亡相克":"如甲子见庚申",
                "":"",
                "":"",
                "":"",
                "":"",

            }
            vm.suiyunAnalyze["流年"] = {
                "规则": [
                    "流年为起点与大运四柱匹配", {
                        "进角合": "进角吉",
                        "退角合": "先成后败"
                    }
                ],
                "神煞":{
                    "丧门": [sangmen[vm.liunianzhi]],
                    "吊客": diaoke[vm.liunianzhi],
                    "勾绞": [
                        gou[vm.liunianzhi],
                        jiao[vm.liunianzhi],
                        "阳命人前三辰为勾，后三辰为绞，阴命人前三辰为绞，后三辰为勾",
                        "凡人遇之，身若克杀，多掌刑法之任。或为将帅，专行诛戮。杀若克身，主非命而终。",
                        "玉门关集云：勾绞主非命,小人逢之，皆为飞横灾祸。行年至此，亦主口舌刑狱之事。（三命钤）",
                        "勾绞二杀至凶之神，二杀与人为灾，而不为福，值勾绞两位全者，灾重，一位者灾轻。",
                        "又云：以上杀有鬼则灾重，无鬼则灾轻。（三命提要）",

                    ],
                    "病符": [jiesha[vm.liunianzhi],"命后一辰"],
                    "死符": [jiesha[vm.liunianzhi],"病符对冲"],
                    "劫杀": jiesha[vm.liunianzhi],
                    "亡神": wangshen[vm.liunianzhi],
                    "元辰": [
                        "元辰大耗者，阳男阴女，在冲前一位支辰，阴男阳女，在冲后一辰",
                        "主人形狈古朴，声音沉浊，生旺落魄，大度不别是非。死绝则寒薄狈猥，不识羞辱，一生无成，贪饮好情",
                    ],
                    "孤辰": "",
                    "寡宿": "",
                    "灾煞": ["此煞主血光横死，在水火防焚溺，在土防坠落瘟疫。克身大凶，若有吉神相助，多有武权。"],
                },
                "流年流星诀":{}
            };


        }



        function init() {



            Restangular.one("customers", vm.id).get().then(function (hal) {
                vm.customer = hal;
                vm.genderSelected = getSelectedGender(hal.gender);
                vm.strBaZi = vm.customer.bazi;
                if (vm.customer.birth) {
                    vm.birth = vm.customer.birth;
                }

                analyze();


            }, function (error) {
                promptService.failure(setting.getDataError);

            });


        }


        init();

    }

})();