/**
 * @author lzy
 * created on 2017-04-17
 */
(function () {
  'use strict';

  angular.module('BlurAdmin.pages.customers')
      .controller('customersStudyCtrl', StudyCtrl);

  /** @ngInject */
  function StudyCtrl($stateParams, $state,Restangular,promptService,setting) {

    //阴阳
    var  yinyang = ["阴", "阳"];

    //天干
    var tiangan = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];

    //地支
    var dizhi = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];

    //五行
    var wuxing = ["木", "火", "土", "金", "水"];

      //60甲子纳音
      var jiazinayin={
        "甲子":'海中金',"乙丑":"海中金","丙寅":"炉中火","丁卯":"炉中火","戊辰":"大林木","己巳":"大林木","庚午":"路旁土","辛未":"路旁土","壬申":"剑锋金","癸酉":"剑锋金",
        "甲戌":"山头火","乙亥":"山头火","丙子":"涧下水","丁丑":"涧下水","戊寅":"城头土","己卯":"城头土","庚辰":"白蜡金","辛巳":"白蜡金","壬午":"杨柳木","癸未":"杨柳木",
        "甲申":"泉中水","乙酉":"泉中水","丙戌":"屋上土","丁亥":"屋上土","戊子":"霹雳火","己丑":"霹雳火","庚寅":"松柏木","辛卯":"松柏木","壬辰":"长流水","癸巳":"长流水",
        "甲午":"沙中金","乙未":"沙中金","丙申":"山下火","丁酉":"山下火","戊戌":"平地木","己亥":"平地木","庚子":"壁上土","辛丑":"壁上土","壬寅":"金箔金","癸卯":"金箔金",
        "甲辰":"复灯火","乙巳":"复灯火","丙午":"天河水","丁未":"天河水","戊申":"大驿土","己酉":"大驿土","庚戌":"钗钏金","辛亥":"钗钏金","壬子":"桑拓木","癸丑":"桑拓木",
        "甲寅":"大溪水","乙卯":"大溪水","丙辰":"沙中土","丁巳":"沙中土","戊午":"天上火","己未":"天上火","庚申":"石榴木","辛酉":"石榴木","壬戌":"大海水","癸亥":"大海水"
    };
    function getnayin(jiazi) {
        return jiazinayin[jiazi];
    }

    function getnayinwuxing(jiazi) {
        return jiazinayin[jiazi][2];
    }

    //天干五行
    var ganwuxing ={
        "甲":"木",
        "乙":"木",
        "丙":"火",
        "丁":"火",
        "戊":"土",
        "己":"土",
        "庚":"金",
        "辛":"金",
        "壬":"水",
        "癸":"水"
    };

    function getganwuxing(gan){

        return ganwuxing[gan];

    }

      //天干禄地支
      var ganlu ={
          "甲":"寅",
          "乙":"卯",
          "丙":"巳",
          "丁":"午",
          "戊":"巳",
          "己":"午",
          "庚":"申",
          "辛":"酉",
          "壬":"亥",
          "癸":"子"
      };

      function getlu(gan) {
          return ganlu[gan];
      }

      //天乙贵人
      var tianyi={
          "甲":"丑未" ,"戊":"丑未" ,"庚":"丑未",
          "乙":"子申" ,"己":"子申" ,
          "丙":"亥酉" ,"丁":"亥酉" ,
          "壬":"巳卯" ,"癸":"巳卯" ,
          "辛":"午寅"
      };

      function gettianyi(gan) {
          return tianyi[gan];
      }


       //食神
    var shishen ={
        "甲":"丙",
        "乙":"丁",
        "丙":"戊",
        "丁":"己",
        "戊":"庚",
        "己":"辛",
        "庚":"壬",
        "辛":"癸",
        "壬":"甲",
        "癸":"乙"
    };

    //正财
    var zhengcai ={
        "甲":"己",
        "乙":"戊",
        "丙":"辛",
        "丁":"庚",
        "戊":"癸",
        "己":"壬",
        "庚":"乙",
        "辛":"甲",
        "壬":"丁",
        "癸":"丙"
    };

     //正财
     var piancai ={
        "甲":"戊",
        "乙":"己",
        "丙":"庚",
        "丁":"辛",
        "戊":"壬",
        "己":"癸",
        "庚":"甲",
        "辛":"乙",
        "壬":"丙",
        "癸":"丁"
    };

    //正官
    var zhengguan ={
        "甲":"辛",
        "乙":"庚",
        "丙":"癸",
        "丁":"壬",
        "戊":"乙",
        "己":"甲",
        "庚":"丁",
        "辛":"丙",
        "壬":"己",
        "癸":"戊"
    };


      //驿马
     var yima = {
         "申": "寅",
         "子": "寅",
         "辰": "寅",

         "亥": "巳",
         "卯": "巳",
         "未": "巳",

         "寅": "申",
         "午": "申",
         "戌": "申",

         "巳": "亥",
         "酉": "亥",
         "丑": "亥"
     };

     function getma(zhi) {
        return yima[zhi];
    }


     //劫杀-五行绝地
    var jiesha={
        "申":"巳",
        "子":"巳",
        "辰":"巳",

        "亥":"申",
        "卯":"申",
        "未":"申",

        "寅":"亥",
        "午":"亥",
        "戌":"亥",

        "巳":"寅",
        "酉":"寅",
        "丑":"寅"
    };

    

//亡神-五行禄地
var wangshen={
        "申":"亥",
        "子":"亥",
        "辰":"亥",

        "亥":"寅",
        "卯":"寅",
        "未":"寅",

        "寅":"巳",
        "午":"巳",
        "戌":"巳",

        "巳":"申",
        "酉":"申",
        "丑":"申"
};

     //【纳音五行正印】
     var wuxingzhengyin = 
     {"金":"乙丑",
     "木":"癸未" ,
     "水":"壬辰",
     "火":"甲戌",
     "土":"丙辰"
    };

    function getwuxingzhengyin(wuxing) {
        return wuxingzhengyin[wuxing];
    }

    var  infoChangShengJue = ["长生","沐浴","冠带","临官","帝旺","衰","病","死","墓","绝","胎","养"]
    var nayinchangshengjue = {
        "金":{"巳":"长生","午":"沐浴","未":"冠带","申":"临官","酉":"帝旺","戌":"衰","亥":"病","子":"死","丑":"墓","寅":"绝","卯":"胎","辰":"养"},
        "木":{"亥":"长生","子":"沐浴","丑":"冠带","寅":"临官","卯":"帝旺","辰":"衰","巳":"病","午":"死","未":"墓","申":"绝","酉":"胎","戌":"养"},
        "水":{"申":"长生","酉":"沐浴","戌":"冠带","亥":"临官","子":"帝旺","丑":"衰","寅":"病","卯":"死","辰":"墓","巳":"绝","午":"胎","未":"养" },
        "火":{"寅":"长生","卯":"沐浴","辰":"冠带","巳":"临官","午":"帝旺","未":"衰","申":"病","酉":"死","戌":"墓","亥":"绝","子":"胎","丑":"养"},
        "土":{"亥":"长生","子":"沐浴","丑":"冠带","寅":"临官","卯":"帝旺","辰":"衰","巳":"病","午":"死","未":"墓","申":"绝","酉":"胎","戌":"养"} 
   }; 

   function getnayinchangshengjue(wuxing){
    return nayinchangshengjue[wuxing];

   }

   var wuxingchangshengjue = {
    "金":{"巳":"长生","午":"沐浴","未":"冠带","申":"临官","酉":"帝旺","戌":"衰","亥":"病","子":"死","丑":"墓","寅":"绝","卯":"胎","辰":"养"},
    "木":{"亥":"长生","子":"沐浴","丑":"冠带","寅":"临官","卯":"帝旺","辰":"衰","巳":"病","午":"死","未":"墓","申":"绝","酉":"胎","戌":"养"},
    "水":{"申":"长生","酉":"沐浴","戌":"冠带","亥":"临官","子":"帝旺","丑":"衰","寅":"病","卯":"死","辰":"墓","巳":"绝","午":"胎","未":"养" },
    "火":{"寅":"长生","卯":"沐浴","辰":"冠带","巳":"临官","午":"帝旺","未":"衰","申":"病","酉":"死","戌":"墓","亥":"绝","子":"胎","丑":"养"},
    "土":{"寅":"长生","卯":"沐浴","辰":"冠带","巳":"临官","午":"帝旺","未":"衰","申":"病","酉":"死","戌":"墓","亥":"绝","子":"胎","丑":"养"}
}; 
    function getwuxingchangshengje(wuxing){
        return wuxingchangshengjue[wuxing];
    }
      var vm = this;
      vm.customer=$stateParams.customer;

     vm.strBaZi = "甲子 丙寅 丁卯 癸亥";
     vm.gender= "男";

     //年
     vm.niangan="";
     vm.nianzhi="";
     vm.nianzhu="";
     vm.niannayin="";

      //月
      vm.yuegan="";
      vm.yuezhi="";
      vm.yuezhu="";
      vm.yuenayin="";

      //日
      vm.rigan="";
      vm.rizhi="";
      vm.rizhu="";
      vm.rinayin="";

      //时
      vm.shigan="";
      vm.shizhi="";
      vm.shizhu="";
      vm.shinayin="";

      //胎
      vm.taigan="";
      vm.taizhi="";
      vm.taizhu="";
      vm.tainayin="";


      //大运
      vm.dayungan="";
      vm.dayunzhi="";
      vm.dayunzhu="";
      vm.dayunnayin="";

      //流年
      vm.liuniangan="";
      vm.liunianzhi="";
      vm.liunianzhu="";
      vm.liuniannayin="";

      //行年
      vm.xingniangan="";
      vm.xingnianzhi="";
      vm.xingnianzhu="";
      vm.xingniannayin="";




      // 性别
      vm.genderList = [
          {title: '男', value: '1'},
          {title: '女', value: '2'}
      ];

      //选择后
      vm.selectedGender =vm.genderList[0];

      function getSelectedGender(value) {
          for(var i=0;i<vm.genderList.length;i++){

              if (vm.genderList[i].value===value) {
                  return vm.genderList[i];
              }
          }

      }


      vm.bazi = {
          birth:1984,
          "gender":"男",
          "niangan":"丙",
          "nianzhi":"子",
          niannayin:"",
          nianzhu:"丙子",

          "yuegan":"丙",
          "yuezhi":"寅",
          yuenayin:"",

          "rigan":"甲",
          "rizhi":"寅",
          rinayin:"",

          "shigan":"乙",
          "shizhi":"卯",
          shinayin:"",

          "taigan":"",
          "taizhi":"",
          tainayin:"",

          "minggan":"甲",
          "mingzhi":"子",
          "shengan":"甲",
          "shenzhi":"子",

          "yungan":"乙",
          "yunzhi":"丑",

          "liuniangan":"丙",
          "liunianzhi":"寅",
          "xingniangan":"丁",
          "xingnianzhi":"亥",

          dayun:"乙丑",
          dayunnayin:"",
          liunian:"乙丑",
          xingnian:"乙丑"

      };
      vm.year = 1984;

      vm.xingnian=[[],[],[],[],[],[],[],[],[],[]];
      vm.xingnianShiZhu=[[],[],[],[],[],[],[],[],[],[]];

      //分析结果
      vm.analyzeResult={};

      var yangGan = ["甲","丙","戊","庚","壬"];
      function isYangGan(gan) {
          var index = yangGan.indexOf(gan);
          return index > 0;
      }

      vm.calculateXingNian=calculateXingNian;
      vm.calculateXingNianShiZhu=calculateXingNianShiZhu;


      //天干
      var tiangan = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];

      //地支
      var  dizhi = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];

      var sixtyJiaZi= [
          "甲子","乙丑","丙寅","丁卯","戊辰","己巳","庚午","辛未","壬申","癸酉",
          "甲戌","乙亥","丙子","丁丑","戊寅","己卯","庚辰","辛巳","壬午","癸未",
          "甲申","乙酉","丙戌","丁亥","戊子","己丑","庚寅","辛卯","壬辰","癸巳",
          "甲午","乙未","丙申","丁酉","戊戌","己亥","庚子","辛丑","壬寅","癸卯",
          "甲辰","乙巳","丙午","丁未","戊申","己酉","庚戌","辛亥","壬子","癸丑",
          "甲寅","乙卯","丙辰","丁巳","戊午","己未","庚申","辛酉","壬戌","癸亥"
      ];

    

      //60甲子属性
      //http://blog.sina.com.cn/s/blog_614375770102wn3s.html
      var jiazishuxinglist={
          "甲子":['海中金'
              ,'从革之金，其气散，得【戊申土】，【癸巳水】相之，则吉。戊申乃金临官之地，土者更旺于子，必能生成，癸巳系金，生于巳，水旺于子，纳音各有所归，又为朝元禄，忌丁卯丁酉戊午之火'
              ,'进神'
              ,"阎东叟云：甲子金为进神，禀沉潜灵中之德，四时皆吉，入贵格，承旺气，则术业精微，主魁夺之荣。"
              ,"玉霄宝鉴云：甲子乙丑未成器金，见火则成，多见则吉。"
              ,"为宝物,喜金木旺地"
          ],
          "乙丑":["海中金"
              ,"自库之金，火不能克，盖退藏之金，苟无刑害冲破，未有不显荣者，独忌【己丑】【戊午】【己未】之火。"
              ,"正印"
              ,"阎东叟云：具大福德，秋冬富贵寿考，春夏吉中有凶，入格则建功享福，带煞类为凶会，"
              ,"玉霄宝鉴云：甲子乙丑未成器金，见火则成，多见则吉。"
              ,"为顽矿,喜火及南方月时"
          ],
          "丙寅":["炉中火"
              ,"丙寅赫牺之火，无水制之，则为燔灼炎烈之患，水不可遇，独爱甲寅之水，就位济之，又名朝元禄。"
              ,"五行要论云：丙寅火食灵明冲粹之气，四时生生之德，入贵格，则文彩发应，主科甲之贵。"
              ,"珞琭子云：丙寅丁卯秋天宜以保持。莹和尚注云：丙寅丁卯举火之类，秋天保持者，言水生于秋也。鬼谷遗文云：丙寅丁卯秋冬宜以保持。注云：木不南奔火无西旺，火至秋冬，势恐不久。"
              ,""
              ,""
          ],
          "丁卯":["炉中火"
              ,"丁卯伏明之火，气弱宜木生之，遇水则凶，乙卯乙酉水最毒。"
              ,"五行要论云：丁卯沐浴之火，含雷动风作之气，水济之则达，土载之则基厚，以木资之为文彩，以金橐之，更逢夏令则凶暴。"
              ,"珞琭子云：丙寅丁卯秋天宜以保持。莹和尚注云：丙寅丁卯举火之类，秋天保持者，言水生于秋也。鬼谷遗文云：丙寅丁卯秋冬宜以保持。注云：木不南奔火无西旺，火至秋冬，势恐不久。"
              ,""
          ],
          "戊辰":["大林木"
              ,"戊辰两土下木，众金不能克，盖生金，有母子之道，得土生之为佳。"
              ,"五行要论云：戊辰庚寅癸丑三辰，挺木德清健之数，生于春夏，能转立独奋，随变成功，更成旺气，则有凌霄耸壑之志，惟忌秋生，虽怀志节，屈而不伸。"
              ,"珞琭子云：己巳戊辰度乾宫而脱厄。莹和尚注云：己巳戊辰举木之数，西方金鬼旺乡，纳音之木，至此绝矣，斯谓厄会。若度乾亥之宫，木得水以生长，故脱厄。"
              ,""
          ],
          "己巳":["大林木"
              ,"己巳为近火之木，金自此生，于我无伤，忌见生旺之火。"
              ,"阎东叟云：己巳在巽为风动之木，根危易拔，和之以金土，运归东南方成材用虽外阳内阴，别无辅助，则其气灵散，更为生鬼所克，乃不材之本也。"
              ,"珞琭子云：己巳戊辰度乾宫而脱厄。莹和尚注云：己巳戊辰举木之数，西方金鬼旺乡，纳音之木，至此绝矣，斯谓厄会。若度乾亥之宫，木得水以生长，故脱厄。"
          ],"庚午":["路旁土"
              ,"始生之土，木不能克，惟忌水多，反伤其气，木多却有归，盖归未也。"
              ,"阎东叟云：庚午辛未戊申丁巳，皆厚德之土，含容镇静，和气融怡，福禄优裕。入格则多历方岳之任，有普惠博爱之功。"
              ,""
              ,""
          ],"辛未":["路旁土"
              ,"始生之土，木不能克，惟忌水多，反伤其气，木多却有归，盖归未也。"
              ,"阎东叟云：庚午辛未戊申丁巳，皆厚德之土，含容镇静，和气融怡，福禄优裕。入格则多历方岳之任，有普惠博爱之功。"
          ],"壬申":["剑锋金"
              ,"临官之金，利见水土，若丙申丙寅戊午之火，则为灾害。 "
              ,"阎东叟云：壬申金，持天将之威，资临官之气，秋冬掌生杀之权，春夏吉少凶多，入格以功名自奋，带杀之刻剥为能。"
              ,"玉霄宝鉴云：壬申癸酉，金旺之位，不可复旺，旺则伤物；不可见火，见火则自伤。"
              ,""
              ,""
          ],"癸酉":["剑锋金"
              ,"坚成之金，火死于酉，见火何伤，惟忌丁酉火，【就位克之】。 "
              ,"阎东叟云：癸酉自旺之金，禀纯粹之气，春夏为性英明，秋冬尤贵。入格则功业节概，挺转出伦；带杀则少年刚劲，四十之后，渐成纯德。"
              ,"玉霄宝鉴云：壬申癸酉，金旺之位，不可复旺，旺则伤物；不可见火，见火则自伤。"
              ,""
              ,""
          ],


          "甲戌":["山头火"
              ,"自库之火，不嫌众水，惟忌壬戌，所谓墓中受克，其患难逃。"
              ,""
              ,""
              ,""
          ],"乙亥":["山头火"
              ,""
              ,""
              ,""
          ],"丙子":["涧下水"
              ,""
              ,""
              ,""
          ],"丁丑":["涧下水"
              ,""
              ,""
              ,""
          ],"戊寅":["城头土"
              ,""
              ,""
              ,""
          ],"己卯":["城头土"
              ,""
              ,""
              ,""
          ],"庚辰":["白蜡金"
              ,""
              ,""
              ,""
          ],"辛巳":["白蜡金"
              ,""
              ,""
              ,""
          ],"壬午":["杨柳木"
              ,""
              ,""
              ,""
          ],"癸未":["杨柳木"
              ,""
              ,""
              ,""
          ],
          "甲申":["泉中水"],"乙酉":["泉中水"],"丙戌":["屋上土"],"丁亥":["屋上土"],"戊子":["霹雳火"],"己丑":["霹雳火"],"庚寅":["松柏木"],"辛卯":["松柏木"],"壬辰":["长流水"],"癸巳":["长流水"],
          "甲午":["沙中金"],"乙未":["沙中金"],"丙申":["山下火"],"丁酉":["山下火"],"戊戌":["平地木"],"己亥":["平地木"],"庚子":["壁上土"],"辛丑":["壁上土"],"壬寅":["金箔金"],"癸卯":["金箔金"],
          "甲辰":["复灯火"],"乙巳":["复灯火"],"丙午":["天河水"],"丁未":["天河水"],"戊申":["大驿土"],"己酉":["大驿土"],"庚戌":["钗钏金"],"辛亥":["钗钏金"],"壬子":["桑拓木"],"癸丑":["桑拓木"],
          "甲寅":["大溪水"],"乙卯":["大溪水"],"丙辰":["沙中土"],"丁巳":["沙中土"],"戊午":["天上火"],"己未":["天上火"],"庚申":["石榴木"],"辛酉":["石榴木"],"壬戌":["大海水"],"癸亥":["大海水"]
        };

      //调侯用神表
      var tiaohou={
      "甲寅":{detail:"丙癸,庚丁",remark:"调和气候为要。丙火为主。癸水为佐助.雨水后庚为主"},
      "甲卯":{detail:"庚，丙，丁，戊，己",remark:"羊刃架杀，专用庚金，以戊己为辅佐。无庚用丙丁泄秀，不取制杀。"},
      "甲辰":{detail:"庚，丁，壬",remark:"用庚金必须丁火制之，伤官制杀。无庚用壬"},
      "甲巳":{detail:"癸，庚，丁",remark:"调和气候癸水为主。原局气润，庚丁为用"},
      "甲午":{detail:"癸，庚，丁",remark:"木性虚焦，癸水为主。无癸用丁，要行北运。木盛先庚，庚盛先丁"},
      "甲未":{detail:"癸，庚，丁",remark:"上半月同午月用癸。下半月用庚丁。"},
      "甲申":{detail:"庚，丁，壬",remark:"伤官制杀，无丁用壬"},
      "甲酉":{detail:"庚，丁，丙",remark:"用丁制杀，用丙调侯。丁丙并用为辅佐"},
      "甲戌":{detail:"庚，甲，丁，壬，癸",remark:"土旺者用甲木，木旺者用庚金，丁壬癸为辅佐"},
      "甲亥":{detail:"庚，丁，丙，戊",remark:"用庚金必须丁火制之，用丙调侯。水旺用戊"},
      "甲子":{detail:"丁，庚，丙",remark:"木性生寒，丁先庚后。用丙调侯。必须支见巳，寅，方为贵格"},
      "甲丑":{detail:"丁，庚，丙",remark:"丁火必不可少.丙通根巳、寅。甲木为助。用庚劈甲引丁。"},

      "乙寅":{detail:"丙，癸",remark:"取丙火解寒。略取癸水滋润。不宜困丙。火多用癸"},
      "乙卯":{detail:"丙，癸",remark:"以癸滋木。以丙泄秀，不宜见金"},
      "乙辰":{detail:"癸，丙，戊",remark:"若支成水局，取戊为佐"},
      "乙巳":{detail:"癸",remark:"月令丙火得禄，专用癸水，调候为急。"},
      "乙午":{detail:"癸，丙",remark:"上半月专用癸水，下半月丙癸并用"},
      "乙未":{detail:"癸，丙",remark:"润土滋木，喜用癸水，柱多金水，先用丙火。夏月壬癸，切忌戊，己杂乱。 "},
      "乙申":{detail:"丙，癸，己",remark:"月垣庚金司令，取丙火制之，或癸水化之。不论用丙用癸，皆己土为佐。 "},
      "乙酉":{detail:"癸，丙，丁",remark:"上半月癸先丙后，下半月丙先癸后，无癸用壬。支成金局，又宜用丁。 "},
      "乙戌":{detail:"癸，辛",remark:"以金发水之源。见甲，名藤萝系甲。"},
      "乙亥":{detail:"丙，戊",remark:"乙木向阳，专取丙火。水多以戊佐"},
      "乙子":{detail:"丙",remark:"寒木向阳，专取丙火，忌见癸水"},
      "乙丑":{detail:"丙",remark:"寒谷回春，专用丙火"},


      "丙寅":{detail:"壬，庚",remark:"壬水为用，庚金发水之源为佐"},
      "丙卯":{detail:"壬，己",remark:"专用壬水，水多用戊制之，身弱用印化之"},
      "丙辰":{detail:"壬，甲",remark:"专用壬水，土重以甲为佐"},
      "丙巳":{detail:"壬，癸，庚",remark:"以庚为佐，忌戊制壬。无壬用癸"},
      "丙午":{detail:"壬，庚",remark:"壬庚以通根申宫为妙。未月：壬，庚。以庚为佐"},
      "丙未":{detail:"壬，庚",remark:"以庚为佐"},
      "丙申":{detail:"壬，戊",remark:"壬水通根申宫，壬多必取戊制"},
      "丙酉":{detail:"壬，癸",remark:"四柱多丙，一壬高透为奇。无壬用癸"},
      "丙戌":{detail:"甲，壬",remark:"忌土晦光，先取甲疏土，次用壬水"},
      "丙亥":{detail:"甲，戊，庚，壬",remark:"月垣壬水秉令，水旺用甲木化之，身煞两旺，用戊制之。火旺用壬，木旺宜庚。 "},
      "丙子":{detail:"壬，戊，己",remark:"气进二阳，丙火弱中复强，用壬水，用戊制之。无戊用己"},
      "丙丑":{detail:"壬，甲",remark:"喜壬为用，土多不可少甲"},


      "丁寅":{detail:"甲，庚",remark:"用庚金劈甲引丁"},
      "丁卯":{detail:"庚，甲",remark:"以庚去乙，以甲引丁"},
      "丁辰":{detail:"甲，庚",remark:"用甲木引丁制土，次看庚金"},
      "丁巳":{detail:"甲，庚",remark:"取甲引丁，甲多又取庚为先"},
      "丁午":{detail:"壬，庚，癸",remark:"火多以庚壬两透为贵。无壬用癸，为独煞当权"},
      "丁未":{detail:"甲，壬，庚",remark:"以甲木化壬引丁为用，用甲不能无庚，取庚为佐"},
      "丁申":{detail:"甲，庚，丙，戊",remark:"取庚劈甲，无甲用乙。用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。水旺用戊"},
      "丁酉":{detail:"甲，庚，丙，戊",remark:"取庚劈甲，无甲用乙。用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。水旺用戊"},
      "丁戌":{detail:"甲，庚，戊",remark:"一派戊土无甲，为伤官伤尽"},
      "丁亥":{detail:"甲，庚",remark:"庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用"},
      "丁子":{detail:"甲，庚",remark:"庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用"},
      "丁丑":{detail:"甲，庚",remark:"庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用"},

      "戊寅":{detail:"丙，甲，癸。",remark:"无丙照暖，戊土不生，无甲疏劈，戊土不灵。无癸滋润，万物不长，先丙，次甲，次癸。 "},
      "戊卯":{detail:"丙，甲，癸",remark:"无丙照暖，戊土不生，无甲疏劈，戊土不灵。无癸滋润，万物不长，先丙，次甲，次癸。"},
      "戊辰":{detail:"甲，丙，癸",remark:"戊土司令，先用甲疏，次丙，次癸"},
      "戊巳":{detail:"甲，丙，癸",remark:"戊土建禄，先用甲疏劈，次取丙癸"},
      "戊午":{detail:"壬，甲，丙",remark:"调候为急，先用壬水，次取甲木，丙火配用"},
      "戊未":{detail:"癸，丙，甲",remark:"调候为急，癸不可缺，丙火配用。土重不能无甲。"},
      "戊申":{detail:"丙，癸，甲",remark:"寒气渐增，先用丙火。水多，用甲泄之"},
      "戊酉":{detail:"丙，癸",remark:"赖丙照暖，喜水滋润"},
      "戊戌":{detail:"甲，丙，癸",remark:"戊土当权，先用甲木，次取丙火。见金，先用癸水，后取丙火。 "},
      "戊亥":{detail:"甲，丙",remark:"非甲不灵，非丙不暖"},
      "戊子":{detail:"丙，甲",remark:"丙火为尚，甲木为佐"},
      "戊丑":{detail:"丙，甲",remark:"丙火为尚，甲木为佐"},



      "己寅":{detail:"丙，庚，甲",remark:"取丙解寒，忌见壬水，如水多，须以戊土为佐。土多用甲，甲多用庚。 "},
      "己卯":{detail:"甲，癸，丙",remark:"用甲忌与己土合化，次用癸水润之"},
      "己辰":{detail:"丙，癸，甲",remark:"先丙后癸，土暖而润，随用甲疏"},
      "己巳":{detail:"癸，丙",remark:"调候不能无癸，土润不能无丙"},
      "己午":{detail:"癸，丙",remark:"调候不能无癸，土润不能无丙"},
      "己未":{detail:"癸，丙",remark:"调候不能无癸，土润不能无丙"},
      "己申":{detail:"丙，癸",remark:"丙火温土，癸水润土，七月庚金司权，丙能制金，癸以泄金"},
      "己酉":{detail:"丙，癸",remark:"取辛辅癸"},
      "己戌":{detail:"甲，丙，癸",remark:"九月土盛，宜甲木疏之，次用丙癸"},
      "己亥":{detail:"丙，甲，戊",remark:"三冬己土，非丙暖不生。初冬壬旺，取戊土制之，土多，取甲木疏之。"},
      "己子":{detail:"丙，甲，戊",remark:"三冬己土非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。 "},
      "己丑":{detail:"丙，甲，戊",remark:"三冬己土非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。  "},

      "庚寅":{detail:"戊，甲，壬，丙，丁",remark:"用丙暖庚性，虑土厚埋金，须甲疏泄。火多用土，支成火局用壬。 "},
      "庚卯":{detail:"丁，甲，庚，丙",remark:"庚金暗强，专用丁火，借甲引丁，用庚劈甲。无丁用丙"},
      "庚辰":{detail:"甲，丁，壬，癸",remark:"顽金宜丁，旺土用甲，不用庚劈。：支火宜癸，干火宜壬。 "},
      "庚巳":{detail:"壬，戊，丙，丁",remark:"丙不熔金，惟喜壬制，次取戊土，丙火为佐。支成金局，变弱为强，须用丁火 "},
      "庚午":{detail:"壬，癸",remark:"专用壬水，癸次之，须支见庚辛为助。无壬，癸，用戊，己泄火之气。 "},
      "庚未":{detail:"丁，甲",remark:"若支会土局，甲先丁后"},
      "庚申":{detail:"丁，甲",remark:"专用丁火，甲木引丁"},
      "庚酉":{detail:"丁，甲，丙",remark:"用丁甲　金，兼用丙火调候。"},
      "庚戌":{detail:"甲，壬",remark:"土厚先用甲疏，次用壬洗"},
      "庚亥":{detail:"丁，丙",remark:"水冷金寒爱丙丁，甲木辅丁"},
      "庚子":{detail:"丁，甲，丙",remark:"仍取丁甲，次取丙火照暖，一派金水，不入和暖之乡，孤贫。丙丁须临寅巳午未戌支，方为有力"},
      "庚丑":{detail:"丙，丁，甲",remark:"仍取丁甲，次取丙火照暖，一派金水，不入和暖之乡，孤贫。丙丁须临寅巳午未戌支，方为有力"},

      "辛寅":{detail:"己，壬，庚",remark:"辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人庚为助"},
      "辛卯":{detail:"壬，甲",remark:"辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人庚为助。"},
      "辛辰":{detail:"壬，甲",remark:"若见丙火合辛，须有癸制丙，支见亥子申，为贵"},
      "辛巳":{detail:"壬，甲，癸",remark:"壬水洗淘，兼有调候之用，更有甲木制戊，一清澈底"},
      "辛午":{detail:"壬，己，癸",remark:"己无壬不湿，辛无巳不生，故壬，巳并用。无壬用癸。"},
      "辛未":{detail:"壬，庚，甲",remark:"先用壬水，取庚为佐，忌戊出，得甲制之，方吉"},
      "辛申":{detail:"壬，甲，戊",remark:"壬水为，甲戊酌用。不可用癸水"},
      "辛酉":{detail:"壬，甲",remark:"壬水淘洗，如见戊己，须甲制土，支成金局无壬须用丁火"},
      "辛戌":{detail:"壬，甲",remark:"月辛金，火土为病，水木为药"},
      "辛亥":{detail:"壬",remark:"先壬后丙，名金白水清，馀皆酌用"},
      "辛子":{detail:"丙，戊，壬，申",remark:"冬月辛金，不能缺丙火温暖，馀皆酌用。"},
      "辛丑":{detail:"丙，壬，戊，己",remark:"冬月辛金，不能缺丙火温暖，馀皆酌用。壬先，戊己次之，总之，丙火不可少也"},

      "壬寅":{detail:"庚，丙，戊",remark:"无比劫者，不必用戊，专用庚金，以丙为佐。如比劫多，又宜制之，一戊出，名一将当关，群邪自伏"},
      "壬卯":{detail:"戊，辛，庚",remark:"三春壬水绝地，取庚，辛发水之源。水多用戊"},
      "壬辰":{detail:"甲，庚",remark:"甲疏季上，次取庚金发水源，金多预丙制之为妙。"},
      "壬巳":{detail:"壬，辛，庚，癸",remark:"壬水弱极，取庚，辛为源，壬癸比劫"},
      "壬午":{detail:"癸，庚，辛",remark:"取庚为源，取癸为佐。无庚用辛"},
      "壬未":{detail:"辛，甲",remark:"以辛金发水源，甲木疏土"},
      "壬申":{detail:"戊，丁",remark:"取丁火佐戊制庚，戊土通根辰戌，丁火通根午戌，方可为用"},
      "壬酉":{detail:"甲，庚",remark:"无甲，用金发水之源，名独水犯庚辛，体全之义"},
      "壬戌":{detail:"甲，丙",remark:"以甲制戌中戊土，丙火为佐"},
      "壬亥":{detail:"戊，丙，庚",remark:"如甲出制戊，须以庚金为救。"},
      "壬子":{detail:"戊，丙",remark:"水旺宜戊，调候宜丙，丙戊必须兼用"},
      "壬丑":{detail:"丙，丁，甲",remark:"上半月专用丙火，下半月用丙，甲木为佐"},

      "癸寅":{detail:"辛，丙",remark:"用辛生癸水为源，无辛用庚，丙不可少。 "},
      "癸卯":{detail:"庚，辛",remark:"乙木司令，专用庚金，辛金次之"},
      "癸辰":{detail:"丙，辛，甲",remark:"上半月专用丙火，下半月虽用丙火，辛甲为佐"},
      "癸巳":{detail:"辛",remark:"无辛用庚"},
      "癸午":{detail:"庚，辛，壬，癸",remark:"庚辛为生身之本，但丁火司权，金难敌火，宜兼用比劫，方得庚辛之用。"},
      "癸未":{detail:"庚，辛，壬，癸",remark:"上半月金神衰弱，火气炎热，宜比劫帮身，同五月。下半月无比劫亦可。"},
      "癸申":{detail:"丁",remark:"庚金得禄，必丁火制金为用，丁火以通根午戌未为妙"},
      "癸酉":{detail:"辛，丙",remark:"辛金为用，丙火佐之，名水暖金温，须隔位同透为妙。"},
      "癸戌":{detail:"辛",remark:"专用辛金，忌戊土，要比劫兹甲制戊方妙。"},
      "癸亥":{detail:"庚，辛，戊，丁",remark:"亥中甲木长生，泄散元神，宜用庚辛。水多用戊，金多用丁。"},
      "癸子":{detail:"丙，辛",remark:"丙火解冻，辛金滋扶"},
      "癸丑":{detail:"丙，庚，辛",remark:"丙火解冻，通根寅巳午未戌方妙。支成金局，要丙透得地。支成火局，又宜用庚辛。"}


  };

      /**
       *    用法：
       *    流年为原点 与日柱组合
       *    时柱为原点与 年柱组合
       *  六法冲克-细批终身详解 P616 论“大凶”
       *  “六法冲克”断生死关口 http://blog.sina.com.cn/s/blog_49d801fd0102dsp3.html
       *   纳音相克：纳音相克之中，是以地支隔一位者为重。 后退一位

           墓鬼相克：辰戌丑未地支相同，纳音相克。

           空亡相克：如甲子见庚申。

           夹拱生克：如辛未逢丙午，而见申、卯、午支。

           井栏互克：如甲戌见甲子。

           死生同途：如甲子见己亥、癸未。
       庄案：

       六法冲克是梁师根据《三命通会》卷十《看命口诀》归纳整理成六法冲克表，便利后学检索。
       唯此表错误极多，引用需谨慎。有一定基础者可据《看命口诀》予以修订。
       凡命怕同类相破，如己未见甲辰、甲辰见己丑、己丑见甲戌、甲戌见己未。凡在四冲之地，纳音同类，逐两位逆数之，寅申巳亥、子午卯酉亦以此取，主平生不足，多不成器道。《经》云：“井栏互破，无药可医，遇空亡庶几，岁运亦忌之。”
       原文甲戌见己未，梁师表中误为甲戌见甲子。余可类推。
       * [2017-08-03 add by longzhiyou]
       */

      //60甲子模板
      var jiazimoban={
          "甲子":[""],"乙丑":[""],"丙寅":[""],"丁卯":[""],"戊辰":[""],"己巳":[""],"庚午":[""],"辛未":[""],"壬申":[""],"癸酉":[""],
          "甲戌":[""],"乙亥":[""],"丙子":[""],"丁丑":[""],"戊寅":[""],"己卯":[""],"庚辰":[""],"辛巳":[""],"壬午":[""],"癸未":[""],
          "甲申":[""],"乙酉":[""],"丙戌":[""],"丁亥":[""],"戊子":[""],"己丑":[""],"庚寅":[""],"辛卯":[""],"壬辰":[""],"癸巳":[""],
          "甲午":[""],"乙未":[""],"丙申":[""],"丁酉":[""],"戊戌":[""],"己亥":[""],"庚子":[""],"辛丑":[""],"壬寅":[""],"癸卯":[""],
          "甲辰":[""],"乙巳":[""],"丙午":[""],"丁未":[""],"戊申":[""],"己酉":[""],"庚戌":[""],"辛亥":[""],"壬子":[""],"癸丑":[""],
          "甲寅":[""],"乙卯":[""],"丙辰":[""],"丁巳":[""],"戊午":[""],"己未":[""],"庚申":[""],"辛酉":[""],"壬戌":[""],"癸亥":[""]
      };



      //纳音同类破，



      /**
       * 三命通会
       *  凡命，最怕鬼克，而
       *  窠鬼最毒。如丙子水见庚子土，丁丑水见辛丑土之类。窠中就位相克，所以最毒。
       *  有墓中鬼，如壬辰水见丙辰土，丙辰土见戊辰木之类
       *  有隔壁鬼，如庚子土见癸丑木之类
       *  有空亡鬼，如甲戌见甲申乙酉之类，皆主为害
       *  墓鬼轻于窠鬼，壁鬼轻于墓鬼，空鬼轻于壁鬼，
       *
       *  若鬼中有鬼，谓之鬼啸如土命人生木月、金日时之类，以木克土，金克木，根基劣弱则凶，主本强健不忌
       *
       *  若木命人得火月、金日时之类，有火克金，金不得伤木，是御鬼也，鬼不为害。
       *  如水命人，四柱有火土，土克水，火又生土，是助鬼也，其鬼尤凶。
       *  干支通用纳音最紧，御鬼则立身于艰难，助鬼则骨肉多生乎破斗。
       *
       *  五行精纪
       *  【鬼论】
           窠中鬼者，如丙子见庚子、丁丑见辛丑之类是也。
            隔壁鬼者，如庚子见癸丑之类是也。
            墓中鬼者，如水人见丙辰，土人见戊辰之类是也。
            空亡鬼者，如甲戌见甲申乙酉之类是也。（天元变化书）
       * [2018-07-19 add by longzhiyou]
       */

      /**
       *   用法：
       *   1. 日柱是key 流年是value
       * [2018-07-19 add by longzhiyou]
       */
      //窠中鬼
      var jiazinayinmuban={
          "甲子":'海中金',"乙丑":"海中金","丙寅":"炉中火","丁卯":"炉中火","戊辰":"大林木","己巳":"大林木","庚午":"路旁土","辛未":"路旁土","壬申":"剑锋金","癸酉":"剑锋金","甲戌":"山头火","乙亥":"山头火",
          "丙子":"涧下水","丁丑":"涧下水","戊寅":"城头土","己卯":"城头土","庚辰":"白蜡金","辛巳":"白蜡金","壬午":"杨柳木","癸未":"杨柳木","甲申":"泉中水","乙酉":"泉中水","丙戌":"屋上土","丁亥":"屋上土",
          "戊子":"霹雳火","己丑":"霹雳火","庚寅":"松柏木","辛卯":"松柏木","壬辰":"长流水","癸巳":"长流水","甲午":"沙中金","乙未":"沙中金","丙申":"山下火","丁酉":"山下火","戊戌":"平地木","己亥":"平地木",
          "庚子":"壁上土","辛丑":"壁上土","壬寅":"金箔金","癸卯":"金箔金","甲辰":"复灯火","乙巳":"复灯火","丙午":"天河水","丁未":"天河水","戊申":"大驿土","己酉":"大驿土","庚戌":"钗钏金","辛亥":"钗钏金",
          "壬子":"桑拓木","癸丑":"桑拓木","甲寅":"大溪水","乙卯":"大溪水","丙辰":"沙中土","丁巳":"沙中土","戊午":"天上火","己未":"天上火","庚申":"石榴木","辛酉":"石榴木","壬戌":"大海水","癸亥":"大海水"
      };

      var chaozhonggui={
          "甲子":["戊子"],"乙丑":["己丑"],"丙寅":["甲寅"],"丁卯":["乙卯"],"戊辰":["庚辰"],"己巳":["辛巳"],"庚午":["壬午"],"辛未":["癸未"],"壬申":["丙申"],"癸酉":["丁酉"],"甲戌":[""],"乙亥":[""],
          "丙子":["庚子"],"丁丑":["辛丑"],"戊寅":["庚寅"],"己卯":["辛卯"],"庚辰":["甲辰"],"辛巳":["乙巳"],"壬午":["甲午"],"癸未":["乙未"],"甲申":["戊申"],"乙酉":["己酉"],"丙戌":[""],"丁亥":[""],
          "戊子":["丙子"],"己丑":["丁丑"],"庚寅":["壬寅"],"辛卯":["癸卯"],"壬辰":["丙辰"],"癸巳":["丁巳"],"甲午":["戊午"],"乙未":["己未"],"丙申":["甲申"],"丁酉":["乙酉"],"戊戌":[""],"己亥":[""],
          "庚子":["壬子"],"辛丑":["癸丑"],"壬寅":["丙寅"],"癸卯":["丁卯"],"甲辰":["壬辰"],"乙巳":["癸巳"],"丙午":["庚午"],"丁未":["辛未"],"戊申":["庚申"],"己酉":["辛酉"],"庚戌":[""],"辛亥":[""],
          "壬子":["甲子"],"癸丑":["乙丑"],"甲寅":["戊寅"],"乙卯":["己卯"],"丙辰":["戊辰"],"丁巳":["己巳"],"戊午":["丙午"],"己未":["丁未"],"庚申":["壬申"],"辛酉":["癸酉"],"壬戌":[""],"癸亥":[""]
      };


      vm.jiaziinfo="甲子";
      vm.getJiaziShuxing = function() {
          vm.resultJiazi=jiazishuxinglist[vm.jiaziinfo];
      };

      function getJiaZiIndex(jiazi) {
          for(var i=0;i<60;i++){
              if (sixtyJiaZi[i]===jiazi) {
                  return i;
              }
          }
          return 0 ;
      }

      //计算行年
      function calculateXingNian() {
          //传统算法 男-丙寅顺行 女-壬申逆行
          //丙寅索引 2 壬申索引 8

          if (vm.bazi.gender==="男") {

              for(var i=0;i<100;i++){

                  vm.xingnian[parseInt(i/10)][i%10]= sixtyJiaZi[(i+2)%60];
              }
          }
          else {
              for(var j=0;j<100;j++){

                  var index = (8-j)%60;
                  if (index<0) {
                      index = 60+index;
                  }

                  vm.xingnian[parseInt(j/10)][j%10]= sixtyJiaZi[index];

              }
          }

      }
      function calculateXingNianShiZhu() {
          //获取时柱
          var startIndex = sixtyJiaZi.indexOf(vm.bazi.shigan+vm.bazi.shizhi);

          //时柱 阳男阴女-顺行 阴男阳女-逆行
          if ((vm.bazi.gender==="男" && isYangGan(vm.bazi.niangan)) || (vm.bazi.gender==="女"&& !isYangGan(vm.bazi.niangan)) ) {
              for(var i=0;i<100;i++){

                  vm.xingnianShiZhu[parseInt(i/10)][i%10]= sixtyJiaZi[(i+startIndex+1)%60];
              }

          }else {
              for(var j=0;j<100;j++){

                  var index = (startIndex-j-1)%60;
                  if (index<0) {
                      index = 60+index;
                  }

                  vm.xingnianShiZhu[parseInt(j/10)][j%10]= sixtyJiaZi[index];

              }
      
          }


      }
      

  
      vm.back = back;
      function back() {
          $state.go('customers.index');
      }

      function pasebazi(strBaZi){
        var sizhu=[];
        for (var i=0;i<strBaZi.length;i++){
            var s = strBaZi[i];
            var b = false;
            if (tiangan.indexOf(s)>=0) {
                b=true;
            }else if (dizhi.indexOf(s)>=0) {
                b=true;
            }

            if (b) {
                sizhu.push(s);
            }

        }
        if(sizhu.length>7){
            vm.niangan = sizhu[0];
            vm.nianzhi = sizhu[1];
            vm.nianzhu = vm.niangan+vm.nianzhi;
            vm.niannayin = jiazinayin[vm.nianzhu];

            vm.yuegan = sizhu[2];
            vm.yuezhi = sizhu[3];
            vm.yuezhu = vm.yuegan+vm.yuezhi;
            vm.yuenayin = jiazinayin[vm.yuezhu];

            vm.rigan = sizhu[4];
            vm.rizhi = sizhu[5];
            vm.rizhu = vm.rigan+vm.rizhi;
            vm.rinayin = jiazinayin[vm.rizhu];

            vm.shigan = sizhu[6];
            vm.shizhi = sizhu[7];
            vm.shizhu = vm.shigan+vm.shizhi;
            vm.shinayin = jiazinayin[vm.shizhu];
        }
      }
      vm.analyze = analyze;
      function analyze () {
       
        pasebazi(vm.strBaZi);

       var result = {};
  
       result["年柱:"]={
            "名称":vm.nianzhu,
            "纳音五行":getnayin(vm.nianzhu),
            "禄":getlu(vm.niangan),
            "天乙贵人":gettianyi(vm.niangan),
            "食神":shishen[vm.niangan],
            "官":zhengguan[vm.niangan],
            "财":{"偏财":piancai[vm.niangan],"正财":zhengcai[vm.niangan]},
            "天干五行长生诀":getwuxingchangshengje(getganwuxing(vm.niangan)),

            "马":getma(vm.nianzhi),
            "劫杀":jiesha[vm.nianzhi],
            "亡神":wangshen[vm.nianzhi],
            "孤辰":"",
            "寡宿":"",
          
            "纳音长生诀":getnayinchangshengjue(getnayinwuxing(vm.nianzhu)),
            "五行正印":getwuxingzhengyin(getnayinwuxing(vm.nianzhu)),
            "鬼论":{
                "窠中鬼者":"如丙子见庚子、丁丑见辛丑之类是也",
                "隔壁鬼者":"如庚子见癸丑之类是也",
                "墓中鬼者":"如水人见丙辰，土人见戊辰之类是也",
                "空亡鬼者":"如甲戌见甲申乙酉之类是也"
            },
            "同类破":"如己未见甲辰、甲辰见己丑、己丑见甲戌、甲戌见己未。凡在四冲之地，纳音同类，逐两位逆数之，寅申巳亥、子午卯酉亦以此取，主平生不足，多不成器道。《经》云：“井栏互破，无药可医，遇空亡庶几，岁运亦忌之。"
        };
        result["调侯用神"]={};



        vm.analyzeResult=result;

        //   //设置纳音
        //   vm.bazi.niannayin = jiazinayin[vm.bazi.niangan+vm.bazi.nianzhi];
        //   vm.bazi.yuenayin =  jiazinayin[vm.bazi.yuegan+vm.bazi.yuezhi];

        //   vm.bazi.rinayin =  jiazinayin[vm.bazi.rigan+vm.bazi.rizhi];
        //   vm.bazi.shinayin =  jiazinayin[vm.bazi.shigan+vm.bazi.shizhi];


        //   vm.bazi.dayunnayin =  jiazinayin[vm.bazi.dayun];
        //   vm.bazi.liunianyanyin =  jiazinayin[vm.bazi.shigan+vm.bazi.shizhi];
        //   vm.bazi.xingniannayin =  jiazinayin[vm.bazi.shigan+vm.bazi.shizhi];

        //   vm.analyzeResult["调侯用神"]=tiaohou[vm.bazi.rigan+vm.bazi.yuezhi];
          

          
          //
          // vm.analyzeResult["纳音五行"]= {"大运":jiazinayin[vm.bazi.dayun]
          //
          //   ,"流年":jiazinayin[vm.bazi.liunian]
          //   ,"行年":jiazinayin[vm.bazi.xingnian]
          //
          // };
        //   vm.analyzeResult["鬼论"]= {
          
        //       "窠中鬼者":"如丙子见庚子、丁丑见辛丑之类是也",
        //       "隔壁鬼者":"如庚子见癸丑之类是也",
        //       "墓中鬼者":"如水人见丙辰，土人见戊辰之类是也",
        //       "空亡鬼者":"如甲戌见甲申乙酉之类是也"
        //   };
          // vm.analyzeResult["年柱信息"]=[
          //     {"年时鬼论":vm.bazi.nianzhu+":"+vm.bazi.niannayin+"-"+vm.bazi.shinayin}
          // ];
          //
          // vm.analyzeResult["日柱信息"]=[
          //     {"鬼论":"查看流年柱"}
          // ]



//        strBaZi = strBaZi.replace(" ", "");//去掉所有空格，包括首尾、中间
//        String[] split = strBaZi.split("");
//           if (sizhu.size()>7) {
//               return new BaZi(sizhu);
//           }else
//               return null;

      };

     

      function init(){
        if (vm.customer) {
            vm.strBaZi=vm.customer.bazi
            vm.selectedGender = getSelectedGender(vm.customer.gender);
        }
       analyze();

    }


    init();

  }

})();
